// ===========================================================================
/*!
	@file	aoAccount.h
	@brief	AoLibrary アカウント管理モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

/*
	■このモジュールでの用語
	・アカウントID
	（XBOX360が基準）
	ゲーム機本体に設定されているアカウントの中で、カレントのアカウントが
	どのパッドに割りあたっているかを示すID。
	ゲーム中は基本的に１つのアカウントIDのみが有効となり、
	有効なアカウントIDのパッドからのみ入力を取るようにする。
	XBOX360以外のプラットフォームの場合は、常に0番が有効なアカウントIDとなる。
*/

// ----- Include Files ---------------------------------------（インクルード）
#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）

#define AOD_ACCOUNT_MAX		(AMD_PAD_PORT_MAX)		//!< 最大アカウント数

// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	AoAccountInit
/*!
	アカウント管理モジュール初期化処理

	@note
	アプリケーション起動時に1度だけ呼び出して下さい。\n
	あらかじめ、AoSysInit関数が呼ばれている必要があります。\n
*/
// ===========================================================================
extern void AoAccountInit(void);

// ===========================================================================
//	AoAccountDebugInit
/*!
	デバッグ用初期化処理

	@note
	デバッグ用にカレントアカウントID自動設定します。\n
	設定されるIDは、接続されている最も若い番号のパッドのIDとなります。\n
	パッドが接続されていない場合は0番が設定されます。\n
	デバッグ環境外の場合は何も行いません。\n
	デバッグ環境では、AoAccountInit関数内で呼び出されています。\n
*/
// ===========================================================================
extern void AoAccountDebugInit(void);

// ===========================================================================
//	AoAccountExit
/*!
	アカウント管理モジュール終了処理

	@note
	アプリケーション終了時に1度だけ呼び出して下さい。\n
	AoAccountInit関数が呼び出されていない状態では、
	この関数を呼び出さないようにして下さい。\n
	この関数を呼出し後、再度AoAccountInit関数を呼び出すことはできません。\n
*/
// ===========================================================================
extern void AoAccountExit(void);

// ===========================================================================
//	AoAccountClearCurrentId
/*!
	カレントアカウントIDをクリア(初期状態)

	@note
	カレントのアカウントを未定の状態にし、
	AoAccountInit関数呼び出し直後の状態にします。\n
*/
// ===========================================================================
extern void AoAccountClearCurrentId(void);

// ===========================================================================
//	AoAccountSetCurrentIdStart
/*!
	カレントアカウントIDの設定開始

	@param id		[in] 設定するカレントアカウントID
	@note
	カレントのアカウントID(有効なパッドID)の設定を行います。\n
	この関数が呼び出されると、
	必要に応じてアカウントの選択処理やサインイン処理が行われるため、
	カレントアカウントの設定が完了するまでに時間が掛かる場合があります。\n
	カレントアカウントの設定が完了したかどうかは、
	AoAccountSetCurrentIdIsFinished関数で判定して下さい。\n
	また、設定がキャンセルされる場合もありますので、設定完了後
	AoAccountGetCurrentIdで有効なアカウントIDが取得できるかを
	判定するようにして下さい。\n
	カレントアカウントが設定されていない状態で呼び出して下さい。\n
*/
// ===========================================================================
extern void AoAccountSetCurrentIdStart(u32 id);

// ===========================================================================
//	AoAccountSetCurrentIdIsFinished
/*!
	カレントアカウントIDの設定完了判定

	@return 真：設定完了　偽：設定中
	@note
	AoAccountSetCurrentIdStart関数で開始した、
	カレントアカウントの設定処理が完了したかどうかを判定します。\n
*/
// ===========================================================================
extern BOOL AoAccountSetCurrentIdIsFinished(void);

// ===========================================================================
//	AoAccountGetCurrentId
/*!
	カレントアカウントIDの取得

	@return カレントアカウントID(負数：カレントなし)
	@note
	現在のカレントアカウントIDを返します。\n
	カレントアカウントIDが無効な場合は負数を返します。\n
	AoAccountSetCurrentIdStart関数を呼び出し、
	AoAccountSetCurrentIdIsFinished関数がTRUEを返した後に、
	この関数が負数を返すか正数を返すかで、
	カレントアカウントが設定されたか、キャンセルされたかを判定して下さい。\n
	一度、正常なアカウントIDを返すようになると、
	AoAccountClearCurrentId関数を呼び出すまで、
	返す値が変わることはありません。\n
*/
// ===========================================================================
extern s32 AoAccountGetCurrentId(void);

// ===========================================================================
//	AoAccountIsCurrentSignin
/*!
	カレントアカウントIDのサインイン済み判定

	@return 真：サインイン済み　偽：サインインしていない
	@note
	カレントアカウントIDが設定されている場合に、
	カレントアカウントがサインインしてるかどうかを判定します。\n
*/
// ===========================================================================
extern BOOL AoAccountIsCurrentSignin(void);

// ===========================================================================
//	AoAccountIsCurrentOnline
/*!
	カレントアカウントIDのオンライン対応判定

	@return 真：オンライン対応　偽：非対応
	@note
	カレントアカウントIDが設定されている場合に、
	カレントアカウントがオンライン対応してるかどうかを判定します。\n
*/
// ===========================================================================
extern BOOL AoAccountIsCurrentOnline(void);

// ===========================================================================
//	AoAccountIsCurrentEnable
/*!
	カレントアカウント有効判定

	@return 真：有効　偽：無効
	@note
	現在、カレントアカウントが有効であるかどうかを判定します。\n
	AoAccountSetCurrentIdStart関数でカレントアカウントを設定した後、
	この関数がFALSEを返す場合は、
	ユーザ操作によりアカウントが無効にされたことになるので、
	以降、アカウントを使用した各種処理は行えなくなります。\n
	タイトル画面へ戻るなどの対処を行うようにして下さい。\n
*/
// ===========================================================================
extern BOOL AoAccountIsCurrentEnable(void);

#if defined(AOD_PLATFORM_XBOX360)
// ===========================================================================
//	AoAccountIsCurrentEnableRealXbox360
/*!
	呼び出し時点でカレントアカウントが有効か判定(Xbox360のみ)

	@return 真：有効　偽：無効
	@note
	AoAccountIsCurrentEnable関数の呼び出しには遅延があるため、
	（SDKの関数呼び足をする際などに、）
	現時点でのアカウントが有効かどうかを判定するために
	この関数を呼び出して下さい。\n
	通常は、AoAccountIsCurrentEnable関数を使用すれば問題ありません。\n
*/
// ===========================================================================
extern BOOL AoAccountIsCurrentEnableRealXbox360(void);

// ===========================================================================
//! 全アカウント対象サインイン状態変更判定(現状ではプレゼンス専用)
// ===========================================================================
extern BOOL AoAccountIsAnySigninStateChanged(void);

// ===========================================================================
//! 全アカウント対象サインイン状態変更クリア(現状ではプレゼンス専用)
// ===========================================================================
extern void AoAccountClearAnySigninStateChanged(void);
#endif // defined(AOD_PLATFORM_XBOX360)

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
