// ===========================================================================
/*!
	@file	aoAction.h
	@brief	AoLibrary 2Dアクションランタイム宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）

// システム初期化デフォルト値
#define AOD_ACT_SYS_DEF_SPR_BUF_NUM		(128)	//!< スプライトバッファ数
#define AOD_ACT_SYS_DEF_ACT_BUF_NUM		(128)	//!< アクションバッファ数
#define AOD_ACT_SYS_DEF_SORT_BUF_NUM	(128)	//!< ソートバッファ数
#define AOD_ACT_SYS_DEF_ACM_STACK_NUM	(32)	//!< アキュムレートスタック数
#define AOD_ACT_SYS_DEF_DTASK_PRIO		(0x1000)		//!< 描画タスク優先度

// アクション状態 - ビットシフト値
#define AOD_ACT_STATE_ACT_SHIFT			(0)		//!< アクションシフト値
#define AOD_ACT_STATE_TRS_SHIFT			(1)		//!< トランスシフト値
#define AOD_ACT_STATE_MTN_SHIFT			(2)		//!< モーションシフト値
#define AOD_ACT_STATE_ANM_SHIFT			(3)		//!< アニメシフト値
#define AOD_ACT_STATE_MAT_SHIFT			(4)		//!< マテリアルシフト値
#define AOD_ACT_STATE_ATRS_SHIFT		(5)		//!< 継承トランスシフト値
#define AOD_ACT_STATE_AMTN_SHIFT		(6)		//!< 継承モーションシフト値
#define AOD_ACT_STATE_AMAT_SHIFT		(7)		//!< 継承マテリアルシフト値
#define AOD_ACT_STATE_USR_SHIFT			(8)		//!< ユーザシフト値
#define AOD_ACT_STATE_HIT_SHIFT			(9)		//!< 当たりシフト値

// アクション状態 - 終了フラグ
#define AOD_ACT_STATE_ACT_END	\
	(1 << AOD_ACT_STATE_ACT_SHIFT)				//!< アクション終了
#define AOD_ACT_STATE_TRS_END	\
	(1 << AOD_ACT_STATE_TRS_SHIFT)				//!< トランス終了
#define AOD_ACT_STATE_MTN_END	\
	(1 << AOD_ACT_STATE_MTN_SHIFT)				//!< モーション終了
#define AOD_ACT_STATE_ANM_END	\
	(1 << AOD_ACT_STATE_ANM_SHIFT)				//!< アニメ終了
#define AOD_ACT_STATE_MAT_END	\
	(1 << AOD_ACT_STATE_MAT_SHIFT)				//!< マテリアル終了
#define AOD_ACT_STATE_ATRS_END	\
	(1 << AOD_ACT_STATE_ATRS_SHIFT)				//!< 継承トランス終了
#define AOD_ACT_STATE_AMTN_END	\
	(1 << AOD_ACT_STATE_AMTN_SHIFT)				//!< 継承モーション終了
#define AOD_ACT_STATE_AMAT_END	\
	(1 << AOD_ACT_STATE_AMAT_SHIFT)				//!< 継承マテリアル終了
#define AOD_ACT_STATE_USR_END	\
	(1 << AOD_ACT_STATE_USR_SHIFT)				//!< ユーザ終了
#define AOD_ACT_STATE_HIT_END	\
	(1 << AOD_ACT_STATE_HIT_SHIFT)				//!< 当たり終了
#define AOD_ACT_STATE_ALL_END	(	\
	AOD_ACT_STATE_ACT_END |			\
	AOD_ACT_STATE_TRS_END |			\
	AOD_ACT_STATE_MTN_END |			\
	AOD_ACT_STATE_ANM_END |			\
	AOD_ACT_STATE_MAT_END |			\
	AOD_ACT_STATE_ATRS_END |		\
	AOD_ACT_STATE_AMTN_END |		\
	AOD_ACT_STATE_AMAT_END |		\
	AOD_ACT_STATE_USR_END |			\
	AOD_ACT_STATE_HIT_END)						//!< 全て終了

// アキュムレートスタックフラグ
#define AOD_ACT_ACM_FLAG_NO_TRS			(BIT_0)	//!< トランス積まない
#define AOD_ACT_ACM_FLAG_NO_MAT			(BIT_1)	//!< マテリアル積まない
#define AOD_ACT_ACM_FLAG_NO_ACM			(BIT_2)	//!< アキュム積まない
#define AOD_ACT_ACM_FLAG_NO_ALL			( \
	AOD_ACT_ACM_FLAG_NO_TRS | \
	AOD_ACT_ACM_FLAG_NO_MAT | \
	AOD_ACT_ACM_FLAG_NO_ACM)					//!< 積まない
#define AOD_ACT_ACM_FLAG_IGNORE_TRS		(BIT_3)	//!< トランス反映しない
#define AOD_ACT_ACM_FLAG_IGNORE_MAT		(BIT_4)	//!< マテリアル反映しない
#define AOD_ACT_ACM_FLAG_IGNORE_ACM		(BIT_5)	//!< アキュム反映しない
#define AOD_ACT_ACM_FLAG_IGNORE_ALL		( \
	AOD_ACT_ACM_FLAG_IGNORE_TRS | \
	AOD_ACT_ACM_FLAG_IGNORE_MAT | \
	AOD_ACT_ACM_FLAG_IGNORE_ACM)				//!< 反映しない

#define AOD_ACT_SCREEN_WIDTH		(960)	//!< 仮想スクリーン横サイズ
#define AOD_ACT_SCREEN_HEIGHT		(720)	//!< 仮想スクリーン縦サイズ

// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	enum AOE_ACT_TYPE
// ---------------------------------------------------------------------------
//!	アクションタイプ列挙
// ===========================================================================
typedef enum tag_AOE_ACT_TYPE {
	AOD_ACT_TYPE_ACTION		= 0,	//!< アクション
	AOD_ACT_TYPE_NODE,				//!< ノード

	AOD_ACT_TYPE_NUM,				//!< タイプ数
	AOD_ACT_TYPE_NONE,				//!< 無効コード
} AOE_ACT_TYPE;

// ===========================================================================
//	enum AOE_ACT_HIT
// ---------------------------------------------------------------------------
//!	当たりタイプ列挙
// ===========================================================================
typedef enum tag_AOE_ACT_HIT {
	AOD_ACT_HIT_RECT		= 0,	//!< 矩形
	AOD_ACT_HIT_CIRCLE,				//!< 円形

	AOD_ACT_HIT_NUM,				//!< タイプ数
	AOD_ACT_HIT_NONE,				//!< 無効コード
} AOE_ACT_HIT;

// ===========================================================================
//	enum AOE_ACT_CORW
// ---------------------------------------------------------------------------
//!	ワイド補正タイプ列挙
// ===========================================================================
typedef enum tag_AOE_ACT_CORW {
	AOD_ACT_CORW_NONE		= 0,	//!< 補正なし(横伸び)
	AOD_ACT_CORW_CENTER,			//!< 中央揃え
	AOD_ACT_CORW_LEFT,				//!< 左揃え
	AOD_ACT_CORW_RIGHT,				//!< 右揃え
	AOD_ACT_CORW_LEFT_S,			//!< 左揃え(横シフトあり)
	AOD_ACT_CORW_RIGHT_S,			//!< 右揃え(横シフトあり)

	AOD_ACT_CORW_NUM,				//!< タイプ数
} AOE_ACT_CORW;

// ----- Struct Definitions --------------------------------------（型の宣言）

// ===========================================================================
//	struct AOS_ACT_COL
// ---------------------------------------------------------------------------
//!	色構造体
// ===========================================================================
typedef struct tag_AOS_ACT_COL {
	union {
		struct {
			u8		a;				//!< 透明成分
			u8		b;				//!< 青色成分
			u8		g;				//!< 緑色成分
			u8		r;				//!< 赤色成分
		};
		u32			c;				//!< 色
	};
} AOS_ACT_COL;

// ===========================================================================
//	struct AOS_ACT_RECT
// ---------------------------------------------------------------------------
//!	矩形構造体
// ===========================================================================
typedef struct tag_AOS_ACT_RECT {
	f32				left;			//!< 左端位置
	f32				top;			//!< 上端位置
	f32				right;			//!< 右端位置
	f32				bottom;			//!< 下端位置
} AOS_ACT_RECT; // 16 byte

// ===========================================================================
//	struct AOS_ACT_CIRCLE
// ---------------------------------------------------------------------------
//!	円形構造体
// ===========================================================================
typedef struct tag_AOS_ACT_CIRCLE {
	f32				center_x;		//!< 中心X位置
	f32				center_y;		//!< 中心Y位置
	f32				radius;			//!< 半径
	u32				pad[1];			//!< パディング領域
} AOS_ACT_CIRCLE; // 16 byte

// ===========================================================================
//	struct AOS_ACT_HIT
// ---------------------------------------------------------------------------
//!	当たり構造体(外部要素適用前)
// ===========================================================================
typedef struct tag_AOS_ACT_HITP {
	u32				flag;			//!< フラグ
	AOE_ACT_HIT		type;			//!< 当たりタイプ
	f32				scale_x;		//!< 横スケール値
	f32				scale_y;		//!< 縦スケール値
	union {
		AOS_ACT_RECT	rect;		//!< 矩形
		AOS_ACT_CIRCLE	circle;		//!< 円形
	};
} AOS_ACT_HITP; // 32 byte

// ===========================================================================
//	struct AOS_ACT_HIT
// ---------------------------------------------------------------------------
/*!
	当たり構造体(外部要素適用後)
	変換順は、拡大、回転、移動
*/
// ===========================================================================
typedef struct tag_AOS_ACT_HIT {
	AOE_ACT_HIT		type;			//!< 当たりタイプ
	f32				center_x;		//!< 中心X座標
	f32				center_y;		//!< 中心Y座標
	f32				rotate;			//!< 回転
	f32				scale_x;		//!< 横スケール値
	f32				scale_y;		//!< 縦スケール値
	u32				pad[2];			//!< パディング領域
	union {
		AOS_ACT_RECT	rect;		//!< 矩形
		AOS_ACT_CIRCLE	circle;		//!< 円形
	};
} AOS_ACT_HIT; // 48 byte

// ===========================================================================
//	struct AOS_SPRITE
// ---------------------------------------------------------------------------
//!	スプライト構造体
// ===========================================================================
typedef struct tag_AOS_SPRITE {
	u32				flag;			//!< フラグ
	u32				blend;			//!< アルファブレンド
	AOS_ACT_COL		color;			//!< カラーRGBA8888
	AOS_ACT_COL		fade;			//!< フェードカラーRGBA8888
	f32				center_x;		//!< 中心X位置
	f32				center_y;		//!< 中心Y位置
	f32				prio;			//!< 表示優先度(Z値)
	u32				pad[1];			//!< パディング領域
	AOS_ACT_RECT	offset;			//!< 表示矩形
	f32				rotate;			//!< 回転角度(degree)
	NNS_TEXLIST*	texlist;		//!< テクスチャリスト
	s32				tex_id;			//!< テクスチャID
	u32				clamp;			//!< テクスチャクランプ
	AOS_ACT_RECT	uv;				//!< テクスチャ矩形
	AOS_ACT_HITP	hit;			//!< 当たり情報(pre)
} AOS_SPRITE; // 112 byte

typedef struct tag_AOS_ACTION AOS_ACTION;	//!< アクション構造体

// ===========================================================================
//	struct AOS_ACTION
// ---------------------------------------------------------------------------
//!	アクション構造体
// ===========================================================================
struct tag_AOS_ACTION {
	const void*		data;			//!< act or node
	u32				flag;			//!< フラグ
	u32				state;			//!< 状態
	AOE_ACT_TYPE	type;			//!< タイプ
	f32				frame;			//!< フレーム
	struct {
		s32			trs;			//!< 直前に使用したトランスキーID
		s32			mtn;			//!< 直前に使用したモーションキーID
		s32			anm;			//!< 直前に使用したアニメキーID
		s32			mat;			//!< 直前に使用したマテリアルキーID
		s32			atrs;			//!< 直前に使用した継承トランスキーID
		s32			amtn;			//!< 直前に使用した継承モーションキーID
		s32			amat;			//!< 直前に使用した継承マテリアルキーID
		s32			usr;			//!< 直前に使用したユーザキーID
		s32			hit;			//!< 直前に使用した当たりキーID
	} last_key;
	AOS_ACTION*		child;			//!< 子ノード
	AOS_ACTION*		sibling;		//!< 弟ノード
	AOS_SPRITE*		sprite;			//!< スプライト
	u32				pad[3];			//!< パディング領域
}; // 80 byte

// ===========================================================================
//	struct AOS_ACT_ACM
// ---------------------------------------------------------------------------
//!	アキュムレーション構造体
// ===========================================================================
typedef struct tag_AOS_ACT_ACM {
	// トランス
	f32				trans_x;		//!< トランスX成分
	f32				trans_y;		//!< トランスY成分
	f32				trans_z;		//!< トランスZ成分

	// マテリアル
	AOS_ACT_COL		color;			//!< カラー
	AOS_ACT_COL		fade;			//!< フェードカラー

	// アキュム
	f32				trans_scale_x;	//!< トランススケールX成分
	f32				trans_scale_y;	//!< トランススケールY成分
	f32				scale_x;		//!< スケールX成分
	f32				scale_y;		//!< スケールY成分
	f32				rotate;			//!< 回転

	u32				pad[2];			//!< パディング領域
} AOS_ACT_ACM; // 48 byte

// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ***************************************************************************
// システム
// ***************************************************************************
// ===========================================================================
//	AoActSysInit
/*!
	システム初期化

	@param spr_buf_num		[in] スプライトバッファ数
	@param act_buf_num		[in] アクションバッファ数
	@param sort_buf_num		[in] ソートバッファ数
	@param acm_stack_num	[in] アキュムレートスタック数
	@note
	システムの初期化を行い、このモジュールを使用できるようにします。\n
	このモジュール内の関数を使用する前に呼び出すようにして下さい。\n
	\n
	スプライトバッファ数は、
	AoActSprCreate関数で確保できるAOS_SPRITE構造体の数となります。
	(モジュール内部で自動的に確保される数も含みます)\n
	アクションバッファ数は、
	AoActCreate関数で確保できるAOS_ACTION構造体の数となります。
	(ノードを指定した場合は、一度の呼び出しでノード数分確保されます)\n
	ソートバッファ数は、
	AoActSortRegSprite関数で登録できるAOS_SPRITE構造体の数となります。
	(AoActSortRegAction関数を使用した場合はノード数分の登録がされます)\n
	アキュムレートスタック数は、
	AoActAcmPush関数でプッシュできるアキュムレートの数となります。
	また、AoActAcmPushFlag関数でプッシュできるフラグの数も、
	これと同じになります。\n
	\n
	各種バッファは、内部で自動確保され、
	AoActSysExit関数が呼び出されるまで保持されます。\n
	この関数を多重で呼び出した場合はアサートし何も行いません。\n
*/
// ===========================================================================
extern void AoActSysInit(
	u32 spr_buf_num = AOD_ACT_SYS_DEF_SPR_BUF_NUM,
	u32 act_buf_num = AOD_ACT_SYS_DEF_ACT_BUF_NUM,
	u32 sort_buf_num = AOD_ACT_SYS_DEF_SORT_BUF_NUM,
	u32 acm_stack_num = AOD_ACT_SYS_DEF_ACM_STACK_NUM);

// ===========================================================================
//	AoActSysReset
/*!
	システムリセット

	@note
	システムの状態を、AoActSysInit関数呼び出し直後の状態に戻します。\n
	このモジュールから確保したデータは
	全て使用できなくなるので注意して下さい。\n
	AoActSysInit関数を呼び出さずに、この関数を呼び出した場合は、
	アサートし何も行いません。\n
*/
// ===========================================================================
extern void AoActSysReset(void);

// ===========================================================================
//	AoActSysExit
/*!
	システム終了処理

	@note
	システムの状態を、AoActSysInit関数呼び出し前の状態に戻します。\n
	内部で確保したリソースの解放処理も行います。\n
	このモジュールから確保したデータは
	全て使用できなくなるので注意して下さい。\n
	AoActSysInit関数を呼び出さずに、この関数を呼び出した場合は、
	アサートし何も行いません。\n
	多重でこの関数を呼び出した場合は、何も行いません。\n
*/
// ===========================================================================
extern void AoActSysExit(void);

// ===========================================================================
//	AoActSysGetSprBufferSize
/*!
	スプライトバッファサイズ取得

	@return スプライトバッファサイズ
	@note
	AoActSysInit関数で指定したspr_buf_numの値がそのまま返ります。\n
*/
// ===========================================================================
extern u32 AoActSysGetSprBufferSize(void);

// ===========================================================================
//	AoActSysGetSprBufferRemain
/*!
	スプライトバッファ残りサイズ取得

	@return スプライトバッファ残りサイズ
*/
// ===========================================================================
extern u32 AoActSysGetSprBufferRemain(void);

// ===========================================================================
//	AoActSysGetSprBufferPeak
/*!
	スプライトバッファ最大使用サイズ取得

	@return スプライトバッファ最大使用サイズ
*/
// ===========================================================================
extern u32 AoActSysGetSprBufferPeak(void);

// ===========================================================================
//	AoActSysGetActBufferSize
/*!
	アクションバッファサイズ取得

	@return アクションバッファサイズ
	@note
	AoActSysInit関数で指定したact_buf_numの値がそのまま返ります。\n
*/
// ===========================================================================
extern u32 AoActSysGetActBufferSize(void);

// ===========================================================================
//	AoActSysGetActBufferRemain
/*!
	アクションバッファ残りサイズ取得

	@return アクションバッファ残りサイズ
*/
// ===========================================================================
extern u32 AoActSysGetActBufferRemain(void);

// ===========================================================================
//	AoActSysGetActBufferPeak
/*!
	アクションバッファ最大使用サイズ取得

	@return アクションバッファ最大使用サイズ
*/
// ===========================================================================
extern u32 AoActSysGetActBufferPeak(void);

// ===========================================================================
//	AoActSysGetSortBufferSize
/*!
	ソートバッファサイズ取得

	@return ソートバッファサイズ
	@note
	AoActSysInit関数で指定したsort_buf_numの値がそのまま返ります。\n
*/
// ===========================================================================
extern u32 AoActSysGetSortBufferSize(void);

// ===========================================================================
//	AoActSysGetSortBufferRemain
/*!
	ソートバッファ残りサイズ取得

	@return ソートバッファ残りサイズ
*/
// ===========================================================================
extern u32 AoActSysGetSortBufferRemain(void);

// ===========================================================================
//	AoActSysGetSortBufferPeak
/*!
	ソートバッファ最大使用サイズ取得

	@return ソートバッファ最大使用サイズ
*/
// ===========================================================================
extern u32 AoActSysGetSortBufferPeak(void);

// ===========================================================================
//	AoActSysGetAcmStackSize
/*!
	アキュムレートスタックサイズ取得

	@return アキュムレートスタックサイズ
	@note
	AoActSysInit関数で指定したacm_stack_numの値がそのまま返ります。\n
*/
// ===========================================================================
extern u32 AoActSysGetAcmStackSize(void);

// ===========================================================================
//	AoActSysGetAcmStackRemain
/*!
	アキュムレートスタック残りサイズ取得

	@return アキュムレートスタック残りサイズ
*/
// ===========================================================================
extern u32 AoActSysGetAcmStackRemain(void);

// ===========================================================================
//	AoActSysGetAcmBufferPeak
/*!
	アキュムレートスタック最大使用サイズ取得

	@return アキュムレートスタック最大使用サイズ
*/
// ===========================================================================
extern u32 AoActSysGetAcmBufferPeak(void);

// ===========================================================================
//	AoActSysGetAcmFlagStackSize
/*!
	アキュムレートフラグスタックサイズ取得

	@return アキュムレートフラグスタックサイズ
	@note
	AoActSysInit関数で指定したacm_stack_numの値がそのまま返ります。\n
*/
// ===========================================================================
extern u32 AoActSysGetAcmFlagStackSize(void);

// ===========================================================================
//	AoActSysGetAcmFlagStackRemain
/*!
	アキュムレートフラグスタック残りサイズ取得

	@return アキュムレートフラグスタック残りサイズ
*/
// ===========================================================================
extern u32 AoActSysGetAcmFlagStackRemain(void);

// ===========================================================================
//	AoActSysGetAcmFlagBufferPeak
/*!
	アキュムレートフラグスタック最大使用サイズ取得

	@return アキュムレートフラグスタック最大使用サイズ
*/
// ===========================================================================
extern u32 AoActSysGetAcmFlagBufferPeak(void);

// ===========================================================================
//	AoActSysClearPeak
/*!
	各種最大使用量のクリア
*/
// ===========================================================================
extern void AoActSysClearPeak(void);

// ===========================================================================
//	AoActSysSetDrawTaskPrio
/*!
	描画タスク優先度設定

	@param prio				[in] 描画タスク優先度
*/
// ===========================================================================
extern void AoActSysSetDrawTaskPrio(u32 prio = AOD_ACT_SYS_DEF_DTASK_PRIO);

// ===========================================================================
//	AoActSysSetDrawTaskPrio
/*!
	描画タスク優先度取得

	@return 描画タスク優先度
*/
// ===========================================================================
extern u32 AoActSysGetDrawTaskPrio(void);

// ===========================================================================
//	AoActSysSetDrawStateEnable
/*!
	描画ステート有効設定

	@param enable			[in] 真：有効　偽：無効
	@note
	描画ステートが有効な場合は、描画にamDrawPrimitive3Dを使用します。\n
	描画ステートが無効な場合は、独自の描画スレッドを作成し、
	NN関数を直接呼び出す形で描画を行います。\n
	デフォルトは無効となっています。\n
	描画ステートの設定はAoActSysSetDrawState関数で行って下さい。\n
*/
// ===========================================================================
extern void AoActSysSetDrawStateEnable(BOOL enable = FALSE);

// ===========================================================================
//	AoActSysGetDrawStateEnable
/*!
	描画ステート有効判定

	@return 真：有効　偽：無効
*/
// ===========================================================================
extern BOOL AoActSysGetDrawStateEnable(void);

// ===========================================================================
//	AoActSysSetDrawState
/*!
	描画ステート設定

	@param state			[in] 描画ステート
*/
// ===========================================================================
extern void AoActSysSetDrawState(u32 state = 0);

// ===========================================================================
//	AoActSysGetDrawState
/*!
	描画ステート取得

	@return 描画ステート
*/
// ===========================================================================
extern u32 AoActSysGetDrawState(void);

// ===========================================================================
//	AoActSysSetFrameRate
/*!
	システムフレームレート設定

	@param rate				[in] システムフレームレート
	@note
	アクションのフレームを更新する際に、
	個々のアクションに指定した更新フレームと、
	ここで指定した値を掛け合わせた値が実際に更新されるフレームとなります。
	(0.5を指定すると速度が半分に、2.0を指定すると倍速となります)\n
	デフォルトは1となります。\n
*/
// ===========================================================================
extern void AoActSysSetFrameRate(f32 rate = 1.0f);

// ===========================================================================
//	AoActSysGetFrameRate
/*!
	システムフレームレート取得

	@return システムフレームレート
*/
// ===========================================================================
extern f32 AoActSysGetFrameRate(void);

// ===========================================================================
//	AoActSysSetAdjust
/*!
	システムアジャスト設定

	@param x				[in] 横方向アジャスト値
	@param x				[in] 縦方向アジャスト値
	@note
	アクションを描画する際に、
	ここで指定したアジャスト値分だけ位置がオフセットされて表示されます。\n
	各種描画処理を呼び出した段階でのアジャスト値が使用されるので、
	描画処理を呼び出す度に値を変えることも可能です。\n
	デフォルトは、縦横ともに0(アジャストしない)となります。\n
*/
// ===========================================================================
extern void AoActSysSetAdjust(f32 x = 0.0f, f32 y = 0.0f);

// ===========================================================================
//	AoActSysAddAdjust
/*!
	システムアジャスト加算

	@param x				[in] 横方向加算アジャスト値
	@param x				[in] 縦方向加算アジャスト値
	@note
	現在のシステムアジャスト値に指定の値を加算します。\n
*/
// ===========================================================================
extern void AoActSysAddAdjust(f32 x, f32 y);

// ===========================================================================
//	AoActSysGetAdjustX
/*!
	横方向システムアジャスト値取得

	@return 横方向加算アジャスト値
*/
// ===========================================================================
extern f32 AoActSysGetAdjustX(void);

// ===========================================================================
//	AoActSysGetAdjustY
/*!
	縦方向システムアジャスト値取得

	@return 縦方向加算アジャスト値
*/
// ===========================================================================
extern f32 AoActSysGetAdjustY(void);


// ***************************************************************************
// テクスチャ
// ***************************************************************************
// ===========================================================================
//	AoActSetTexture
/*!
	テクスチャ設定

	@param texlist	[in] テクスチャリスト
	@note
	スプライトの生成時、ソート登録時、描画時に、
	ここで設定されているテクスチャが適用されます。\n
*/
// ===========================================================================
extern void AoActSetTexture(NNS_TEXLIST* texlist = NULL);

// ===========================================================================
//	AoActGetTexture
/*!
	テクスチャ取得

	@return テクスチャリスト
*/
// ===========================================================================
extern NNS_TEXLIST* AoActGetTexture(void);


// ***************************************************************************
// スプライト
// ***************************************************************************
// ===========================================================================
//	AoActSprCreate
/*!
	スプライト作成

	@param ama				[in] AMAファイル
	@param id				[in] アクションID
	@param frame			[in] フレーム
	@return 作成されたスプライト構造体
	@note
	指定AMAファイルの指定IDのアクションが指定フレームの状態での
	スプライトを作成します。\n
	この関数で作成したスプライトは、
	必ずAoActSprDelete関数で削除するようにして下さい。\n
	スプライトバッファが不足している場合は、アサートしNULLを返します。\n
	不正な引数を指定した場合は、アサートしNULLを返します。\n
*/
// ===========================================================================
extern AOS_SPRITE* AoActSprCreate(
	const void* ama, u32 id, f32 frame = 0.0f);

// ===========================================================================
//	AoActSprDelete
/*!
	スプライト削除

	@param spr				[io] 削除するスプライト構造体
	@note
	AoActSprCreate関数で作成したスプライトを削除します。\n
	ソートバッファに登録されている場合は、ソートバッファから削除されます。\n
	不正なスプライトを指定した場合は、アサートし何も行いません。\n
*/
// ===========================================================================
extern void AoActSprDelete(AOS_SPRITE* spr);

// ===========================================================================
//	AoActSprApply
/*!
	スプライトアクション反映

	@param spr				[out] 適用先スプライト
	@param ama				[in]  AMAファイル
	@param id				[in]  アクションID
	@param frame			[in]  フレーム
	@note
	指定のスプライトに指定のAMAファイルの指定IDのアクションが
	指定フレームの状態を適用します。\n
*/
// ===========================================================================
extern void AoActSprApply(
	AOS_SPRITE* spr, const void* ama, u32 id, f32 frame = 0.0f);

// ===========================================================================
//	AoActSprDraw
/*!
	スプライト描画

	@param spr				[in] スプライト構造体
	@note
	スプライトの描画を行います。\n
	内部で描画タスクが作成され、実際の描画は描画スレッドにて行われます。\n
	この関数を呼び出した回数分の描画タスクが生成されてしまうので、
	可能であれば、AoActSortDraw関数で描画を行うようにして下さい。\n
	ここで指定するスプライト構造体は、
	AoActSprCreate関数で作成したスプライトでなくても問題ありません。\n
*/
// ===========================================================================
extern void AoActSprDraw(AOS_SPRITE* spr);


// ***************************************************************************
// アクション
// ***************************************************************************
// ===========================================================================
//	AoActCreate
/*!
	アクション作成

	@param ama				[in] AMAファイル
	@param id				[in] アクションID
	@param frame			[in] フレーム
	@return 作成されたアクション構造体
	@note
	指定AMAファイルの指定IDのアクションが指定フレームの状態での
	アクションを作成します。\n
	この関数で作成したアクションは、
	必ずAoActDelete関数で削除するようにして下さい。\n
	アクションバッファが不足している場合は、アサートしNULLを返します。\n
	不正な引数を指定した場合は、アサートしNULLを返します。\n
*/
// ===========================================================================
extern AOS_ACTION* AoActCreate(
	const void* ama, u32 id, f32 frame = 0.0f);

// ===========================================================================
//	AoActCreateNode
/*!
	アクション作成（ノード）

	@param ama				[in] AMAファイル
	@param id				[in] ノードID
	@param frame			[in] フレーム
	@return 作成されたアクション構造体
	@note
	指定AMAファイルの指定IDのノードが指定フレームの状態での
	アクションを作成します。\n
	ノードが複数の階層を持っている場合、
	2つ以上のアクションが確保されルートノードのアクションを返します。\n
	この関数で作成したアクションは、
	必ずAoActDelete関数で削除するようにして下さい。\n
	アクションバッファが不足している場合は、
	アサートし作成できた分のアクションを返します。(NULLの場合もあります)\n
	不正な引数を指定した場合は、アサートしNULLを返します。\n
*/
// ===========================================================================
extern AOS_ACTION* AoActCreateNode(
	const void* ama, u32 id, f32 frame = 0.0f);

// ===========================================================================
//	AoActDelete
/*!
	アクション削除

	@param spr				[io] 削除するアクション構造体
	@note
	AoActCreate関数、もしくはAoActCreateNode関数で作成した
	アクションを削除します。\n
	ソートバッファに登録されている場合は、ソートバッファから削除されます。\n
	不正なアクションを指定した場合は、アサートし何も行いません。\n
*/
// ===========================================================================
extern void AoActDelete(AOS_ACTION* act);

// ===========================================================================
//	AoActSetFrame
/*!
	アクションフレーム削除

	@param act				[io] アクション構造体
	@param frame			[in] 設定するフレーム
	@note
	指定のアクションを指定のフレームでの状態にします。\n
	通常、1フレームずつ更新する場合などは、
	AoActUpdate関数を使用したほうが高速に処理されます。\n
*/
// ===========================================================================
extern void AoActSetFrame(AOS_ACTION* act, f32 frame);

// ===========================================================================
//	AoActUpdate
/*!
	アクション更新

	@param act				[io] アクション構造体
	@param frame			[in] 更新するフレーム数
	@note
	指定のアクションを指定のフレームだけ更新した状態にします。\n
	実際に更新されるフレーム数は、
	frameにシステムフレームレートを掛け合わせた値となります。\n
*/
// ===========================================================================
extern void AoActUpdate(AOS_ACTION* act, f32 frame = 1.0f);

// ===========================================================================
//	AoActDraw
/*!
	アクション描画

	@param act				[io] アクション構造体
	@param sort				[in] 真：ソートする　偽：ソートしない
	@note
	アクションの描画を行います。\n
	内部で描画タスクが作成され、実際の描画は描画スレッドにて行われます。\n
	この関数を呼び出した回数分の描画タスクが生成されてしまうので、
	可能であれば、AoActSortDraw関数で描画を行うようにして下さい。\n
*/
// ===========================================================================
extern void AoActDraw(AOS_ACTION* act, BOOL sort = FALSE);

// ===========================================================================
//	AoActGetState
/*!
	アクション状態取得

	@param act				[in] アクション構造体
	@return アクション状態(AOD_ACT_STATE_***_END)
*/
// ===========================================================================
extern u32 AoActGetState(const AOS_ACTION* act);

// ===========================================================================
//	AoActIsEnd
/*!
	アクション終了判定

	@param act				[in] アクション構造体
	@return 真：終了済み　偽：それ以外
*/
// ===========================================================================
extern BOOL AoActIsEnd(const AOS_ACTION* act);

// ===========================================================================
//	AoActIsEndTrs
/*!
	アクション トランス終了判定

	@param act				[in] アクション構造体
	@return 真：終了済み　偽：それ以外
*/
// ===========================================================================
extern BOOL AoActIsEndTrs(const AOS_ACTION* act);

// ===========================================================================
//	AoActIsEndMtn
/*!
	アクション モーション終了判定

	@param act				[in] アクション構造体
	@return 真：終了済み　偽：それ以外
*/
// ===========================================================================
extern BOOL AoActIsEndMtn(const AOS_ACTION* act);

// ===========================================================================
//	AoActIsEndAnm
/*!
	アクション アニメ終了判定

	@param act				[in] アクション構造体
	@return 真：終了済み　偽：それ以外
*/
// ===========================================================================
extern BOOL AoActIsEndAnm(const AOS_ACTION* act);

// ===========================================================================
//	AoActIsEndMat
/*!
	アクション マテリアル終了判定

	@param act				[in] アクション構造体
	@return 真：終了済み　偽：それ以外
*/
// ===========================================================================
extern BOOL AoActIsEndMat(const AOS_ACTION* act);

// ===========================================================================
//	AoActIsEndAcmTrs
/*!
	アクション 継承トランス終了判定

	@param act				[in] アクション構造体
	@return 真：終了済み　偽：それ以外
*/
// ===========================================================================
extern BOOL AoActIsEndAcmTrs(const AOS_ACTION* act);

// ===========================================================================
//	AoActIsEndAcmMtn
/*!
	アクション 継承モーション終了判定

	@param act				[in] アクション構造体
	@return 真：終了済み　偽：それ以外
*/
// ===========================================================================
extern BOOL AoActIsEndAcmMtn(const AOS_ACTION* act);

// ===========================================================================
//	AoActIsEndAcmMat
/*!
	アクション 継承マテリアル終了判定

	@param act				[in] アクション構造体
	@return 真：終了済み　偽：それ以外
*/
// ===========================================================================
extern BOOL AoActIsEndAcmMat(const AOS_ACTION* act);

// ===========================================================================
//	AoActIsEndUsr
/*!
	アクション ユーザ終了判定

	@param act				[in] アクション構造体
	@return 真：終了済み　偽：それ以外
*/
// ===========================================================================
extern BOOL AoActIsEndUsr(const AOS_ACTION* act);

// ===========================================================================
//	AoActIsEndHit
/*!
	アクション 当たり終了判定

	@param act				[in] アクション構造体
	@return 真：終了済み　偽：それ以外
*/
// ===========================================================================
extern BOOL AoActIsEndHit(const AOS_ACTION* act);


// ***************************************************************************
// ソート
// ***************************************************************************
// ===========================================================================
//	AoActSortRegSprite
/*!
	スプライトのソートバッファ登録

	@param spr				[in] スプライト構造体
	@note
	ソートバッファに指定のスプライトを登録します。\n
	登録したスプライトはAoActSortUnregSprite関数、
	もしくはAoActSortUnregAll関数を呼び出すまで
	ソートバッファに登録されたままになりますので、複数回の登録は不要です。\n
	既に登録済みのスプライトを指定した場合は何も行いません。\n
	ソートバッファが不足している場合は、アサートし何も行いません。\n
*/
// ===========================================================================
extern void AoActSortRegSprite(AOS_SPRITE* spr);

// ===========================================================================
//	AoActSortUnregSprite
/*!
	スプライトのソートバッファ登録解除

	@param spr				[in] スプライト構造体
	@note
	ソートバッファに登録されている指定のスプライトを登録解除します。\n
	指定のスプライトが登録されていない場合は、何も行いません。\n
*/
// ===========================================================================
extern void AoActSortUnregSprite(AOS_SPRITE* spr);

// ===========================================================================
//	AoActSortRegAction
/*!
	アクションのソートバッファ登録

	@param act				[in] アクション構造体
	@note
	ソートバッファに指定のアクションを登録します。\n
	登録したアクションはAoActSortUnregAction関数、
	もしくはAoActSortUnregAll関数を呼び出すまで
	ソートバッファに登録されたままになりますので、複数回の登録は不要です。\n
	既に登録済みのアクションを指定した場合は何も行いません。\n
	ソートバッファが不足している場合は、
	アサートし登録できる分だけを登録します。\n
*/
// ===========================================================================
extern void AoActSortRegAction(AOS_ACTION* act);

// ===========================================================================
//	AoActSortUnregAction
/*!
	アクションのソートバッファ登録解除

	@param act				[in] アクション構造体
	@note
	ソートバッファに登録されている指定のアクションを登録解除します。\n
	指定のアクションが登録されていない場合は、何も行いません。\n
*/
// ===========================================================================
extern void AoActSortUnregAction(AOS_ACTION* act);

// ===========================================================================
//	AoActSortUnregAction
/*!
	ソートバッファの全要素の登録解除

	@note
	ソートバッファに登録されている全ての要素を登録解除します。\n
	ソートバッファに何も登録されていない場合は、何も行いません。\n
*/
// ===========================================================================
extern void AoActSortUnregAll(void);

// ===========================================================================
//	AoActSortExecute
/*!
	ソート実行

	@note
	ソートバッファに登録されている要素をZ順にソートします。\n
	ソート結果は保持されるので、Z順が変わらないのであれば、
	以降のソート処理は不要です。\n
*/
// ===========================================================================
extern void AoActSortExecute(void);

#if defined(AOD_PLATFORM_IPHONE)
// ===========================================================================
//	AoActSortExecuteFix
/*!
	ソート実行(不具合修正)

	@note
	AoActSortExecuteでは不具合に依りソートしきらない場合があります。
	この関数はその不具合修正版です。
*/
// ===========================================================================
extern void AoActSortExecuteFix(void);
#endif //defined(AOD_PLATFORM_IPHONE)

// ===========================================================================
//	AoActSortDraw
/*!
	ソートバッファ内要素の描画

	@note
	ソートバッファに登録されている全ての要素の描画処理を行います。\n
	描画は、この関数呼び出し時点でのソートバッファの順番に行われるので、
	事前にAoActSortExecute関数を呼び出し、
	描画順序が適切なものになるようにして下さい。\n
	内部で描画タスクを生成し、描画スレッドにて実際の描画処理が行われます。\n
*/
// ===========================================================================
extern void AoActSortDraw(void);


// ***************************************************************************
// アキュムレートスタック
// ***************************************************************************
// ===========================================================================
//	AoActAcmInit
/*!
	アキュムレート初期化

	@param acm				[out] 初期化するアキュムレート(NULLならカレント)
*/
// ===========================================================================
extern void AoActAcmInit(AOS_ACT_ACM* acm = NULL);

// ===========================================================================
//	AoActAcmPush
/*!
	アキュムレートプッシュ

	@param acm				[in] プッシュするアキュムレート(NULLならカレント)
	@note
	スタックを超えてプッシュした場合は、アサートし何も行いません。\n
*/
// ===========================================================================
extern void AoActAcmPush(const AOS_ACT_ACM* acm = NULL);

// ===========================================================================
//	AoActAcmPop
/*!
	アキュムレートポップ

	@param count			[in] ポップする回数
	@note
	指定の回数アキュムレートスタックをポップします。\n
	プッシュ回数よりも多くポップした場合は、アサートし何も行いません。\n
*/
// ===========================================================================
extern void AoActAcmPop(u32 count = 1);

// ===========================================================================
//	AoActAcmSet
/*!
	アキュムレート設定

	@param acm				[in] 設定するアキュムレート
	@note
	カレントアキュムレートに指定したアキュムレートを設定します。\n
*/
// ===========================================================================
extern void AoActAcmSet(const AOS_ACT_ACM* acm);

// ===========================================================================
//	AoActAcmApply
/*!
	アキュムレート適用

	@param acm				[in] 適用するアキュムレート
	@note
	カレントアキュムレートに指定したアキュムレートを掛け合わせます。\n
*/
// ===========================================================================
extern void AoActAcmApply(const AOS_ACT_ACM* acm);

// ===========================================================================
//	AoActAcmApplyTrans
/*!
	アキュムレート トランス適用

	@param trs				[in] 適用するトランス
*/
// ===========================================================================
extern void AoActAcmApplyTrans(const AMS_VECTOR* trs);

// ===========================================================================
//	AoActAcmApplyTrans
/*!
	アキュムレート トランス適用

	@param x				[in] 適用するトランスX成分
	@param y				[in] 適用するトランスY成分
	@param z				[in] 適用するトランスZ成分
*/
// ===========================================================================
extern void AoActAcmApplyTrans(f32 x, f32 y, f32 z);

// ===========================================================================
//	AoActAcmApplyColor
/*!
	アキュムレート カラー適用

	@param col				[in] 適用するカラー
*/
// ===========================================================================
extern void AoActAcmApplyColor(AOS_ACT_COL col);

// ===========================================================================
//	AoActAcmApplyFade
/*!
	アキュムレート フェードカラー適用

	@param fade				[in] 適用するフェードカラー
*/
// ===========================================================================
extern void AoActAcmApplyFade(AOS_ACT_COL fade);

// ===========================================================================
//	AoActAcmApplyTransScale
/*!
	アキュムレート トランススケール適用

	@param tscl				[in] 適用するトランススケール
*/
// ===========================================================================
extern void AoActAcmApplyTransScale(const AMS_VECTOR* tscl);

// ===========================================================================
//	AoActAcmApplyTransScale
/*!
	アキュムレート トランススケール適用

	@param x				[in] 適用するトランススケールX成分
	@param y				[in] 適用するトランススケールY成分
*/
// ===========================================================================
extern void AoActAcmApplyTransScale(f32 x, f32 y);

// ===========================================================================
//	AoActAcmApplyScale
/*!
	アキュムレート スケール適用

	@param scl				[in] 適用するスケール
*/
// ===========================================================================
extern void AoActAcmApplyScale(const AMS_VECTOR* scl);

// ===========================================================================
//	AoActAcmApplyScale
/*!
	アキュムレート スケール適用

	@param x				[in] 適用するスケールX成分
	@param y				[in] 適用するスケールY成分
*/
// ===========================================================================
extern void AoActAcmApplyScale(f32 x, f32 y);

// ===========================================================================
//	AoActAcmApplyRotate
/*!
	アキュムレート 回転適用

	@param rot				[in] 適用する回転
*/
// ===========================================================================
extern void AoActAcmApplyRotate(f32 rot);

// ===========================================================================
//	AoActAcmSetFlag
/*!
	アキュムレートフラグ設定

	@param flag				[in] 設定するアキュムレートフラグ
	@note
	指定のアキュムレートフラグをカレントに設定します。\n
*/
// ===========================================================================
extern void AoActAcmSetFlag(u32 flag = 0);

// ===========================================================================
//	AoActAcmGetFlag
/*!
	アキュムレートフラグ取得

	@param flag				[in] カレントアキュムレートフラグ
*/
// ===========================================================================
extern u32 AoActAcmGetFlag(void);

// ===========================================================================
//	AoActAcmFlagPush
/*!
	アキュムレートフラグプッシュ

	@param on				[in] 有効にするアキュムレートフラグ
	@param off				[in] 無効にするアキュムレートフラグ
	@note
	カレントフラグをプッシュした後に、
	カレントに対して指定のフラグ操作を行います。\n
	スタックを超えてプッシュした場合は、アサートし何も行いません。\n
*/
// ===========================================================================
extern void AoActAcmFlagPush(u32 on = 0, u32 off = 0);

// ===========================================================================
//	AoActAcmFlagPop
/*!
	アキュムレートフラグポップ

	@param count			[in] ポップする回数
	@note
	指定の回数アキュムレートフラグスタックをポップします。\n
	プッシュ回数を超えてポップした場合は、アサートし何も行いません。\n
*/
// ===========================================================================
extern void AoActAcmFlagPop(u32 count = 1);


// ***************************************************************************
// 当たり
// ***************************************************************************
// ===========================================================================
//	AoActGetHitSpr
/*!
	スプライトの当たり情報取得

	@param hit				[out] 当たり情報
	@param spr				[in]  スプライト構造体
	@return 真：有効な当たり情報あり　偽：なし
	@note
	指定のスプライトに含まれる当たり情報に、
	移動や拡大を適用させた最終結果をhitに格納ます。\n
	当たり情報が無い場合と、無効な当たり情報が設定されている場合は
	FALSEを返します。\n
*/
// ===========================================================================
extern BOOL AoActGetHitSpr(AOS_ACT_HIT* hit, const AOS_SPRITE* spr);

// ===========================================================================
//	AoActGetHitAct
/*!
	アクションの当たり情報取得

	@param hit				[out] 当たり情報
	@param act				[in]  アクション構造体
	@return 真：有効な当たり情報あり　偽：なし
	@note
	指定のアクションに含まれる当たり情報に、
	移動や拡大を適用させた最終結果をhitに格納ます。\n
	当たり情報が無い場合と、無効な当たり情報が設定されている場合は
	FALSEを返します。\n
	アクションの親子関係は探索しません。\n
*/
// ===========================================================================
extern BOOL AoActGetHitAct(AOS_ACT_HIT* hit, const AOS_ACTION* act);

// ===========================================================================
//	AoActGetHitNum
/*!
	アクション(親子階層)の当たり情報数取得

	@param act				[in]  アクション構造体
	@return 真：当たり情報数
	@note
	指定アクションの親子階層をたどり、
	有効な当たり情報がいくつあるかを算出します。\n
	この関数の戻り値が、
	AoActUtilGetActNum関数の戻り値より多くなることはありません。\n
*/
// ===========================================================================
extern u32 AoActGetHitNum(const AOS_ACTION* act);

// ===========================================================================
//	AoActGetHitTbl
/*!
	アクション(親子階層)の当たり情報配列取得

	@param hit_tbl			[out] 当たり情報配列
	@param act				[in]  アクション構造体
	@return 真：当たり情報数
	@note
	指定アクションの親子階層をたどり、
	有効な当たり情報をhit_tblに格納し、
	hit_tblに格納した当たり情報数を返します。\n
	hit_tblの要素数は、AoActGetHitNum以上を用意するようにしてください。\n
*/
// ===========================================================================
extern u32 AoActGetHitTbl(AOS_ACT_HIT* hit_tbl, const AOS_ACTION* act);

// ===========================================================================
//	AoActGetHitTbl
/*!
	アクション(親子階層)の当たり情報配列取得

	@param hit_tbl			[out] 当たり情報配列
	@param size				[in]  当たり情報配列の要素数
	@param act				[in]  アクション構造体
	@return 真：当たり情報数
	@note
	指定アクションの親子階層をたどり、
	有効な当たり情報をhit_tblに格納し、
	hit_tblに格納した当たり情報数を返します。\n
	当たり情報数がsizeよりも多かった場合は、
	sizeまでを格納した時点で処理を終了します。\n
*/
// ===========================================================================
extern u32 AoActGetHitTbl(
	AOS_ACT_HIT* hit_tbl, u32 size, const AOS_ACTION* act);

// ===========================================================================
//	AoActGetHitActId
/*!
	アクションの当たり情報取得

	@param hit				[out] 当たり情報
	@param act				[in]  アクション構造体
	@param id				[in]  AMAアクションID
	@return 真：有効な当たり情報あり　偽：なし
	@note
	指定のアクションの親子関係を探査し、
	指定のAMAアクションIDのアクションが有る場合は、
	そのアクションの当たり情報をhitに格納ます。\n
	当たり情報が無い場合と、無効な当たり情報が設定されている場合は
	FALSEを返します。\n
*/
// ===========================================================================
extern BOOL AoActGetHitActId(AOS_ACT_HIT* hit, const AOS_ACTION* act, u32 id);

// ===========================================================================
//	AoActHitTest
/*!
	hittest

	@param hit				[in] 当たり情報
	@param x				[in] 当たり判定X位置
	@param y				[in] 当たり判定Y位置
	@return 真：当たりあり　偽：なし
	@note
	指定の当たり情報に指定の判定位置が当たっているかどうか
	(当たり情報の内側かどうか)
	を判定します。\n
	座標補正を行なわずに判定する点に注意して下さい。\n
*/
// ===========================================================================
extern BOOL AoActHitTest(const AOS_ACT_HIT* hit, f32 x, f32 y);

// ===========================================================================
//	AoActHitTestCorReverse
/*!
	hittest(座標補正あり) ※座標補正はiPhone版のみ対応

	@param hit				[in] 当たり情報
	@param x				[in] 当たり判定X位置
	@param y				[in] 当たり判定Y位置
	@return 真：当たりあり　偽：なし
	@note
	AoActHitTest関数の座標補正あり版です。\n
	画面座標として判定位置を指定することで、
	内部で現在の画面モードを判定し、適切な当たり判定を行います。\n
*/
// ===========================================================================
extern BOOL AoActHitTestCorReverse(const AOS_ACT_HIT* hit, f32 x, f32 y);


// ***************************************************************************
// ユーティリティ
// ***************************************************************************
// ===========================================================================
//	AoActUtilGetActNum
/*!
	アクション数取得

	@param act				[in] アクション構造体
	@return アクション数
	@note
	指定のアクションの親子階層を探査し、
	いくつのアクションで構成されているか調べます。\n
	同じアクションの場合は、この関数の戻り値が変わることはありません。\n
*/
// ===========================================================================
extern u32 AoActUtilGetActNum(const AOS_ACTION* act);

// ===========================================================================
//	AoActUtilGetActFromId
/*!
	AMAアクションIDよりアクション取得

	@param act				[in] アクション構造体
	@param id				[in] AMAアクションID
	@return アクション(NULL:該当なし)
	@note
	指定のアクションの親子階層を探査し、
	指定のAMAアクションIDを持つアクションを返します。\n
	該当するアクションが無い場合はNULLを返します。\n
	戻り値のアクションは参照のみ可能です。(変更不可)\n
*/
// ===========================================================================
extern const AOS_ACTION* AoActUtilGetActFromId(const AOS_ACTION* act, u32 id);

// ===========================================================================
//	AoActUtilGetSprFromAct
/*!
	アクションよりスプライト取得

	@param act				[in] アクション構造体
	@return スプライト
	@note
	指定のアクションに含まれるスプライトを返します。\n
	戻り値のスプライトは参照のみ可能です。(変更不可)\n
*/
// ===========================================================================
extern const AOS_SPRITE* AoActUtilGetSprFromAct(const AOS_ACTION* act);

// ===========================================================================
//	AoActDrawCorWide
/*!
	頂点データのワイド補正

	@param v		[io] 頂点配列
	@param v_num	[in] 頂点数
	@param type		[in] 補正タイプ
*/
// ===========================================================================
extern void AoActDrawCorWide(NNS_PRIM3D_P* v, u32 v_num, AOE_ACT_CORW type);

// ===========================================================================
//	AoActDrawCorWide
/*!
	頂点データのワイド補正

	@param v		[io] 頂点配列
	@param v_num	[in] 頂点数
	@param type		[in] 補正タイプ
*/
// ===========================================================================
extern void AoActDrawCorWide(NNS_PRIM3D_PC* v, u32 v_num, AOE_ACT_CORW type);

// ===========================================================================
//	AoActDrawCorWide
/*!
	頂点データのワイド補正

	@param v		[io] 頂点配列
	@param v_num	[in] 頂点数
	@param type		[in] 補正タイプ
*/
// ===========================================================================
extern void AoActDrawCorWide(NNS_PRIM3D_PCT* v, u32 v_num, AOE_ACT_CORW type);

// ===========================================================================
//	AoActDrawCorWide
/*!
	座標データのワイド補正

	@param x		[io] X座標
	@param y		[io] Y座標
	@param type		[in] 補正タイプ
*/
// ===========================================================================
extern void AoActDrawCorWide(f32* x, f32* y, AOE_ACT_CORW type);

// ===========================================================================
//	AoActCorWideR
/*!
	座標の逆補正 ※iPhone版のみ対応

	@param x	[io] 補正X座標
	@param y	[io] 補正Y座標
	@note
	画面座標を指定することで、内部で適切な補正を行い、
	aoAction内で使用している座標系に変換します。\n
	aoAction内では
	横AOD_ACT_SCREEN_WIDTHx縦AOD_ACT_SCREEN_HEIGHT
	の解像度でデータを扱っており、
	画面解像度とは必ずしも一致しないので、
	必要に応じて、この関数で座標変換を行なうようにして下さい。\n
*/
// ===========================================================================
extern void AoActCorReverse(f32* x, f32* y);

// ===========================================================================
//	AoActUtilGetChild
/*!
	指定アクションの子アクション取得

	@param act		[in] アクション
	@return 指定アクションの子アクション
*/
// ===========================================================================
extern const AOS_ACTION* AoActUtilGetChild(const AOS_ACTION* act);

// ===========================================================================
//	AoActUtilGetSibling
/*!
	指定アクションの弟アクション取得

	@param act		[in] アクション
	@return 指定アクションの弟アクション
*/
// ===========================================================================
extern const AOS_ACTION* AoActUtilGetSibling(const AOS_ACTION* act);


// ***************************************************************************
// ファイル
// ***************************************************************************
// ===========================================================================
//	AoActIsAma
/*!
	AMAファイル判定

	@param file				[in] 判定するファイル
	@return 真：AMAファイル　偽：それ以外
	@note
	引数で指定したファイルがAMAファイルであるか判定します。\n
	ヘッダ情報のみを判定するので、
	全てのデータが正常であるかの判定は行いません。\n
	AoActAmaConv関数を呼び出した後のAMAファイルであっても、
	AMAファイルと判定されます。\n
*/
// ===========================================================================
extern BOOL AoActIsAma(const void* file);

// ===========================================================================
//	AoActAmaConv
/*!
	アドレス変換

	@param file				[io] アドレス変換するAMAファイル
	@return 1:正常に変換 0:既に変換済みorそれ以外
	@note
	引数で指定したAMAファイルのアドレス変換を行います。\n
	正常に変換が完了した場合は1を返します。\n
	既に変換済みの場合は何も行わずに0を返します。\n
	AMAファイル以外のファイルを指定した場合は、
	アサートし何も行わず0を返します。\n
*/
// ===========================================================================
extern s32 AoActAmaConv(u8* file);

// ===========================================================================
//	AoActRegAliceAmaConv
/*!
	AliceへAMAアドレス変換登録

	@note
	amConvertAddress関数でAMAファイルのアドレス変換を行えるように、
	AliceにAMAを登録します。\n
*/
// ===========================================================================
extern void AoActRegAliceAmaConv(void);


// ***************************************************************************
// 描画スレッド用
// ***************************************************************************
// ===========================================================================
//	AoActDrawPre
/*!
	ステート描画時の描画前処理

	@note
	ステート描画を使用してアクションの描画を行う際には、
	描画コマンドを実行する前にこの関数を呼び出して下さい。\n
	内部で射影やカメラの設定を行っています。\n
*/
// ===========================================================================
extern void AoActDrawPre(void);


// ***************************************************************************
// デバッグ
// ***************************************************************************
#if defined(AOD_DEBUG)

// ===========================================================================
//	AoActDebugShowInfo
/*!
	システム情報表示

	@param x				[in] デバッグテキスト表示左上X位置
	@param y				[in] デバッグテキスト表示左上Y位置
*/
// ===========================================================================
extern void AoActDebugShowInfo(u32 x = 8, u32 y = 8);

// ===========================================================================
//	AoActDebugSetShowHitFlag
/*!
	当たり表示設定

	@param enable			[in] 真：表示　偽：非表示
*/
// ===========================================================================
extern void AoActDebugSetShowHitFlag(BOOL enable = FALSE);

// ===========================================================================
//	AoActDebugGetShowHitFlag
/*!
	当たり表示取得

	@return 真：表示　偽：非表示
*/
// ===========================================================================
extern BOOL AoActDebugGetShowHitFlag(void);

// ===========================================================================
//	AoActDebugSetShowHitColor
/*!
	当たり表示色設定

	@param color			[in] 当たり表示色(RGBA8888)
*/
// ===========================================================================
extern void AoActDebugSetShowHitColor(u32 color = 0xffffffff);

// ===========================================================================
//	AoActDebugGetShowHitColor
/*!
	当たり表示色取得

	@return 当たり表示色(RGBA8888)
*/
// ===========================================================================
extern u32 AoActDebugGetShowHitColor(void);

#else

#define AoActDebugShowInfo(...)
#define AoActDebugSetShowHitFlag(...)
#define AoActDebugGetShowHitFlag(...)	(FALSE)
#define AoActDebugSetShowHitColor(...)
#define AoActDebugGetShowHitColor(...)	(0xffffffff)

#endif // defined(AOD_DEBUG)

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
