// ===========================================================================
/*!
	@file	aoFont.h
	@brief	AoLibrary システムフォントモジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

#if defined(AOD_PLATFORM_WII)

// ----- Include Files ---------------------------------------（インクルード）
#include "ao.h"

#include <revolution/fnt.h>

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	enum AOE_FONT_ALIGN
// ---------------------------------------------------------------------------
//!	行揃え列挙
// ===========================================================================
typedef enum tag_AOE_FONT_ALIGN {
	AOD_FONT_ALIGN_LEFT			= 0,	//!< 左揃え
	AOD_FONT_ALIGN_CENTER,				//!< 中央揃え
	AOD_FONT_ALIGN_RIGHT,				//!< 右揃え

	AOD_FONT_ALIGN_NUM,					//!< 行揃え数
	AOD_FONT_ALIGN_NONE,				//!< 無効コード
} AOE_FONT_ALIGN;

// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）

// ===========================================================================
//	AoFontBuildStart
/*!
	構築開始

	@param file			[io] フォントファイル
	@param auto_free	[in] 真：構築後フォントファイル自動解放
	@param alloc_temp	[in] フォントバッファのメモリ確保方法
	@param alloc_sub	[in] サブメモリ確保
	@note
	フォントデータを使用するための構築処理を開始します。\n
	構築の完了はAoFontIsBuilded関数で判定して下さい。\n
	構築が完了するまではフォントを使用することができません。\n
	is_auto_freeにTRUEを指定すると、
	構築が完了した段階で自動でフォントファイルを解放します。\n
	is_auto_freeにFALSEを指定した場合は、
	構築の完了を待ってからファイルの解放を行って下さい。\n
	既に構築済みの場合に呼び出すとアサートし何も行いません。
	（その場合is_auto_freeがTRUEであっても
	解放処理が行われないので注意して下さい。）\n
	alloc_tempにTRUEを指定すると、
	フォントバッファの確保にamMemAllocTempを使用します。\n
	alloc_tempにFALSEを指定すると、
	フォントバッファの確保にamMemAllocを使用します。\n
*/
// ===========================================================================
extern void AoFontBuildStart(
	void* file, BOOL is_auto_free, BOOL alloc_temp, BOOL alloc_sub);

// ===========================================================================
//	AoFontIsBuilded
/*!
	構築完了判定

	@return 真：構築完了　偽：構築中
	@note
	AoFontBuildStart関数で開始した構築処理が完了したかどうかを判定します。\n
*/
// ===========================================================================
extern BOOL AoFontIsBuilded(void);

// ===========================================================================
//	AoFontRelease
/*!
	解放

	@note
	内部リソースを全て解放し、
	AoFontBuildStart関数呼び出し以前の状態に戻します。\n
	構築処理中であっても呼び出し可能です。\n
	AoFontBuildStart関数のis_auto_free引数にTRUEを指定して構築を開始した場合、
	構築が完了する前にこの関数を呼び出すと、ファイルの自動解放を行います。\n
	この関数は完了復帰です。\n
*/
// ===========================================================================
extern void AoFontRelease(void);

// ===========================================================================
//	AoFontGetFNTHeader
/*!
	FNTHeader取得

	@return FNTHeader構造体のポインタ
	@note
	モジュール内部で保持しているFNTHeaderのポインタを返します。\n
	ユーザ側でFNTHeaderの解放を行わないように注意して下さい。\n
*/
// ===========================================================================
extern FNTHeader* AoFontGetFNTHeader(void);

// ===========================================================================
//	AoFontDrawString
/*!
	フォント(文字列)描画

	@param x		[in] 描画X位置
	@param y		[in] 描画Y位置
	@param align	[in] 行揃えタイプ
	@param color	[in] 文字色(RGBA)
	@param scale	[in] 拡大率
	@param corw		[in] ワイド補正タイプ(AOE_ACT_CORW)
	@param str		[in] 描画文字列
	@param cdiff	[in] 次文字位置のオフセット
	@param ldiff	[in] 次行位置のオフセット
	@note
	指定パラメータで指定文字列を描画します。\n
	描画位置は、行揃えの方法により変わります。\n
	それぞれの行揃えタイプの基点位置（左揃えなら左端）が
	引数で指定する描画位置になります。\n
	次文字へのオフセットは、文字のグリフ幅にcdiffを加算した値となります。\n
	改行文字が含まれる場合は、自動で改行し、
	文字の高さ分だけY位置をずらした位置にldiffを加算した位置を
	次行のY位置として描画します。\n
	文字列データは描画タスクが生存している間は保持するようにしてください。\n
	この関数は描画タスクから呼び出すようにして下さい。\n
*/
// ===========================================================================
extern void AoFontDrawString(
	f32 x, f32 y, AOE_FONT_ALIGN align, u32 color, f32 scale,
	f32 cdiff, f32 ldiff,
	u32 corw, const char* str);

// ===========================================================================
//	AoFontDrawStringTask
/*!
	フォント(文字列)描画を行う描画タスク作成

	@param prio		[in] 描画タスク優先度
	@param x		[in] 描画X位置
	@param y		[in] 描画Y位置
	@param align	[in] 行揃えタイプ
	@param color	[in] 文字色(RGBA)
	@param scale	[in] 拡大率
	@param cdiff	[in] 次文字位置のオフセット
	@param ldiff	[in] 次行位置のオフセット
	@param corw		[in] ワイド補正タイプ(AOE_ACT_CORW)
	@param str		[in] 描画文字列
	@note
	AoFontDrawString関数を呼び出す描画タスクを内部で作成します。\n
	引数の意味はAoFontDrawString関数と同じとなります。\n
*/
// ===========================================================================
extern void AoFontDrawStringTask(
	u16 prio,
	f32 x, f32 y, AOE_FONT_ALIGN align, u32 color, f32 scale,
	f32 cdiff, f32 ldiff,
	u32 corw, const char* str);

// ===========================================================================
//	AoFontUtilGetStringInfo
/*!
	文字列情報取得

	@param str		[in]  文字列
	@param scale	[in]  拡大率
	@param cdiff	[in]  次文字位置のオフセット
	@param ldiff	[in]  次行位置のオフセット
	@param str_w	[out] 文字列横サイズ(NULL可)
	@param str_h	[out] 文字列縦サイズ(NULL可)
	@param char_num	[out] 文字数(NULL可)
	@param line_num	[out] 行数(NULL可)
*/
// ===========================================================================
extern void AoFontUtilGetStringInfo(
	const char* str, f32 scale, f32 cdiff, f32 ldiff,
	f32* str_w, f32* str_h, u32* char_num, u32* line_num);

// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

#endif // defined(AOD_PLATFORM_WII)

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
