// ===========================================================================
/*!
	@file	aoMemory.h
	@brief	AoLibrary メモリ関連モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）

namespace ao {

// ===========================================================================
//	class CAllocAmNormal
// ---------------------------------------------------------------------------
//!	amMemFreeによりdeleteを行なう基底クラス
// ===========================================================================
class CAllocAmBase
{
public:

	//! deleteオーバーロード
	void operator delete (void* buf);

	//! delete[]オーバーロード
	void operator delete[] (void* buf);
};

// ===========================================================================
//	class CAllocAmNormal
// ---------------------------------------------------------------------------
//!	amMemAllocによりnewを行なう基底クラス
// ===========================================================================
class CAllocAmNormal : public CAllocAmBase
{
public:

	//! newオーバーロード
	void* operator new (size_t size);

	//! new[]オーバーロード
	void* operator new[] (size_t size);
};

// ===========================================================================
//	class CAllocAmTemp
// ---------------------------------------------------------------------------
//!	amMemAllocTempによりnewを行なう基底クラス
// ===========================================================================
class CAllocAmTemp : public CAllocAmBase
{
public:

	//! newオーバーロード
	void* operator new (size_t size);

	//! new[]オーバーロード
	void* operator new[] (size_t size);
};

// ===========================================================================
//	class CAllocAmLow
// ---------------------------------------------------------------------------
//!	amMemAllocLowによりnewを行なう基底クラス
// ===========================================================================
class CAllocAmLow : public CAllocAmBase
{
public:

	//! newオーバーロード
	void* operator new (size_t size);

	//! new[]オーバーロード
	void* operator new[] (size_t size);
};

// ===========================================================================
//	class CAllocAmHigh
// ---------------------------------------------------------------------------
//!	amMemAllocHighによりnewを行なう基底クラス
// ===========================================================================
class CAllocAmHigh : public CAllocAmBase
{
public:

	//! newオーバーロード
	void* operator new (size_t size);

	//! new[]オーバーロード
	void* operator new[] (size_t size);
};

// ===========================================================================
//	class CAllocAmSystem
// ---------------------------------------------------------------------------
//!	amMemAllocSystem、amMemFreeSystemによりnew、deleteを行なう基底クラス
// ===========================================================================
class CAllocAmSystem
{
public:

	//! newオーバーロード
	void* operator new (size_t size);

	//! new[]オーバーロード
	void* operator new[] (size_t size);

	//! deleteオーバーロード
	void operator delete (void* buf);

	//! delete[]オーバーロード
	void operator delete[] (void* buf);
};

} // namespace ao

// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
