// ===========================================================================
/*!
	@file	aoMsg.h
	@brief	AoLibrary メッセージモジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	struct AOE_MSG_CODE
// ---------------------------------------------------------------------------
//!	文字コード列挙
// ===========================================================================
typedef enum tag_AOE_MSG_CODE {
	AOD_MSG_CODE_UTF16LE		= 0,	//!< UTF-16 LittleEndian
	AOD_MSG_CODE_UTF16BE,				//!< UTF-16 BigEndian
	AOD_MSG_CODE_UTF8,					//!< UTF-8

	AOD_MSG_CODE_NUM,					//!< 文字コード数
	AOD_MSG_CODE_NONE,					//!< 無効コード
} AOE_MSG_CODE;

#if defined(AOD_PLATFORM_WIN32)
//! Xbox360用16bit文字コード型
typedef LPCWSTR		AOT_MSG_U16_CODE;

#elif defined(AOD_PLATFORM_XBOX360)
//! Xbox360用16bit文字コード型
typedef LPCWSTR		AOT_MSG_U16_CODE;

#elif defined(AOD_PLATFORM_PS3)
//! PS3用16bit文字コード型
typedef const u16*	AOT_MSG_U16_CODE;

#elif defined(AOD_PLATFORM_WII)
//! Wii用16bit文字コード型
typedef const u16*	AOT_MSG_U16_CODE;

#elif defined(AOD_PLATFORM_IPHONE)
//! iPhone用16bit文字コード型
typedef const u16*	AOT_MSG_U16_CODE;

#endif

// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	AoMsgGetCodeType
/*!
	文字コード取得

	@param file		[in] メッセージファイル
	@return 文字コード
	@note
	メッセージファイルに含まれている文字の文字コードを返します。\n
	内部での文字コード変換機能はありませんので、
	使用できないコードが返されるようであれば、
	ファイルの作り方から見直しが必要となります。\n
	不正な引数が指定された場合は、アサートしAOD_MSG_CODE_NONEを返します。\n
*/
// ===========================================================================
extern AOE_MSG_CODE AoMsgGetCodeType(const void* file);

// ===========================================================================
//	AoMsgGetStrNum
/*!
	メッセージ数取得

	@param file		[in] メッセージファイル
	@return メッセージ数
	@note
	メッセージファイルに含まれるメッセージ数を返します。\n
	不正な引数が指定された場合は、アサートし0を返します。\n
*/
// ===========================================================================
extern u32 AoMsgGetMsgNum(const void* file);

// ===========================================================================
//	AoMsgGetStrNum
/*!
	文字列数取得

	@param file		[in] メッセージファイル
	@param msg_no	[in] メッセージ番号
	@return 文字列数
	@note
	指定のメッセージに含まれる文字列数を返します。\n
	不正な引数が指定された場合は、アサートし0を返します。\n
*/
// ===========================================================================
extern u32 AoMsgGetStrNum(const void* file, u32 msg_no);

// ===========================================================================
//	AoMsgGetStr
/*!
	文字列取得

	@param file		[in] メッセージファイル
	@param msg_no	[in] メッセージ番号
	@param str_no	[in] 文字列番号
	@return 文字列(終端文字あり)
	@note
	指定の文字列の先頭ポインタを返します。\n
	このポインタはAoMsgGetCodeType関数の返す文字コードの文字列の
	先頭ポインタとして扱えます。\n
	不正な引数が指定された場合は、アサートしNULLを返します。\n
*/
// ===========================================================================
extern const void* AoMsgGetStr(const void* file, u32 msg_no, u32 str_no);

// ===========================================================================
//	AoMsgGetStr16
/*!
	文字列取得(16bit)

	@param file		[in] メッセージファイル
	@param msg_no	[in] メッセージ番号
	@param str_no	[in] 文字列番号
	@return 文字列(終端文字あり)
	@note
	返す値としては、AoMsgGetStrと全く同じとなり、型が違うのみとなります。\n
*/
// ===========================================================================
extern AOT_MSG_U16_CODE AoMsgGetStr16(const void* file, u32 msg_no, u32 str_no);

// ===========================================================================
//	AoMsgGetStr8
/*!
	文字列取得(8bit)

	@param file		[in] メッセージファイル
	@param msg_no	[in] メッセージ番号
	@param str_no	[in] 文字列番号
	@return 文字列(終端文字あり)
	@note
	返す値としては、AoMsgGetStrと全く同じとなり、型が違うのみとなります。\n
*/
// ===========================================================================
extern const char* AoMsgGetStr8(const void* file, u32 msg_no, u32 str_no);

// ===========================================================================
//	AoMsgIsMsgFile
/*!
	メッセージファイル判定

	@param file				[in] 判定するファイル
	@return 真：メッセージファイル　偽：それ以外
	@note
	引数で指定したファイルがメッセージファイルであるか判定します。\n
	ヘッダ情報のみを判定するので、
	全てのデータが正常であるかの判定は行いません。\n
	AoMsgConvertAddress関数を呼び出した後のメッセージファイルであっても、
	メッセージファイルと判定されます。\n
*/
// ===========================================================================
extern BOOL AoMsgIsMsgFile(const void* file);

// ===========================================================================
//	AoMsgConvertAddress
/*!
	アドレス変換

	@param file				[io] アドレス変換するメッセージファイル
	@return 1:正常に変換 0:既に変換済みorそれ以外
	@note
	引数で指定したメッセージファイルのアドレス変換を行います。\n
	正常に変換が完了した場合は1を返します。\n
	既に変換済みの場合は何も行わずに0を返します。\n
	メッセージファイル以外のファイルを指定した場合は、
	アサートし何も行わず0を返します。\n
*/
// ===========================================================================
extern s32 AoMsgConvertAddress(u8* file);

// ===========================================================================
//	AoMsgRegAliceMsgConv
/*!
	Aliceへメッセージファイルのアドレス変換登録

	@note
	amConvertAddress関数でメッセージファイルのアドレス変換を行えるように、
	Aliceに登録します。\n
*/
// ===========================================================================
extern void AoMsgRegAliceMsgConv(void);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
