// ===========================================================================
/*!
	@file	aoProc.h
	@brief	AoLibrary プロシージャクラス宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

namespace ao {

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）

// ***************************************************************************
// プロシージャクラス
// ***************************************************************************
// ===========================================================================
//	class CProc
// ---------------------------------------------------------------------------
//!	プロシージャクラス
// ===========================================================================
template <class T>
class CProc
{
protected:

	// =======================================================================
	//	TypeProcedure
	// -----------------------------------------------------------------------
	//!	プロシージャ型
	// =======================================================================
	typedef void (T::*TypeProcedure)();

	// =======================================================================
	//	CProc
	/*!
		コンストラクタ
	*/
	// =======================================================================
	CProc();

	// =======================================================================
	//	~CProc
	/*!
		デストラクタ
	*/
	// =======================================================================
	virtual ~CProc();

	// =======================================================================
	//	SetOwnProcNone
	/*!
		自身に無効プロシージャ設定
	*/
	// =======================================================================
	void SetOwnProcNone();

	// =======================================================================
	//	SetProcNone
	/*!
		無効プロシージャ設定

		@param no	[in] プロシージャ番号(必ず0)
	*/
	// =======================================================================
	void SetProcNone(u32 no);

	// =======================================================================
	//	SetOwnProc
	/*!
		自身にプロシージャ設定

		@param proc	[in] プロシージャ
	*/
	// =======================================================================
	void SetOwnProc(TypeProcedure proc = NULL);

	// =======================================================================
	//	SetProc
	/*!
		プロシージャ設定

		@param no	[in] プロシージャ番号(必ず0)
		@param proc	[in] プロシージャ
	*/
	// =======================================================================
	void SetProc(u32 no, TypeProcedure proc = NULL);

	// =======================================================================
	//	GetOwnProc
	/*!
		自身のプロシージャ取得
		@return 自身のプロシージャ
	*/
	// =======================================================================
	TypeProcedure GetOwnProc() const;

	// =======================================================================
	//	GetProc
	/*!
		プロシージャ取得

		@param no	[in] プロシージャ番号(必ず0)
		@return プロシージャ
	*/
	// =======================================================================
	TypeProcedure GetProc(u32 no) const;

	// =======================================================================
	//	IsOwnProcNone
	/*!
		自身の無効プロシージャ判定

		@return 真：無効プロシージャ　偽：有効プロシージャ
	*/
	// =======================================================================
	BOOL IsOwnProcNone() const;

	// =======================================================================
	//	IsProcNone
	/*!
		無効プロシージャ判定

		@param no	[in] プロシージャ番号(必ず0)
		@return 真：無効プロシージャ　偽：有効プロシージャ
	*/
	// =======================================================================
	BOOL IsProcNone(u32 no) const;

	// =======================================================================
	//	IsOwnProc
	/*!
		自身のプロシージャ判定

		@param proc	[in] 判定プロシージャ
		@return 真：等しい　偽：それ以外
	*/
	// =======================================================================
	BOOL IsOwnProc(TypeProcedure proc) const;

	// =======================================================================
	//	IsProc
	/*!
		プロシージャ判定

		@param no	[in] プロシージャ番号(必ず0)
		@param proc	[in] 判定プロシージャ
		@return 真：等しい　偽：それ以外
	*/
	// =======================================================================
	BOOL IsProc(u32 no, TypeProcedure proc) const;

	// =======================================================================
	//	GetCount
	/*!
		プロシージャカウント取得

		@return プロシージャカウント
		@note
		プロシージャ切り替え後、最初の呼び出しでは0が返ります。\n
		以後、呼出し毎に1ずつ増え、0xffffffffに達した後は変化しなくなります。\n
		この関数はプロシージャ内からのみ呼び出すようにしてください。\n
	*/
	// =======================================================================
	u32 GetCount() const;

	// =======================================================================
	//	ResetCount
	/*!
		プロシージャカウントリセット

		@note
		GetCount関数で取得できるカウントをリセットします。\n
		実際にGetCount関数で取得できる値が変化するのは
		次回プロシージャ呼び出し時でそれまでは変化しません。\n
		次回呼び出し時にGetCount関数は0を返します。\n
		この関数はプロシージャ内からのみ呼び出すようにしてください。\n
	*/
	// =======================================================================
	void ResetCount();

public:

	// =======================================================================
	//	operator()
	/*!
		プロシージャ呼び出し

		@note
		プロシージャが呼び出され
		プロシージャカウントがインクリメントされます。\n
		プロシージャが未設定の場合は何も行いません。\n
	*/
	// =======================================================================
	void operator()();

	// =======================================================================
	//	operator()
	/*!
		プロシージャ呼び出し

		@param no	[in] プロシージャ番号(必ず0)
		@note
		プロシージャが呼び出され
		プロシージャカウントがインクリメントされます。\n
		プロシージャが未設定の場合は何も行いません。\n
	*/
	// =======================================================================
	void operator()(u32 no);

	// =======================================================================
	//	Call
	/*!
		プロシージャ呼び出し

		@note
		プロシージャが呼び出され
		プロシージャカウントがインクリメントされます。\n
		プロシージャが未設定の場合は何も行いません。\n
	*/
	// =======================================================================
	void Call();

	// =======================================================================
	//	Call
	/*!
		プロシージャ呼び出し

		@param no	[in] プロシージャ番号(必ず0)
		@note
		プロシージャが呼び出され
		プロシージャカウントがインクリメントされます。\n
		プロシージャが未設定の場合は何も行いません。\n
	*/
	// =======================================================================
	void Call(u32 no);

private:

	// =======================================================================
	//	TypeProcedure m_proc
	// -----------------------------------------------------------------------
	//!	プロシージャ
	// =======================================================================
	TypeProcedure m_proc;

	// =======================================================================
	//	u32 m_counter
	// -----------------------------------------------------------------------
	//!	プロシージャカウンタ
	// =======================================================================
	u32 m_counter;

	// =======================================================================
	//	u32 m_counter_next
	// -----------------------------------------------------------------------
	//!	次プロシージャカウンタ
	// =======================================================================
	u32 m_counter_next;
};


// ***************************************************************************
// マルチプロシージャクラス
// ***************************************************************************
// ===========================================================================
//	class CProcMulti
// ---------------------------------------------------------------------------
//!	マルチプロシージャクラス
// ===========================================================================
template <class T>
class CProcMulti
{
};

// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）

// ***************************************************************************
// プロシージャクラス
// ***************************************************************************
// ===========================================================================
//	CProc
/*!
	コンストラクタ
*/
// ===========================================================================
template <class T>
CProc<T>::CProc()
{
	SetOwnProcNone();
	m_counter = 0;
}

// ===========================================================================
//	~CProc
/*!
	デストラクタ
*/
// ===========================================================================
template <class T>
CProc<T>::~CProc()
{
	// empty
}

// ===========================================================================
//	SetOwnProcNone
/*!
	自身に無効プロシージャ設定
*/
// ===========================================================================
template <class T>
void CProc<T>::SetOwnProcNone()
{
	SetOwnProc(NULL);
}

// ===========================================================================
//	SetProcNone
/*!
	無効プロシージャ設定

	@param no	[in] プロシージャ番号(必ず0)
*/
// ===========================================================================
template <class T>
void CProc<T>::SetProcNone(u32 no)
{
	SetProc(no, NULL);
}

// ===========================================================================
//	SetOwnProc
/*!
	自身にプロシージャ設定

	@param proc	[in] プロシージャ
*/
// ===========================================================================
template <class T>
void CProc<T>::SetOwnProc(TypeProcedure proc)
{
	m_proc = proc;
	m_counter_next = 0;
}

// ===========================================================================
//	SetProc
/*!
	プロシージャ設定

	@param no	[in] プロシージャ番号(必ず0)
	@param proc	[in] プロシージャ
*/
// ===========================================================================
template <class T>
void CProc<T>::SetProc(u32 no, TypeProcedure proc)
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	SetOwnProc(proc);
}

// ===========================================================================
//	GetOwnProc
/*!
	自身のプロシージャ取得

	@return 自身のプロシージャ
*/
// ===========================================================================
template <class T>
typename CProc<T>::TypeProcedure CProc<T>::GetOwnProc() const
{
	return m_proc;
}

// ===========================================================================
//	GetProc
/*!
	プロシージャ取得

	@param no	[in] プロシージャ番号(必ず0)
	@return プロシージャ
*/
// ===========================================================================
template <class T>
typename CProc<T>::TypeProcedure CProc<T>::GetProc(u32 no) const
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	return GetOwnProc();
}

// ===========================================================================
//	IsOwnProcNone
/*!
	自身の無効プロシージャ判定

	@return 真：無効プロシージャ　偽：有効プロシージャ
*/
// ===========================================================================
template <class T>
BOOL CProc<T>::IsOwnProcNone() const
{
	if (m_proc == NULL) {
		return TRUE;
	}
	return FALSE;
}

// ===========================================================================
//	IsProcNone
/*!
	無効プロシージャ判定

	@param no	[in] プロシージャ番号(必ず0)
	@return 真：無効プロシージャ　偽：有効プロシージャ
*/
// ===========================================================================
template <class T>
BOOL CProc<T>::IsProcNone(u32 no) const
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	return IsOwnProcNone();
}

// ===========================================================================
//	IsOwnProc
/*!
	自身のプロシージャ判定

	@param proc	[in] 判定プロシージャ
	@return 真：等しい　偽：それ以外
*/
// ===========================================================================
template <class T>
BOOL CProc<T>::IsOwnProc(TypeProcedure proc) const
{
	if (proc == m_proc) {
		return TRUE;
	}
	return FALSE;
}

// ===========================================================================
//	IsProc
/*!
	プロシージャ判定

	@param no	[in] プロシージャ番号(必ず0)
	@param proc	[in] 判定プロシージャ
	@return 真：等しい　偽：それ以外
*/
// ===========================================================================
template <class T>
BOOL CProc<T>::IsProc(u32 no, TypeProcedure proc) const
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	return IsOwnProc(proc);
}

// ===========================================================================
//	GetCount
/*!
	プロシージャカウント取得

	@return プロシージャカウント
	@note
	プロシージャ切り替え後、最初の呼び出しでは0が返ります。\n
	以後、呼出し毎に1ずつ増え、0xffffffffに達した後は変化しなくなります。\n
	この関数はプロシージャ内からのみ呼び出すようにしてください。\n
*/
// ===========================================================================
template <class T>
u32 CProc<T>::GetCount() const
{
	return m_counter;
}

// ===========================================================================
//	ResetCount
/*!
	プロシージャカウントリセット

	@note
	GetCount関数で取得できるカウントをリセットします。\n
	実際にGetCount関数で取得できる値が変化するのは
	次回プロシージャ呼び出し時でそれまでは変化しません。\n
	次回呼び出し時にGetCount関数は0を返します。\n
	この関数はプロシージャ内からのみ呼び出すようにしてください。\n
*/
// ===========================================================================
template <class T>
void CProc<T>::ResetCount()
{
	m_counter_next = 0;
}

// ===========================================================================
//	operator()
/*!
	プロシージャ呼び出し

	@note
	プロシージャが呼び出され
	プロシージャカウントがインクリメントされます。\n
	プロシージャが未設定の場合は何も行いません。\n
*/
// ===========================================================================
template <class T>
void CProc<T>::operator()()
{
	m_counter = m_counter_next;
	if (m_counter_next < (u32)-1) {
		m_counter_next += 1;
	}
	if (m_proc) {
		(((T*)this)->*m_proc)();
	}
}

// ===========================================================================
//	operator()
/*!
	プロシージャ呼び出し

	@param no	[in] プロシージャ番号(必ず0)
	@note
	プロシージャが呼び出され
	プロシージャカウントがインクリメントされます。\n
	プロシージャが未設定の場合は何も行いません。\n
*/
// ===========================================================================
template <class T>
void CProc<T>::operator()(u32 no)
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	this->operator()();
}

// ===========================================================================
//	Call
/*!
	プロシージャ呼び出し

	@note
	プロシージャが呼び出され
	プロシージャカウントがインクリメントされます。\n
	プロシージャが未設定の場合は何も行いません。\n
*/
// ===========================================================================
template <class T>
void CProc<T>::Call()
{
	this->operator()();
}

// ===========================================================================
//	Call
/*!
	プロシージャ呼び出し

	@param no	[in] プロシージャ番号(必ず0)
	@note
	プロシージャが呼び出され
	プロシージャカウントがインクリメントされます。\n
	プロシージャが未設定の場合は何も行いません。\n
*/
// ===========================================================================
template <class T>
void CProc<T>::Call(u32 no)
{
	this->operator()(no);
}

// ----- Static Functions --------------------（スタティック関数の定義：局所）

} // namespace ao

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
