// ===========================================================================
/*!
	@file	aoStorage.h
	@brief	AoLibrary セーブ＆ロード管理モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	enum AOE_STORAGE_ERROR
// ---------------------------------------------------------------------------
//!	エラー列挙
// ===========================================================================
typedef enum tag_AOE_STORAGE_ERROR {
	AOD_STORAGE_ERROR_NONE			= 0,	//!< エラーなし
	AOD_STORAGE_ERROR_LOADDATA_NONE,		//!< ロードデータなし
	AOD_STORAGE_ERROR_NO_SAVE,				//!< セーブせずに進行
	AOD_STORAGE_ERROR_CANCEL,				//!< ユーザ操作によるキャンセル
	AOD_STORAGE_ERROR_APP_CANCEL,			//!< アプリケーションによる中断
	AOD_STORAGE_ERROR_OPERATION,			//!< 操作エラー

	AOD_STORAGE_ERROR_NUM,					//!< エラー数
} AOE_STORAGE_ERROR;

// ----- Struct Definitions --------------------------------------（型の宣言）

#if defined(AOD_PLATFORM_PS3)
// ===========================================================================
//	AOF_STORAGE_FADE_CALLBACK
/*!
	フェード要求コールバック関数型

	@param fadein	[in] 真：フェードイン　偽：フェードアウト
	@param arg		[in] コールバック引数
*/
// ===========================================================================
typedef void (*AOF_STORAGE_FADE_CALLBACK)(BOOL fadein, void* arg);

// ===========================================================================
//	AOF_STORAGE_FADE_IS_END_CALLBACK
/*!
	フェード完了判定コールバック関数型

	@param fadein	[in] 真：フェードイン　偽：フェードアウト
	@param arg		[in] コールバック引数
	@return 真：完了　偽：それ以外
*/
// ===========================================================================
typedef BOOL (*AOF_STORAGE_FADE_IS_END_CALLBACK)(BOOL fadein, void* arg);
#endif // defined(AOD_PLATFORM_PS3)

// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ***************************************************************************
// 初期化&終了処理
// ***************************************************************************
// ===========================================================================
//	AoStorageInit
/*!
	セーブ＆ロード管理モジュール初期化処理

	@note
	アプリケーション起動時に1度だけ呼び出して下さい。\n
	あらかじめ、AoAccountInit関数が呼ばれている必要があります。\n
*/
// ===========================================================================
extern void AoStorageInit(void);

// ===========================================================================
//	AoStorageExit
/*!
	セーブ＆ロード管理モジュール終了処理

	@note
	アプリケーション終了時に1度だけ呼び出して下さい。\n
	AoStorageInit関数が呼び出されていない状態では、
	この関数を呼び出さないようにして下さい。\n
	この関数を呼出し後、再度AoStorageInit関数を呼び出すことはできません。\n
*/
// ===========================================================================
extern void AoStorageExit(void);

#if defined(AOD_PLATFORM_XBOX360)

// ===========================================================================
//	AoStorageSetDataXbox360
/*!
	Xbox360用のセーブに必要なデータ設定

	@param thumb_png		[in] サムネイルPNG
	@param thumb_png_size	[in] サムネイルPNGサイズ
*/
// ===========================================================================
extern void AoStorageSetDataXbox360(void* thumb_png, u32 thumb_png_size);

#endif // defined(AOD_PLATFORM_XBOX360)

#if defined(AOD_PLATFORM_PS3)

// ===========================================================================
//	AoStorageSetTitleIdPS3
/*!
	PS3タイトルID設定

	@param titleid		[in] ICON0.PNGタイトルID
*/
// ===========================================================================
extern void AoStorageSetTitleIdPS3(const char* titleid);

// ===========================================================================
//	AoStorageSetDataPS3
/*!
	PS3用のセーブに必要なデータ設定

	@param icon0		[in] ICON0.PNG
	@param icon0_size	[in] ICON0.PNGのサイズ
	@param pic1			[in] PIC1.PNG
	@param pic1_size	[in] PIC1.PNGのサイズ
*/
// ===========================================================================
extern void AoStorageSetDataPS3(
	void* icon0, u32 icon0_size, void* pic1, u32 pic1_size);

// ===========================================================================
//	AoStorageSetFadeCallbackPS3
/*!
	フェード要求コールバック設定

	@param cb			[in] コールバック関数
	@param arg			[in] コールバック関数呼び出し時の引数
*/
// ===========================================================================
extern void AoStorageSetFadeCallbackPS3(
	AOF_STORAGE_FADE_CALLBACK cb, void* arg);

// ===========================================================================
//	AoStorageSetFadeIsEndCallbackPS3
/*!
	フェード完了判定コールバック設定

	@param cb			[in] コールバック関数
	@param arg			[in] コールバック関数呼び出し時の引数
*/
// ===========================================================================
extern void AoStorageSetFadeIsEndCallbackPS3(
	AOF_STORAGE_FADE_IS_END_CALLBACK cb, void* arg);

#endif // defined(AOD_PLATFORM_PS3)

#if defined(AOD_PLATFORM_WII)

// ===========================================================================
//	AoStorageSetDataWii
/*!
	Wii用のセーブに必要なデータ設定

	@param tpl		[in] バナーとアイコンのTPLファイル
	@param tpl_size	[in] バナーとアイコンのTPLファイルのサイズ
*/
// ===========================================================================
extern void AoStorageSetDataWii(void* tpl, u32 tpl_size);

#endif // defined(AOD_PLATFORM_WII)

// ===========================================================================
//	AoStorageSetSaveMsgFile
/*!
	セーブデータメッセージファイル設定

	@param file		[in] セーブデータメッセージファイル
	@note
	セーブデータに格納する各種メッセージを格納した
	メッセージファイルを設定します。\n
	このモジュールを使用するためには、
	この関数で適切なメッセージファイルが設定されている必要があります。\n
	アプリケーション開始時に設定し、以降解放はしない使い方を想定しています。\n
*/
// ===========================================================================
extern void AoStorageSetSaveMsgFile(const void* file);

// ===========================================================================
//	AoStorageGetSaveMsgFile
/*!
	セーブデータメッセージファイル取得

	@return セーブデータメッセージファイル
*/
// ===========================================================================
extern const void* AoStorageGetSaveMsgFile(void);


// ***************************************************************************
// エラー
// ***************************************************************************
// ===========================================================================
//	AoStorageIsError
/*!
	エラー判定

	@return 真：エラーあり　偽：エラーなし
	@note
	このモジュール内でエラーが発生したかどうかを判定します。\n
	AoStorageClearError関数を呼び出すと、エラーなしの状態となり、
	その後エラーが発生するとTRUEを返すようになります。\n
*/
// ===========================================================================
extern BOOL AoStorageIsError(void);

// ===========================================================================
//	AoStorageGetError
/*!
	エラー取得

	@return 真：エラー
	@note
	最後に発生したエラー情報を返します。\n
	AoStorageIsError関数がFALSEを返す状態で呼び出すと
	AOD_STORAGE_ERROR_NONEを返します。\n
*/
// ===========================================================================
extern AOE_STORAGE_ERROR AoStorageGetError(void);

// ===========================================================================
//	AoStorageClearError
/*!
	エラークリア
*/
// ===========================================================================
extern void AoStorageClearError(void);


// ***************************************************************************
// セーブ
// ***************************************************************************
// ===========================================================================
//	AoStorageSaveStart
/*!
	セーブ開始

	@param data		[in] データバッファ
	@param size		[in] データバッファサイズ
	@param is_first	[in] 真：初回セーブ　偽：上書きセーブ
	@param is_new	[in] 真：ロードなしの初回セーブ　偽：通常セーブ
	@note
	セーブ処理を開始します。\n
	他の処理と同時に行うことはできません。\n
	AoStorageSaveIsFinished関数がFALSEを返す状態で呼び出すことはできません。\n
	即時には終了しないので、
	AoStorageSaveIsFinished関数で完了を判定するようにして下さい。\n
	引数のバッファはセーブが完了するまで破棄しないようにして下さい。\n
*/
// ===========================================================================
extern void AoStorageSaveStart(
	void* data, u32 size, BOOL is_first = FALSE, BOOL is_new = FALSE);

// ===========================================================================
//	AoStorageSaveFreeSpaceIsEnough
/*!
	セーブ空き容量チェック済み判定

	@return 真：チェック済み　偽：それ以外
	@note
	AoStorageSaveStart関数で開始したセーブ処理において、
	適切な空き容量チェックを行い、空き容量が十分であることが確認されると
	TRUEを返すようになります。\n
	セーブ中以外に呼び出した場合は常にTRUEを返します。\n
*/
// ===========================================================================
extern BOOL AoStorageSaveFreeSpaceIsEnough(void);

// ===========================================================================
//	AoStorageSaveIsFinished
/*!
	セーブ完了判定

	@return 真：完了済み　偽：セーブ中
	@note
	AoStorageSaveStart関数で開始したセーブ処理の完了を判定します。\n
	AoStorageSaveStart関数を呼び出していない状態ではTRUEを返します。\n
*/
// ===========================================================================
extern BOOL AoStorageSaveIsFinished(void);

// ===========================================================================
//	AoStorageSaveIsSuccessed
/*!
	セーブ成功判定

	@return 真：成功　偽：失敗
	@note
	直前に行ったセーブ処理が成功したかを判定します。\n
	AoStorageSaveStart関数を呼び出していない状態ではFALSEを返します。\n
	AoStorageSaveIsFinished関数がFALSEを返す状態では
	呼び出すことができません。\n
	この関数がFALSEを返す場合は、
	セーブ中になんらかのエラーが発生したことになるので、
	AoStorageGetError関数でエラーの詳細を取得して下さい。\n
*/
// ===========================================================================
extern BOOL AoStorageSaveIsSuccessed(void);


// ***************************************************************************
// ロード
// ***************************************************************************
// ===========================================================================
//	AoStorageLoadStart
/*!
	ロード開始

	@param data		[out] データバッファ
	@param size		[in]  データバッファサイズ
	@note
	ロード処理を開始します。\n
	他の処理と同時に行うことはできません。\n
	AoStorageLoadIsFinished関数がFALSEを返す状態で呼び出すことはできません。\n
	即時には終了しないので、
	AoStorageLoadIsFinished関数で完了を判定するようにして下さい。\n
	引数のバッファはロードが完了するまで破棄しないようにして下さい。\n
*/
// ===========================================================================
extern void AoStorageLoadStart(void* data, u32 size);

// ===========================================================================
//	AoStorageLoadIsFinished
/*!
	ロード完了判定

	@return 真：完了済み　偽：ロード中
	@note
	AoStorageLoadStart関数で開始したロード処理の完了を判定します。\n
	AoStorageLoadStart関数を呼び出していない状態ではTRUEを返します。\n
*/
// ===========================================================================
extern BOOL AoStorageLoadIsFinished(void);

// ===========================================================================
//	AoStorageLoadIsSuccessed
/*!
	ロード成功判定

	@return 真：成功　偽：失敗
	@note
	直前に行ったロード処理が成功したかを判定します。\n
	AoStorageLoadStart関数を呼び出していない状態ではFALSEを返します。\n
	AoStorageLoadIsFinished関数がFALSEを返す状態では
	呼び出すことができません。\n
	この関数がFALSEを返す場合は、
	ロード中になんらかのエラーが発生したことになるので、
	AoStorageGetError関数でエラーの詳細を取得して下さい。\n
*/
// ===========================================================================
extern BOOL AoStorageLoadIsSuccessed(void);

// ===========================================================================
//	AoStorageLoadIsCreaterOwn
/*!
	読み込んだセーブデータの作者が自分自身か判定

	@return 真：自分自身　偽：それ以外
*/
// ===========================================================================
extern BOOL AoStorageLoadIsCreaterOwn(void);


#if defined(AOD_PLATFORM_WII) || defined(AOD_PLATFORM_IPHONE)

// ***************************************************************************
// 削除
// ***************************************************************************
// ===========================================================================
//	AoStorageDeleteStart
/*!
	削除開始

	@note
	削除処理を開始します。\n
	他の処理と同時に行うことはできません。\n
	AoStorageDeleteIsFinished関数がFALSEを返す状態で
	呼び出すことはできません。\n
	即時には終了しないので、
	AoStorageDeleteIsFinished関数で完了を判定するようにして下さい。\n
*/
// ===========================================================================
extern void AoStorageDeleteStart(void);

// ===========================================================================
//	AoStorageDeleteIsFinished
/*!
	削除完了判定

	@return 真：完了済み　偽：削除中
	@note
	AoStorageDeleteStart関数で開始したセーブ処理の完了を判定します。\n
	AoStorageDeleteStart関数を呼び出していない状態ではTRUEを返します。\n
*/
// ===========================================================================
extern BOOL AoStorageDeleteIsFinished(void);

// ===========================================================================
//	AoStorageDeleteIsSuccessed
/*!
	削除成功判定

	@return 真：成功　偽：失敗
	@note
	直前に行った削除処理が成功したかを判定します。\n
	AoStorageDeleteStart関数を呼び出していない状態ではFALSEを返します。\n
	AoStorageDeleteIsFinished関数がFALSEを返す状態では
	呼び出すことができません。\n
	この関数がFALSEを返す場合は、
	削除中になんらかのエラーが発生したことになるので、
	AoStorageGetError関数でエラーの詳細を取得して下さい。\n
*/
// ===========================================================================
extern BOOL AoStorageDeleteIsSuccessed(void);

#endif // defined(AOD_PLATFORM_WII) || defined(AOD_PLATFORM_IPHONE)


// ***************************************************************************
// Xbox360専用
// ***************************************************************************
// ===========================================================================
//	AoStorageIsExecuteReal
/*!
	セーブ&ロード処理が実際に行われているか判定

	@return 真：実際に行われている　偽：それ以外
*/
// ===========================================================================
extern BOOL AoStorageIsExecuteReal(void);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
