// ===========================================================================
/*!
	@file	aoSystem.h
	@brief	AoLibrary システムモジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）

#if defined(AOD_PLATFORM_PS3)
// ===========================================================================
//! PS3システムコールバック通知関数型
// ===========================================================================
typedef void (*AOF_PS3_SYSCALLBACK_NOTICE)(uint64_t, uint64_t, void*);
#endif // defined(AOD_PLATFORM_PS3)

#if defined(AOD_PLATFORM_XBOX360)
// ===========================================================================
//! Xbox360システム通知コールバック通知関数型
// ===========================================================================
typedef void (*AOF_XBOX360_SYSCALLBACK_NOTICE)(DWORD, ULONG_PTR, void*);
#endif // defined(AOD_PLATFORM_XBOX360)

// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

#if defined(AOD_PLATFORM_PS3)
// ===========================================================================
//	AoSysPS3SetSystemCallbackSlot
/*!
	共通イベントコールバックのスロット番号設定

	@param slot	[in] スロット番号(0～3)
	@note
	内部でcellSysutilRegisterCallback関数により設定する
	共通イベントコールバックのスロット番号を指定してください。\n
	この関数はAoSysInit関数を呼び出す前に呼び出し、
	AoSysExit関数呼び出しまでの間は呼び出さないでください。\n
*/
// ===========================================================================
extern void AoSysPS3SetSystemCallbackSlot(int slot);

// ===========================================================================
//	AoSysPS3AddSystemCallbackNotice
/*!
	共通イベントコールバックの通知関数登録追加

	@param cb	[in] 通知関数
	@param arg	[in] 通知関数引数
	@return ID
	@note
	システムコールバックが呼び出された場合に、
	呼び出される通知関数を登録します。\n
	不必要になった場合はAoSysPS3DelSystemCallbackNotice関数で
	通知関数の登録を削除してください。\n
*/
// ===========================================================================
extern u32 AoSysPS3AddSystemCallbackNotice(
	AOF_PS3_SYSCALLBACK_NOTICE cb, void* arg);

// ===========================================================================
//	AoSysPS3DelSystemCallbackNotice
/*!
	共通イベントコールバックの通知関数登録削除

	@param id	[in] ID
*/
// ===========================================================================
extern void AoSysPS3DelSystemCallbackNotice(u32 id);
#endif // defined(AOD_PLATFORM_PS3)

#if defined(AOD_PLATFORM_XBOX360)
// ===========================================================================
//	AoSysPS3AddSystemCallbackNotice
/*!
	XNotifyGetNext関数によるシステム通知発生時コールバック関数登録

	@param cb	[in] 通知関数
	@param arg	[in] 通知関数引数
*/
// ===========================================================================
extern void AoSysSetSystemNoticeCallbackXbox360(
	AOF_XBOX360_SYSCALLBACK_NOTICE cb, void* arg);
#endif // defined(AOD_PLATFORM_XBOX360)

// ===========================================================================
//	AoSysInit
/*!
	システム初期化処理

	@note
	アプリケーション起動時に1度だけ呼び出して下さい。\n
	AoLibraryの各モジュールを使用するためには、
	この関数が呼び出されている必要があります。\n
*/
// ===========================================================================
extern void AoSysInit(void);

// ===========================================================================
//	AoSysExit
/*!
	システム終了処理

	@note
	アプリケーション終了時に1度だけ呼び出して下さい。\n
	AoSysInit関数が呼び出されていない状態では、
	この関数を呼び出さないようにして下さい。\n
	この関数を呼出し後、再度AoSysInit関数を呼び出すことはできません。\n
*/
// ===========================================================================
extern void AoSysExit(void);

// ===========================================================================
//	AoSysIsShowPlatformUI
/*!
	プラットフォーム固有UI表示の有無を判定

	@return 真：表示中　偽：非表示
	@note
	画面全体を覆う形でのプラットフォーム固有UIが
	表示されているかどうかを判定します。\n
	この関数がTRUEを返す状態では、
	ユーザがゲーム画面を認識することができないため、
	ポーズをかける、操作を無効にするなどの対処を行って下さい。\n
*/
// ===========================================================================
extern BOOL AoSysIsShowPlatformUI(void);

// ===========================================================================
//	AoSysIsChangeSigninState
/*!
	ユーザのサインイン状態の変更判定

	@return 真：変更された　偽：変更無し
	@note
	直前にAoSysClearSigninState関数が呼ばれてから、
	ユーザのサインイン状態が変更されたかどうかを判定します。\n
	サインイン状態の詳細については、
	個別の状態取得関数を呼び出すようにして下さい。\n
	一度TRUEを返すようになると、
	AoSysClearSigninState関数を呼び出すまでTRUEを返し続けます。\n
*/
// ===========================================================================
extern BOOL AoSysIsChangeSigninState(void);

// ===========================================================================
//	AoSysIsChangeSigninState
/*!
	ユーザのサインイン状態の変更クリア

	@note
	AoSysIsChangeSigninStateで判定するサインイン状態の変更状態をクリアし、
	変更なしの状態にします。\n
	以降、サインイン状態に変更があるまで
	AoSysIsChangeSigninState関数はFALSEを返し続けます。\n
*/
// ===========================================================================
extern void AoSysClearSigninState(void);

// ===========================================================================
//	AoSysClearStorageDeviceState
/*!
	システムBGM再生中判定

	@return 真：再生中　偽：停止中
*/
// ===========================================================================
extern BOOL AoSysIsPlaySystemBgm(void);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
