// ===========================================================================
/*!
	@file	aoTask.h
	@brief	AoLibrary タスククラス宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

namespace ao {

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）

// ***************************************************************************
// タスククラス
// ***************************************************************************
// ===========================================================================
//	class CTask
// ---------------------------------------------------------------------------
//!	タスククラス
// ===========================================================================
template <class T>
class CTask
{
protected:

	// =======================================================================
	//	TypeTaskProcedure
	// -----------------------------------------------------------------------
	//!	タスクプロシージャ型
	// =======================================================================
	typedef void (T::*TypeTaskProcedure)();

	// =======================================================================
	//	TypeTaskWork
	// -----------------------------------------------------------------------
	//!	タスクワーク型
	// =======================================================================
	struct TypeTaskWork {
		CTask<T>*	task;		//!< タスククラスポインタ
	};

	// =======================================================================
	//	CTask
	/*!
		コンストラクタ
	*/
	// =======================================================================
	CTask();

	// =======================================================================
	//	~CTask
	/*!
		デストラクタ

		@note
		デストラクタ内でタスクが有効な場合はタスクの削除を行います。\n
	*/
	// =======================================================================
	virtual ~CTask();

	// =======================================================================
	//	MakeTask
	/*!
		タスク作成

		@param no		[in] タスク番号(必ず0)
		@param name		[in] タスク名
		@param prio		[in] 優先順位(0x0000 ～ 0xFFFF)
		@param user		[in] ユーザーID(0:所有者設定なし(グループ削除対象外))
		@param attr		[in] 属性
		@note
		既にタスクが作成済みの場合は、削除した後に新規で作成します。\n
		この関数呼び出し直後は、タスクは実行保留状態なので、
		実行させるためにStartTask関数を呼び出すようにして下さい。\n
	*/
	// =======================================================================
	void MakeTask(
		u32 no, char* name, u32 prio = 0, u32 user = 0, u32 attr = 0);

	// =======================================================================
	//	StartTask
	/*!
		タスク実行許可

		@param no		[in] タスク番号(必ず0)
		@note
		amTaskStart関数と同じ挙動です。\n
	*/
	// =======================================================================
	void StartTask(u32 no);

	// =======================================================================
	//	IsTaskEnable
	/*!
		タスク有効判定

		@param no		[in] タスク番号(必ず0)
		@return 真：有効　偽：無効
		@note
		タスクが作成されているなら有効、削除されているなら無効と判定します。\n
	*/
	// =======================================================================
	BOOL IsTaskEnable(u32 no) const;

	// =======================================================================
	//	DeleteOwnTask
	/*!
		自身のタスク削除

		@note
		既に削除済みの場合は何も処理しません。\n
	*/
	// =======================================================================
	void DeleteOwnTask();

	// =======================================================================
	//	DeleteTask
	/*!
		タスク削除

		@param no		[in] タスク番号(必ず0)
		@note
		既に削除済みの場合は何も処理しません。\n
	*/
	// =======================================================================
	void DeleteTask(u32 no);

	// =======================================================================
	//	SetOwnTaskProcNone
	/*!
		自身に無効タスクプロシージャ設定
	*/
	// =======================================================================
	void SetOwnTaskProcNone();

	// =======================================================================
	//	SetTaskProcNone
	/*!
		無効タスクプロシージャ設定

		@param no		[in] タスク番号(必ず0)
	*/
	// =======================================================================
	void SetTaskProcNone(u32 no);

	// =======================================================================
	//	SetOwnTaskProc
	/*!
		自身のタスクプロシージャ設定

		@param proc		[in] タスクプロシージャ
	*/
	// =======================================================================
	void SetOwnTaskProc(TypeTaskProcedure proc = NULL);

	// =======================================================================
	//	SetTaskProc
	/*!
		タスクプロシージャ設定

		@param no		[in] タスク番号(必ず0)
		@param proc		[in] タスクプロシージャ
	*/
	// =======================================================================
	void SetTaskProc(u32 no, TypeTaskProcedure proc = NULL);

	// =======================================================================
	//	GetOwnTaskProc
	/*!
		自身のタスクプロシージャ取得

		@return 自身のタスクプロシージャ
	*/
	// =======================================================================
	TypeTaskProcedure GetOwnTaskProc() const;

	// =======================================================================
	//	GetTaskProc
	/*!
		タスクプロシージャ取得

		@param no		[in] タスク番号(必ず0)
		@return タスクプロシージャ
	*/
	// =======================================================================
	TypeTaskProcedure GetTaskProc(u32 no) const;

	// =======================================================================
	//	IsOwnTaskProcNone
	/*!
		自身の無効タスクプロシージャ判定

		@return 真：無効タスクプロシージャ　偽：それ以外
	*/
	// =======================================================================
	BOOL IsOwnTaskProcNone() const;

	// =======================================================================
	//	IsTaskProcNone
	/*!
		無効タスクプロシージャ判定

		@param no		[in] タスク番号(必ず0)
		@return 真：無効タスクプロシージャ　偽：それ以外
	*/
	// =======================================================================
	BOOL IsTaskProcNone(u32 no) const;

	// =======================================================================
	//	IsOwnTaskProc
	/*!
		自身のタスクプロシージャ判定

		@param proc		[in] 判定タスクプロシージャ
		@return 真：等しい　偽：それ以外
	*/
	// =======================================================================
	BOOL IsOwnTaskProc(TypeTaskProcedure proc);

	// =======================================================================
	//	IsTaskProc
	/*!
		タスクプロシージャ判定

		@param no		[in] タスク番号(必ず0)
		@param proc		[in] 判定タスクプロシージャ
		@return 真：等しい　偽：それ以外
	*/
	// =======================================================================
	BOOL IsTaskProc(u32 no, TypeTaskProcedure proc);

	// =======================================================================
	//	TaskDestructor
	/*!
		タスクデストラクタ

		@param no		[in] タスク番号(必ず0)
		@note
		amDeleteTask系の関数によりタスクが削除された場合に
		この関数が呼び出されます。\n
		このクラスのデストラクタや
		クラス内部からDeleteTask関数によってタスクが削除された場合は
		この関数は呼び出されません。\n
		\n
		この関数内ではGetTcb関数が使用できないので注意してください。\n
		\n
		この関数のデフォルトの動作としては何も行わないので
		必要な処理がある場合はこの関数をオーバーライドしてください。\n
	*/
	// =======================================================================
	void TaskDestructor(u32 no);

	// =======================================================================
	//	GetOwnTcb
	/*!
		自身のタスクTCBポインタ取得

		@return タスクTCBポインタ
		@note
		タスク未作成の場合はNULLを返します。\n
	*/
	// =======================================================================
	AMS_TCB* GetOwnTcb();

	// =======================================================================
	//	GetTcb
	/*!
		タスクTCBポインタ取得

		@param no		[in] タスク番号(必ず0)
		@return タスクTCBポインタ
		@note
		タスク未作成の場合はNULLを返します。\n
	*/
	// =======================================================================
	AMS_TCB* GetTcb(u32 no);

private:

	// =======================================================================
	//	TcbProcedure
	/*!
		タスクプロシージャ関数
	*/
	// =======================================================================
	static void TcbProcedure(AMS_TCB* tcb);

	// =======================================================================
	//	TcbDestructor
	/*!
		タスクデストラクタ関数
	*/
	// =======================================================================
	static void TcbDestructor(AMS_TCB* tcb);

	// =======================================================================
	//	CallTaskProcedure
	/*!
		タスクプロシージャ呼び出し

		@param no		[in] タスク番号(必ず0)
	*/
	// =======================================================================
	void CallTaskProcedure(u32 no);

	// =======================================================================
	//	TypeTaskProcedure m_proc
	// -----------------------------------------------------------------------
	//!	タスクプロシージャ
	// =======================================================================
	TypeTaskProcedure m_proc;

	// =======================================================================
	//	AMS_TCB* m_tcb
	// -----------------------------------------------------------------------
	//!	タスクTCBポインタ
	// =======================================================================
	AMS_TCB* m_tcb;
};


// ***************************************************************************
// マルチタスククラス
// ***************************************************************************
// ===========================================================================
//	class CTaskMulti
// ---------------------------------------------------------------------------
//!	マルチタスククラス
// ===========================================================================
template <class T>
class CTaskMulti
{
protected:

};

// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）

// ***************************************************************************
// タスククラス
// ***************************************************************************
// ===========================================================================
//	CTask
/*!
	コンストラクタ
*/
// ===========================================================================
template <class T>
CTask<T>::CTask()
{
	m_tcb = NULL;
	SetOwnTaskProcNone();
}

// ===========================================================================
//	~CTask
/*!
	デストラクタ

	@note
	デストラクタ内でタスクが有効な場合はタスクの削除を行います。\n
*/
// ===========================================================================
template <class T>
CTask<T>::~CTask()
{
	DeleteTask(0);
}

// ===========================================================================
//	MakeTask
/*!
	タスク作成

	@param no		[in] タスク番号(必ず0)
	@param name		[in] タスク名
	@param prio		[in] 優先順位(0x0000 ～ 0xFFFF)
	@param user		[in] ユーザーID(0:所有者設定なし(グループ削除対象外))
	@param attr		[in] 属性
	@note
	既にタスクが作成済みの場合は、削除した後に新規で作成します。\n
	この関数呼び出し直後は、タスクは実行保留状態なので、
	実行させるためにStartTask関数を呼び出すようにして下さい。\n
*/
// ===========================================================================
template <class T>
void CTask<T>::MakeTask(u32 no, char* name, u32 prio, u32 user, u32 attr)
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);

	DeleteTask(0);
	m_tcb = amTaskMake(
		&CTask<T>::TcbProcedure, &CTask<T>::TcbDestructor,
		(u16)prio, user, attr, name);
	TypeTaskWork* work = (TypeTaskWork*)amTaskGetWork(m_tcb);
	work->task = this;
}

// ===========================================================================
//	StartTask
/*!
	タスク実行許可

	@param no		[in] タスク番号(必ず0)
	@note
	amTaskStart関数と同じ挙動です。\n
*/
// ===========================================================================
template <class T>
void CTask<T>::StartTask(u32 no)
{
	if (IsTaskEnable(no)) {
		amTaskStart(m_tcb);
	}
}

// ===========================================================================
//	IsTaskEnable
/*!
	タスク有効判定

	@param no		[in] タスク番号(必ず0)
	@return 真：有効　偽：無効
	@note
	タスクが作成されているなら有効、削除されているなら無効と判定します。\n
*/
// ===========================================================================
template <class T>
BOOL CTask<T>::IsTaskEnable(u32 no) const
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	if (m_tcb) {
		return TRUE;
	}
	return FALSE;
}

// ===========================================================================
//	DeleteOwnTask
/*!
	自身のタスク削除

	@note
	既に削除済みの場合は何も処理しません。\n
*/
// ===========================================================================
template <class T>
void CTask<T>::DeleteOwnTask()
{
	if (IsTaskEnable(0)) {
		*((CTask<T>**)amTaskGetWork(m_tcb)) = NULL;
		amTaskDelete(m_tcb);
		m_tcb = NULL;
	}
}

// ===========================================================================
//	DeleteTask
/*!
	タスク削除

	@param no		[in] タスク番号(必ず0)
	@note
	既に削除済みの場合は何も処理しません。\n
*/
// ===========================================================================
template <class T>
void CTask<T>::DeleteTask(u32 no)
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	DeleteOwnTask();
}

// ===========================================================================
//	SetOwnTaskProcNone
/*!
	自身に無効タスクプロシージャ設定
*/
// ===========================================================================
template <class T>
void CTask<T>::SetOwnTaskProcNone()
{
	m_proc = NULL;
}

// ===========================================================================
//	SetTaskProcNone
/*!
	無効タスクプロシージャ設定

	@param no		[in] タスク番号(必ず0)
*/
// ===========================================================================
template <class T>
void CTask<T>::SetTaskProcNone(u32 no)
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	SetOwnTaskProcNone();
}

// ===========================================================================
//	SetOwnTaskProc
/*!
	自身のタスクプロシージャ設定

	@param proc		[in] タスクプロシージャ
*/
// ===========================================================================
template <class T>
void CTask<T>::SetOwnTaskProc(TypeTaskProcedure proc)
{
	m_proc = proc;
}

// ===========================================================================
//	SetTaskProc
/*!
	タスクプロシージャ設定

	@param no		[in] タスク番号(必ず0)
	@param proc		[in] タスクプロシージャ
*/
// ===========================================================================
template <class T>
void CTask<T>::SetTaskProc(u32 no, TypeTaskProcedure proc)
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	SetOwnTaskProc(proc);
}

// ===========================================================================
//	GetOwnTaskProc
/*!
	自身のタスクプロシージャ取得

	@return 自身のタスクプロシージャ
*/
// ===========================================================================
template <class T>
typename CTask<T>::TypeTaskProcedure CTask<T>::GetOwnTaskProc() const
{
	return m_proc;
}

// ===========================================================================
//	GetTaskProc
/*!
	タスクプロシージャ取得

	@param no		[in] タスク番号(必ず0)
	@return タスクプロシージャ
*/
// ===========================================================================
template <class T>
typename CTask<T>::TypeTaskProcedure CTask<T>::GetTaskProc(u32 no) const
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	return GetOwnTaskProc();
}

// ===========================================================================
//	IsOwnTaskProcNone
/*!
	自身の無効タスクプロシージャ判定

	@return 真：無効タスクプロシージャ　偽：それ以外
*/
// ===========================================================================
template <class T>
BOOL CTask<T>::IsOwnTaskProcNone() const
{
	if (m_proc == NULL) {
		return TRUE;
	}
	return FALSE;
}

// ===========================================================================
//	IsTaskProcNone
/*!
	無効タスクプロシージャ判定

	@param no		[in] タスク番号(必ず0)
	@return 真：無効タスクプロシージャ　偽：それ以外
*/
// ===========================================================================
template <class T>
BOOL CTask<T>::IsTaskProcNone(u32 no) const
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	return IsOwnTaskProcNone();
}

// ===========================================================================
//	IsOwnTaskProc
/*!
	自身のタスクプロシージャ判定

	@param proc		[in] 判定タスクプロシージャ
	@return 真：等しい　偽：それ以外
*/
// ===========================================================================
template <class T>
BOOL CTask<T>::IsOwnTaskProc(TypeTaskProcedure proc)
{
	if (proc == m_proc) {
		return TRUE;
	}
	return FALSE;
}

// ===========================================================================
//	IsTaskProc
/*!
	タスクプロシージャ判定

	@param no		[in] タスク番号(必ず0)
	@param proc		[in] 判定タスクプロシージャ
	@return 真：等しい　偽：それ以外
*/
// ===========================================================================
template <class T>
BOOL CTask<T>::IsTaskProc(u32 no, TypeTaskProcedure proc)
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	return IsOwnTaskProc(proc);
}

// ===========================================================================
//	TaskDestructor
/*!
	タスクデストラクタ

	@param no		[in] タスク番号(必ず0)
	@note
	amDeleteTask系の関数によりタスクが削除された場合に
	この関数が呼び出されます。\n
	このクラスのデストラクタや
	クラス内部からDeleteTask関数によってタスクが削除された場合は
	この関数は呼び出されません。\n
	\n
	この関数内ではGetTcb関数が使用できないので注意してください。\n
	\n
	この関数のデフォルトの動作としては何も行わないので
	必要な処理がある場合はこの関数をオーバーライドしてください。\n
*/
// ===========================================================================
template <class T>
void CTask<T>::TaskDestructor(u32 no)
{
	UNREFERENCED_PARAMETER(no);
	// empty
}

// ===========================================================================
//	GetOwnTcb
/*!
	自身のタスクTCBポインタ取得

	@return タスクTCBポインタ
	@note
	タスク未作成の場合はNULLを返します。\n
*/
// ===========================================================================
template <class T>
AMS_TCB* CTask<T>::GetOwnTcb()
{
	return m_tcb;
}

// ===========================================================================
//	GetTcb
/*!
	タスクTCBポインタ取得

	@param no		[in] タスク番号(必ず0)
	@return タスクTCBポインタ
	@note
	タスク未作成の場合はNULLを返します。\n
*/
// ===========================================================================
template <class T>
AMS_TCB* CTask<T>::GetTcb(u32 no)
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);
	return GetOwnTcb();
}

// ===========================================================================
//	TcbProcedure
/*!
	タスクプロシージャ関数
*/
// ===========================================================================
template <class T>
void CTask<T>::TcbProcedure(AMS_TCB* tcb)
{
	// ワーク取得
	TypeTaskWork* work = (TypeTaskWork*)amTaskGetWork(tcb);
	if ((work == NULL) || (work->task == NULL)) {
		amAssert(0);
		amTaskDelete(tcb);
		return;
	}

	// プロシージャ呼び出し
	work->task->CallTaskProcedure(0);
}

// ===========================================================================
//	TcbDestructor
/*!
	タスクデストラクタ関数
*/
// ===========================================================================
template <class T>
void CTask<T>::TcbDestructor(AMS_TCB* tcb)
{
	// ワーク取得
	TypeTaskWork* work = (TypeTaskWork*)amTaskGetWork(tcb);
	if (work && work->task) {
		work->task->m_tcb = NULL;
		work->task->TaskDestructor(0);
	}
}

// ===========================================================================
//	CallTaskProcedure
/*!
	タスクプロシージャ呼び出し

	@param no		[in] タスク番号(必ず0)
*/
// ===========================================================================
template <class T>
void CTask<T>::CallTaskProcedure(u32 no)
{
	UNREFERENCED_PARAMETER(no);
	amAssert(no == 0);

	if (m_proc) {
		(((T*)this)->*m_proc)();
	}
}

// ----- Static Functions --------------------（スタティック関数の定義：局所）

} // namespace ao

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
