// ===========================================================================
/*!
	@file	aoTexture.h
	@brief	AoLibrary テクスチャユーティリティ宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）

// ===========================================================================
//	struct AOS_TEXTURE
// ---------------------------------------------------------------------------
//!	テクスチャ構造体
// ===========================================================================
typedef struct tag_AOS_TEXTURE {
	NNS_TEXLIST*	texlist;		//!< テクスチャリスト
	void*			texlist_buf;	//!< テクスチャリストバッファ
	s32				reg_id;			//!< テクスチャ処理登録ID
	void*			amb;			//!< AMBファイル
	void*			txb;			//!< TXBファイル
	u32				pad[3];			//!< パディング領域
} AOS_TEXTURE; // 32byte

// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	AoTexBuild
/*!
	AMBファイルからテクスチャ構築

	@param tex		[out] テクスチャ構造体
	@param amb		[io]  AMBファイル(要アドレス変換)
	@note
	1つのTXBファイルと1つ以上のテクスチャファイルで構成されたAMBを元に
	テクスチャを使用できるように構築処理を行います。\n
	この関数呼出し後、AoTexLoad関数を呼び出すことで、
	テクスチャの読み込み処理が開始されます。\n
	(AMB内のテクスチャを使用するのでファイルアクセスは発生しません。)\n
	指定するAMBファイルは、アドレス変換済みである必要があります。\n
	不正な引数を指定した場合は、アサートし何も行いません。\n
*/
// ===========================================================================
extern void AoTexBuild(AOS_TEXTURE* tex, void* amb);

// ===========================================================================
//	AoTexLoad
/*!
	テクスチャ読み込み開始

	@param tex		[io] テクスチャ構造体
	@note
	AoTexBuild***関数で構築したテクスチャ構造体を元に、
	必要な読み込み処理を行います。\n
	この関数は即時復帰です。\n
	読み込みの完了はAoTexIsLoaded関数で判別してください。\n
	未構築のテクスチャ構造体を指定した場合、アサートし何も行いません。\n
	既に読み込み中の場合はアサートし何も行いません。\n
	AoTexRelease関数呼び出し以降の場合は、アサートし何も行いません。\n
*/
// ===========================================================================
extern void AoTexLoad(AOS_TEXTURE* tex);

// ===========================================================================
//	AoTexIsLoaded
/*!
	テクスチャ読み込み完了判定

	@param tex		[io] テクスチャ構造体
	@return 真：読み込み完了　偽：それ以外
	@note
	AoTexLoad関数で開始した読み込み処理が完了したかどうかを判定します。\n
	AoTexLoad関数が正常に呼び出されていない状態の場合は、
	アサートしFALSEを返します。\n
*/
// ===========================================================================
extern BOOL AoTexIsLoaded(AOS_TEXTURE* tex);

// ===========================================================================
//	AoTexGetTexList
/*!
	テクスチャリスト取得

	@param tex		[io] テクスチャ構造体
	@return テクスチャリスト
	@note
	この関数はAoTexIsLoaded関数が正常にTRUEを返す状態でのみ
	呼び出すことができます。\n
	それ以外の状態で呼び出された場合は、アサートしNULLを返します。
*/
// ===========================================================================
extern NNS_TEXLIST* AoTexGetTexList(const AOS_TEXTURE* tex);

// ===========================================================================
//	AoTexGetTxb
/*!
	TXBファイル取得

	@param tex		[io] テクスチャ構造体
	@return TXBファイル
	@note
	この関数はAoTexIsLoaded関数が正常にTRUEを返す状態でのみ
	呼び出すことができます。\n
	それ以外の状態で呼び出された場合は、アサートしNULLを返します。
*/
// ===========================================================================
extern const void* AoTexGetTxb(const AOS_TEXTURE* tex);

// ===========================================================================
//	AoTexRelease
/*!
	テクスチャ解放開始

	@param tex		[io] テクスチャ構造体
	@note
	テクスチャ構造体が現在確保しているリソースを解放し、
	AoTexBuild関数呼び出し以前の状態に戻します。\n
	AoTexIsLoaded関数がTRUEを返す状態でしか呼び出すことができません。\n
	解放処理の官僚はAoTexIsReleased関数で判別してください。\n
	この関数を呼び出した場合、
	時間経過により必ずAoTexIsReleased関数がTRUEを返すようになります。\n
	内部でのアサートなどはありません。\n
*/
// ===========================================================================
extern void AoTexRelease(AOS_TEXTURE* tex);

// ===========================================================================
//	AoTexIsReleased
/*!
	テクスチャ解放完了判定

	@param tex		[io] テクスチャ構造体
	@return 真：解放完了　偽：それ以外
	@note
	AoTexRelease関数で開始した解放処理が完了したかどうかを判定します。\n
	すでに解放済みの場合は何も行わずTRUEを返します。\n
*/
// ===========================================================================
extern BOOL AoTexIsReleased(AOS_TEXTURE* tex);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
