// ===========================================================================
/*!
	@file	aoTrophy.h
	@brief	AoLibrary トロフィー管理モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	enum AOE_TROPHY_ERROR
// ---------------------------------------------------------------------------
//!	エラー列挙
// ===========================================================================
typedef enum tag_AOE_TROPHY_ERROR {
	AOD_TROPHY_ERROR_NONE			= 0,	//!< エラー無し
	AOD_TROPHY_ERROR_FILE_FAILURE,			//!< トロフィーファイルが不正
	AOD_TROPHY_ERROR_DISK_SPACE,			//!< ディスク容量不足
	AOD_TROPHY_ERROR_OPERATION,				//!< 操作エラー
	AOD_TROPHY_ERROR_OTHER,					//!< その他

	AOD_TROPHY_ERROR_NUM,					//!< エラー数
} AOE_TROPHY_ERROR;

// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ***************************************************************************
// 初期化&終了処理
// ***************************************************************************
// ===========================================================================
//	AoTrophyInit
/*!
	トロフィー管理モジュール初期化処理

	@param is_trial	[in] 真：体験版　偽：製品版
	@note
	アプリケーション起動時に1度だけ呼び出して下さい。\n
	あらかじめ、AoAccountInit関数が呼ばれている必要があります。\n
*/
// ===========================================================================
extern void AoTrophyInit(BOOL is_trial = FALSE);

// ===========================================================================
//	AoTrophyExit
/*!
	トロフィー管理モジュール終了処理

	@note
	アプリケーション終了時に1度だけ呼び出して下さい。\n
	AoTrophyInit関数が呼び出されていない状態では、
	この関数を呼び出さないようにして下さい。\n
	この関数を呼出し後、再度AoTrophyInit関数を呼び出すことはできません。\n
*/
// ===========================================================================
extern void AoTrophyExit(void);

#if defined(AOD_PLATFORM_PS3)
// ===========================================================================
//	AoTrophyPs3SetComId
/*!
	PS3 NPコミュニケーションID設定

	@param id		[in] NPコミュニケーションID
*/
// ===========================================================================
extern void AoTrophyPs3SetComId(const SceNpCommunicationId* id);

// ===========================================================================
//	AoTrophyPs3SetComSignature
/*!
	PS3 NPコミュニケーションシグネチャ設定

	@param sig		[in] NPコミュニケーションシグネチャ
*/
// ===========================================================================
extern void AoTrophyPs3SetComSignature(const SceNpCommunicationSignature* sig);
#endif // defined(AOD_PLATFORM_PS3)


// ***************************************************************************
// エラー
// ***************************************************************************
// ===========================================================================
//	AoTrophyIsError
/*!
	エラー判定

	@return 真：エラーあり　偽：エラーなし
	@note
	このモジュール内でエラーが発生したかどうかを判定します。\n
	AoTrophyClearError関数を呼び出すと、エラーなしの状態となり、
	その後エラーが発生するとTRUEを返すようになります。\n
*/
// ===========================================================================
extern BOOL AoTrophyIsError(void);

// ===========================================================================
//	AoTrophyGetError
/*!
	エラー取得

	@return 真：エラー
	@note
	最後に発生したエラー情報を返します。\n
	AoTrophyIsError関数がFALSEを返す状態で呼び出すと
	AOD_TROPHY_ERROR_NONEを返します。\n
*/
// ===========================================================================
extern AOE_TROPHY_ERROR AoTrophyGetError(void);

// ===========================================================================
//	AoTrophyClearError
/*!
	エラークリア
*/
// ===========================================================================
extern void AoTrophyClearError(void);


// ***************************************************************************
// インストール
// ***************************************************************************
// ===========================================================================
//	AoTrophyInstallStart
/*!
	トロフィーのインストール開始

	@note
	アプリケーションでトロフィー関連の処理を行うために、
	(必要なプラットフォームのみ)
	トロフィーファイルのインストールを行います。\n
*/
// ===========================================================================
extern void AoTrophyInstallStart(void);

// ===========================================================================
//	AoTrophyInstallIsFinished
/*!
	トロフィーのインストール完了判定

	@return 真：完了済み　偽：インストール中
	@note
	AoTrophyInstallStart関数で開始したインストール処理が
	完了したかどうかを判定します。\n
	AoTrophyInstallStart関数を呼び出していない場合はTRUEを返します。\n
*/
// ===========================================================================
extern BOOL AoTrophyInstallIsFinished(void);

// ===========================================================================
//	AoTrophyInstallIsSuccess
/*!
	トロフィーのインストール成功判定

	@return 真：成功　偽：失敗
	@note
	AoTrophyInstallStart関数で開始したインストール処理が
	成功したかどうかを判定します。\n
	この関数はAoTrophyInstallIsFinished関数が
	TRUEを返す状態でのみ呼び出し可能です。\n
	インストールが失敗した場合の詳細は、
	AoTrophyGetError関数で取得して下さい。\n
	AoTrophyInstallStart関数を呼び出していない場合はFALSEを返します。\n
*/
// ===========================================================================
extern BOOL AoTrophyInstallIsSuccess(void);


// ***************************************************************************
// 獲得
// ***************************************************************************
// ===========================================================================
//	AoTrophyAcquisitionTaskStart
/*!
	トロフィー獲得監視タスク開始

	@note
	AoTrophyAcquisition関数によるトロフィーの獲得を監視し、
	必要な獲得処理を行うタスクを生成します。\n
	この関数でタスクの生成を行わないとトロフィーの獲得処理が行われません。\n
	すでに生成済みの場合は何も行いません。\n
*/
// ===========================================================================
extern void AoTrophyAcquisitionTaskStart(void);

// ===========================================================================
//	AoTrophyAcquisitionTaskEnd
/*!
	トロフィー獲得監視タスク終了

	@note
	AoTrophyAcquisitionTaskStart関数で開始した監視タスクを終了させます。\n
	以降、AoTrophyAcquisition関数でトロフィー獲得を指示しても、
	再度監視タスクを生成するまで獲得処理は行われません。\n
	すでに終了済みの場合は何も行いません。\n
*/
// ===========================================================================
extern void AoTrophyAcquisitionTaskEnd(void);

// ===========================================================================
//	AoTrophyAcquisition
/*!
	トロフィー獲得

	@param no	[in] トロフィー番号
*/
// ===========================================================================
extern void AoTrophyAcquisition(u32 no);


#if defined(AOD_PLATFORM_XBOX360)
// ***************************************************************************
// 実績UI表示
// ***************************************************************************
// ===========================================================================
//	AoTrophyShowAchievementUI
/*!
	Xbox360の実績UI表示開始

	@note
	既に表示済みの場合は何も行ないません。\n
*/
// ===========================================================================
extern void AoTrophyShowAchievementUI(void);

// ===========================================================================
//	AoTrophyIsHideAchievementUI
/*!
	Xbox360の実績UI非表示判定

	@return 真：非表示　偽：表示中
	@note
	AoTrophyShowAchievementUI関数で開始した
	実績UIの表示完了判定に使用してください。\n
*/
// ===========================================================================
extern BOOL AoTrophyIsHideAchievementUI(void);

#endif // defined(AOD_PLATFORM_XBOX360)

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
