// ===========================================================================
/*!
	@file	aoWinSys.h
	@brief	AoLibrary ウインドウシステム宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ■ウインドウタイプ解説
//
// [タイプA]
// ウインドウ左上角32x32のテクスチャを元に、最小64x64のウインドウを描画する

// ----- Include Files ---------------------------------------（インクルード）
#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	enum AOE_WIN_TYPE
// ---------------------------------------------------------------------------
//!	ウインドウタイプ
// ===========================================================================
typedef enum tag_AOE_WIN_TYPE {
	AOD_WIN_TYPE_A		= 0,		//!< タイプA

	AOD_WIN_TYPE_NUM,				//!< タイプ数
	AOD_WIN_TYPE_NONE,				//!< 無効コード
} AOE_WIN_TYPE;

// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ***************************************************************************
// 描画
// ***************************************************************************
// ===========================================================================
//	AoWinSysDraw
/*!
	ウインドウ描画(タイプ指定)

	@param type		[in] ウインドウタイプ
	@param texlist	[io] テクスチャリスト
	@param tex_id	[in] テクスチャID
	@param x		[in] ウインドウ中心X位置
	@param y		[in] ウインドウ中心Y位置
	@param w		[in] ウインドウ横サイズ
	@param h		[in] ウインドウ縦サイズ
	@note
	Zテスト無効、Zマスク有効として描画します。\n
*/
// ===========================================================================
extern void AoWinSysDraw(
	AOE_WIN_TYPE type, NNS_TEXLIST* texlist, u32 tex_id,
	f32 x, f32 y, f32 w, f32 h);

// ===========================================================================
//	AoWinSysDraw
/*!
	ウインドウ描画(タイプ指定 ステート描画)

	@param type		[in] ウインドウタイプ
	@param texlist	[io] テクスチャリスト
	@param tex_id	[in] テクスチャID
	@param x		[in] ウインドウ中心X位置
	@param y		[in] ウインドウ中心Y位置
	@param w		[in] ウインドウ横サイズ
	@param h		[in] ウインドウ縦サイズ
	@param state	[in] ステート
	@param z		[in] Z値
	@note
	カメラ設定等が必要になりますので、
	ステート実行する際には事前にAoActDrawPreを呼び出しておいて下さい。\n
*/
// ===========================================================================
extern void AoWinSysDrawState(
	AOE_WIN_TYPE type, NNS_TEXLIST* texlist, u32 tex_id,
	f32 x, f32 y, f32 w, f32 h, u32 state, f32 z = 0.0f);

// ===========================================================================
//	AoWinSysDraw
/*!
	ウインドウ描画(タイプ指定 タスク描画)

	@param type		[in] ウインドウタイプ
	@param texlist	[io] テクスチャリスト
	@param tex_id	[in] テクスチャID
	@param x		[in] ウインドウ中心X位置
	@param y		[in] ウインドウ中心Y位置
	@param w		[in] ウインドウ横サイズ
	@param h		[in] ウインドウ縦サイズ
	@param prio		[in] 描画タスク優先度
*/
// ===========================================================================
extern void AoWinSysDrawTask(
	AOE_WIN_TYPE type, NNS_TEXLIST* texlist, u32 tex_id,
	f32 x, f32 y, f32 w, f32 h, u16 prio);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
