// ===========================================================================
/*!
	@file	aoAvatarAward.h
	@brief	アバターアワードモジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

#if _XBOX

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	enum AOE_AVATARITEM
// ---------------------------------------------------------------------------
//!	アバターアイテム列挙
// ===========================================================================
typedef enum tag_AOE_AVATARITEM {
	AOD_AVATARITEM01			= 0,	//!< アバターアイテム1
	AOD_AVATARITEM02,					//!< アバターアイテム2

	AOD_AVATARITEM_NUM,					//!< アバターアイテム数
	AOD_AVATARITEM_NONE,				//!< 無効コード
} AOE_AVATARITEM;

// ===========================================================================
//	enum AOE_AVATARAWARD_RESULT
// ---------------------------------------------------------------------------
//!	アバターアワード処理結果列挙
// ===========================================================================
typedef enum tag_AOE_AVATARAWARD_RESULT {
	AOD_AVATARAWARD_RESULT_SUCCESS	= 0,	//!< 成功
	AOD_AVATARAWARD_RESULT_ERROR,			//!< エラー
//	AOD_AVATARAWARD_RESULT_ALREADY,			//!< 既に取得済み

	AOD_AVATARAWARD_RESULT_NUM,				//!< 結果数
} AOE_AVATARAWARD_RESULT;

// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	AoAvatarAwardGetStart
/*!
	アバターアイテム取得開始

	@param item		[in] 取得するアバターアイテム
	@note
	アバターアイテムの取得処理を非同期で開始します。\n
	終了判定はAoAvatarAwardIsGetEnd関数で行なって下さい。\n
	成功判定はAoAvatarAwardIsGetSuccess関数で行なって下さい。\n
	同じアバターアイテムの取得処理が行なわれている状態で呼び出した場合は
	何も行ないません。\n
	別のアバターアイテムの取得処理が行なわれている状態で呼び出した場合は
	別のアバターアイテムの取得処理が終了してから
	指定のアバターアイテムの取得処理を行ないます。\n
*/
// ===========================================================================
extern void AoAvatarAwardGetStart(AOE_AVATARITEM item);

// ===========================================================================
//	AoAvatarAwardGetIsEnd
/*!
	アバターアイテム取得完了判定

	@return 真：完了済み　偽：それ以外
	@note
	最後に呼び出したAoAvatarAwardGetStart関数で開始した
	アバターアイテム取得処理が完了したかどうかを判定します。\n
*/
// ===========================================================================
extern BOOL AoAvatarAwardGetIsEnd(void);

// ===========================================================================
//	AoAvatarAwardGetResult
/*!
	アバターアワード処理結果取得

	@return アバターアワード処理結果
	@note
	直前に行なわれたアバターアワード処理の結果を返します。\n
*/
// ===========================================================================
extern AOE_AVATARAWARD_RESULT AoAvatarAwardGetResult(void);

// ===========================================================================
//	AoAvatarAwardGetResult
/*!
	アバターアワード処理強制終了

	@note
	アバターアワード関連の処理が行なわれている場合は、
	処理の強制終了を行ないます。\n
*/
// ===========================================================================
extern void AoAvatarAwardTerminate(void);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

#endif // _XBOX

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
