// ===========================================================================
/*!
	@file	aoNetRank.h
	@brief	AoLibrary ネットワークランキングモジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

/*
	■エラーについて
	AoNetRankStart関数を呼び出してからAoNetRankEnd関数を呼び出すまでの間は、
	AoNetRankIsError関数でエラーの発生を定期的に検知しておくようにして下さい。
	エラーの発生要因としては、通常のネットワークエラーの他に、
	不正な関数呼び出しなども含まれます。
	原則、不正な関数呼び出しを行った場合はアサートし、
	AOD_NET_RANK_ERROR_OPERATIONエラーとなります。
*/

// ----- Include Files ---------------------------------------（インクルード）
#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）

#define AOD_NET_RANK_NAME_LEN	(16 + 1)	//!< 名前長(終端文字含む)

#define AOD_NET_RANK_FLAG_OWN	(1 <<  0)	//!< 自分のランキングデータ
#define AOD_NET_RANK_FLAG_SS	(1 <<  1)	//!< スーパーソニック使用

#define AOD_NET_RANK_OWN_NEAR	((u32)-1)	//!< 自身の周辺
#define AOD_NET_RANK_FRIENDS	((u32)-2)	//!< フレンドランキング

#define AOD_NET_RANK_RECV_MAX	(10)		//!< 最大受信データ数

// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	enum AOE_NET_RANK_TYPE
// ---------------------------------------------------------------------------
//!	ネットワークランキングタイプ列挙
// ===========================================================================
typedef enum tag_AOE_NET_RANK_TYPE {
	AOD_NET_RANK_TYPE_TIME			= 0,	//!< タイムアタック
	AOD_NET_RANK_TYPE_SCORE,				//!< スコアアタック

	AOD_NET_RANK_TYPE_NUM,					//!< タイプ数
	AOD_NET_RANK_TYPE_NONE,					//!< 無効コード
} AOE_NET_RANK_TYPE;

// ===========================================================================
//	enum AOE_NET_RANK_REGION
// ---------------------------------------------------------------------------
//!	ネットワークランキングリージョン列挙
// ===========================================================================
typedef enum tag_AOE_NET_RANK_REGION {
	AOD_NET_RANK_REGION_JP			= 0,	//!< 日本
	AOD_NET_RANK_REGION_US,					//!< 北米
	AOD_NET_RANK_REGION_EU,					//!< 欧州
	AOD_NET_RANK_REGION_OTHER,				//!< その他

	AOD_NET_RANK_REGION_NUM,				//!< リージョン数
} AOE_NET_RANK_REGION;

// ----- Struct Definitions --------------------------------------（型の宣言）

// ===========================================================================
//	struct AOS_NET_RANK_SEND
// ---------------------------------------------------------------------------
//!	送信データ
// ===========================================================================
typedef struct tag_AOS_NET_RANK_SEND {
	union {
		u32		time;							//!< タイム
		u32		score;							//!< スコア
	};
	BOOL		ss;								//!< 真：Sソニック使用
} AOS_NET_RANK_SEND; // 8 byte

// ===========================================================================
//	struct AOS_NET_RANK_DATA
// ---------------------------------------------------------------------------
//!	ランキングデータ
// ===========================================================================
typedef struct tag_AOS_NET_RANK_DATA {
	char		name[AOD_NET_RANK_NAME_LEN];	//!< 名前(終端文字含む)
	u8			flag;							//!< フラグ
	u8			region;							//!< リージョン
	u8			pad;							//!< パディング
	u32			rrank;							//!< 実順位(0-)
	u32			rank;							//!< 順位(0-)
	union {
		u32		time;							//!< タイム
		u32		score;							//!< スコア
	};
#if _XBOX
	XUID		xuid;							//!< XUID
#endif // _XBOX
} AOS_NET_RANK_DATA; // 32 byte

// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）

#if _WII
// ***************************************************************************
// Wii
// ***************************************************************************
// ===========================================================================
//	AoNetRankWiiSetUserData
/*!
	WiFiユーザデータ設定

	@param data		[io] ユーザデータ
	@note
	WiFi通信で使用するユーザデータ領域のポインタを設定してください。\n
	WiFi通信中は、
	この関数によるユーザデータの切り替えを行なわないようにして下さい。\n
	ここで設定したユーザデータ領域は、通信中動的に変更されます。\n
	AoNetRankStart関数呼び出し前に設定するようにして下さい。\n
*/
// ===========================================================================
extern void AoNetRankWiiSetUserData(DWCUserData* data);

// ===========================================================================
//	AoNetRankWiiSetUserName
/*!
	ユーザ名設定

	@param name		[in] ユーザ名(ASCIIコード)
	@note
	ランキングにアップする名前を指定して下さい。\n
	文字コードはASCIIです。\n
	WiFi接続時に名前のチェックを行い、不適切な名前の場合はエラーとなります。\n
	AoNetRankStart関数呼び出し前に設定するようにして下さい。\n
*/
// ===========================================================================
extern void AoNetRankWiiSetUserName(const char* name);
#endif // _WII


// ***************************************************************************
// 開始処理 & 終了処理
// ***************************************************************************
// ===========================================================================
//	AoNetRankStart
/*!
	開始処理

	@note
	ネットワークランキングへアクセスするための準備処理を開始します。\n
	すでに開始済みの場合はアサートし何も行いません。\n
	準備処理の完了はAoNetRankIsConnected関数で判定して下さい。\n
*/
// ===========================================================================
extern void AoNetRankStart(void);

#if _WII
// ===========================================================================
//	AoNetRankWiiIsNeedSaveUserdata
/*!
	ユーザデータの保存が必要か判定

	@return 真：必要　偽：それ以外
	@note
	AoNetRankStart関数で開始した接続処理中に、
	ユーザデータの保存が必要になったかどうかを判定します。\n
	この関数がTRUEを返す場合は、ユーザデータの保存を行い、
	AoNetRankWiiNoticeUserdataSaved関数で
	保存した旨を通知するようにして下さい。\n
	AoNetRankWiiNoticeUserdataSaved関数を呼び出した段階で
	この関数はFALSEを返すようになります。\n
	この関数は、AoNetRankStart関数呼び出しから、
	AoNetRankIsConnected関数がTRUEを返すまでの間に使用するようにして下さい。\n
*/
// ===========================================================================
extern BOOL AoNetRankWiiIsNeedSaveUserdata(void);

// ===========================================================================
//	AoNetRankWiiPreSaveUserdata
/*!
	ユーザデータ保存前処理

	@note
	ユーザデータを保存するための前処理として、
	ダーティーフラグの削除などを行ないます。\n
	この関数を呼び出した場合は、必ずユーザデータを保存するようにして下さい。\n
*/
// ===========================================================================
extern void AoNetRankWiiPreSaveUserdata(void);

// ===========================================================================
//	AoNetRankWiiNoticeUserdataSaved
/*!
	ユーザデータの保存完了通知

	@note
	AoNetRankWiiIsNeedSaveUserdata関数がTRUEを返した場合に行なう
	ユーザデータの保存処理が完了した際に呼び出して下さい。\n
	この関数を呼び出さない場合は、通信処理が進行しなくなります。\n
*/
// ===========================================================================
extern void AoNetRankWiiNoticeUserdataSaved(void);
#endif // _WII

// ===========================================================================
//	AoNetRankIsConnected
/*!
	接続済み判定

	@return 真：接続済み　偽：接続中
	@note
	AoNetRankStart関数で開始した準備処理の完了を判定します。\n
	AoNetRankStart関数を呼び出指定無い場合は、アサートしFALSEを返します。\n
*/
// ===========================================================================
extern BOOL AoNetRankIsConnected(void);

// ===========================================================================
//	AoNetRankIsControlDisable
/*!
	ユーザ操作無効判定

	@return 真：無効　偽：それ以外
	@note
	モジュール内部でUI表示をしているなど、
	呼び出し側のユーザ操作を無効にしなければならない状態の場合に
	TRUEを返します。\n
*/
// ===========================================================================
extern BOOL AoNetRankIsControlDisable(void);

// ===========================================================================
//	AoNetRankEnd
/*!
	終了処理

	@note
	ネットワークランキングへのアクセスを終了します。\n
	AoNetRankStart関数呼び出し以降であれば、
	どのタイミングでも呼び出し可能です。\n
	終了処理の完了はAoNetRankIsFinished関数で判定して下さい。\n
	どのような状態であっても、このモジュールを終了する際には、
	この関数を呼び出すようにして下さい。\n
	既に終了済みの場合はアサートし何も行いません。\n
*/
// ===========================================================================
extern void AoNetRankEnd(void);

// ===========================================================================
//	AoNetRankIsFinished
/*!
	終了済み判定

	@return 真：終了済み　偽：終了中
	@note
	このモジュールが終了している（初期状態）か判定します。\n
	AoNetRankStart関数の呼び出しによりFALSEを返すようになり、
	AoNetRankEnd関数の呼出し後、
	一定時間が経過するとTRUEを返すようになります。\n
*/
// ===========================================================================
extern BOOL AoNetRankIsFinished(void);

// ===========================================================================
//	AoNetRankForcedEnding
/*!
	強制終了
*/
// ===========================================================================
extern void AoNetRankForcedEnding(void);


// ***************************************************************************
// エラー
// ***************************************************************************
// ===========================================================================
//	AoNetRankIsError
/*!
	エラー判定

	@return 真：エラーあり　偽：エラー無し
	@note
	通信エラーなど、このモジュール内でエラーが発生したかどうかを判定します。\n
	AoNetRankStart関数呼び出し直後にエラー内容はクリア(エラーなし)され、
	以後、エラーが発生してからAoNetRankClearError関数が呼び出されるまで
	TRUEを返します。\n
	AoNetRankEnd関数を呼び出してもエラー内容はクリアされません。\n
*/
// ===========================================================================
extern BOOL AoNetRankIsError(void);

// ===========================================================================
//	AoNetRankClearError
/*!
	エラークリア

	@note
	AoNetRankIsError関数がTRUEを返す状態で呼び出すと、
	保持しているエラー情報をクリアし、
	AoNetRankIsError関数がFALSEを返すようになります。\n
	AoNetRankIsError関数がFALSEを返す状態で呼び出した場合は何も行いません。\n
*/
// ===========================================================================
extern void AoNetRankClearError(void);


// ***************************************************************************
// 送信
// ***************************************************************************
// ===========================================================================
//	AoNetRankSendSetData
/*!
	ランキング送信データ設定

	@param board	[in] 送信先ランキングボード番号
	@param type		[in] ランキングタイプ
	@param data		[in] 送信データ
	@param is_asc	[in] 真：昇順　偽：降順
	@note
	指定のランキングボードへ送信する自身のデータを設定します。\n
	実際の送信はAoNetRankSend関数呼び出しにより行なわれます。\n
	複数回この関数を呼び出すと、最大16個までデータを積みます。\n
	内部でdataのコピーを保持するので、
	この関数呼出し後、dataは破棄して問題ありません。\n
	AoNetRankSendIsFinished関数とAoNetRankRecvIsFinished関数が
	全てTRUEを返す状態以外でこの関数を呼び出さないで下さい。\n
*/
// ===========================================================================
extern void AoNetRankSendSetData(
	u32 board, AOE_NET_RANK_TYPE type, const AOS_NET_RANK_SEND* data,
	BOOL is_asc);

// ===========================================================================
//	AoNetRankSendStart
/*!
	ランキング送信

	@note
	AoNetRankSendSetData関数で設定した送信データを送信します。\n
	AoNetRankSendIsFinished関数とAoNetRankRecvIsFinished関数が
	全てTRUEを返す状態以外でこの関数を呼び出さないで下さい。\n
*/
// ===========================================================================
extern void AoNetRankSendStart(void);

// ===========================================================================
//	AoNetRankSendClear
/*!
	ランキング送信データクリア

	@note
	AoNetRankSendSetData関数で設定した送信データをクリアします。\n
	送信処理が終了すると自動でクリアされるので呼び出す必要はありませんが、
	念のためAoNetRankSendSetData関数呼び出し前に呼び出すことをお勧めします。\n
*/
// ===========================================================================
extern void AoNetRankSendClear(void);

#if defined(AOD_PLATFORM_XBOX360)
// ===========================================================================
//! 送信キャンセル可能判定
// ===========================================================================
extern BOOL AoNetRankSendIsCancelable(void);
#endif // defined(AOD_PLATFORM_XBOX360)

// ===========================================================================
//	AoNetRankSendCancel
/*!
	ランキングデータ送信キャンセル

	@note
	AoNetRankSendStart関数で開始した送信処理を中断します。\n
	この関数を呼び出しても、すぐに送信が終了するわけでは無いので、
	AoNetRankSendIsFinished関数で終了判定を行うようにして下さい。\n
	AoNetRankSendIsFinished関数がFALSEを返す間のみ呼び出し可能です。\n
	この関数を呼び出した場合は、
	AoNetRankSendIsComplate関数が必ずFALSEを返すようになります。\n
*/
// ===========================================================================
extern void AoNetRankSendCancel(void);

// ===========================================================================
//	AoNetRankSendIsFinished
/*!
	ランキングデータ送信終了判定

	@return 真：終了済み　偽：送信中
	@note
	AoNetRankSendStart関数で開始した送信処理が終了したか判定します。\n
*/
// ===========================================================================
extern BOOL AoNetRankSendIsFinished(void);

// ===========================================================================
//	AoNetRankSendIsComplate
/*!
	ランキングデータ送信完了判定

	@return 真：送信完了できた　偽：できなかった
	@note
	AoNetRankSendStart関数で開始した送信処理により、
	データが正常にランキングに反映されたか判定します。\n
	この関数がFALSEを返す場合は、通信エラーにより送信ができなかったか、
	AoNetRankSendCancel関数で処理が中断されたかのどちらかとなります。\n
	この関数はAoNetRankSendIsFinished関数がTRUEを返す間のみ呼び出し可能です。\n
*/
// ===========================================================================
extern BOOL AoNetRankSendIsComplate(void);


// ***************************************************************************
// 受信
// ***************************************************************************
// ===========================================================================
//	AoNetRankRecvStart
/*!
	ランキングデータ受信開始

	@param board	[in] 受信元ランキングボード番号
	@param type		[in] ランキングタイプ
	@param rank		[in] 取得するランキングの先頭順位
	@param is_asc	[in] 真：昇順　偽：降順
	@note
	指定のランキングボードから指定のランキングデータを受信します。\n
	rankにAOD_NET_RANK_OWN_NEARを指定することで、
	自分の周辺のランキングを取得することができます。\n
	AoNetRankSendIsFinished関数とAoNetRankRecvIsFinished関数が
	全てTRUEを返す状態以外でこの関数を呼び出さないで下さい。\n
*/
// ===========================================================================
extern void AoNetRankRecvStart(
	u32 board, AOE_NET_RANK_TYPE type, u32 rank, BOOL is_asc);

// ===========================================================================
//	AoNetRankSendCancel
/*!
	ランキングデータ受信キャンセル

	@note
	AoNetRankRecvStart関数で開始した受信処理を中断します。\n
	この関数を呼び出しても、すぐに受信が終了するわけでは無いので、
	AoNetRankRecvIsFinished関数で終了判定を行うようにして下さい。\n
	AoNetRankRecvIsFinished関数がFALSEを返す間のみ呼び出し可能です。\n
	この関数を呼び出した場合は、
	AoNetRankRecvIsComplate関数が必ずFALSEを返すようになります。\n
*/
// ===========================================================================
extern void AoNetRankRecvCancel(void);

// ===========================================================================
//	AoNetRankRecvIsFinished
/*!
	ランキングデータ受信終了判定

	@return 真：終了済み　偽：送信中
	@note
	AoNetRankRecvStart関数で開始した受信処理が終了したか判定します。\n
*/
// ===========================================================================
extern BOOL AoNetRankRecvIsFinished(void);

// ===========================================================================
//	AoNetRankRecvIsComplate
/*!
	ランキングデータ受信完了判定

	@return 真：受信完了できた　偽：できなかった
	@note
	AoNetRankRecvStart関数で開始した受信処理により、
	正常にランキングデータが取得できたか判定します。\n
	この関数がFALSEを返す場合は、通信エラーにより受信ができなかったか、
	AoNetRankRecvCancel関数で処理が中断されたかのどちらかとなります。\n
	この関数はAoNetRankRecvIsFinished関数がTRUEを返す間のみ呼び出し可能です。\n
*/
// ===========================================================================
extern BOOL AoNetRankRecvIsComplate(void);

// ===========================================================================
//	AoNetRankRecvGetRecvNum
/*!
	受信データ数取得

	@return 受信データ数(最大AOD_NET_RANK_RECV_MAX)
	@note
	受信したデータ数を返します。\n
	通常はAOD_NET_RANK_RECV_MAXを返しますが、ランキングに登録されている人数が
	AOD_NET_RANK_RECV_MAXに満たない場合は
	AOD_NET_RANK_RECV_MAXより小さい数を返します。\n
	この関数はAoNetRankRecvIsComplate関数が
	TRUEを返す状態でのみ呼び出し可能です。\n
*/
// ===========================================================================
extern u32 AoNetRankRecvGetRecvNum(void);

// ===========================================================================
//	AoNetRankRecvGetData
/*!
	受信データ取得

	@param no		[in] 受信データ番号
	@return 受信データ
	@note
	受信データ番号には、0からAoNetRankRecvGetRecvNum関数の戻り値から
	1を引いた数値までを指定できます。\n
	受信データは次回AoNetRankRecvStart関数を呼び出すまで有効です。\n
*/
// ===========================================================================
extern const AOS_NET_RANK_DATA* AoNetRankRecvGetData(u32 no);


// ***************************************************************************
// ユーティリティ
// ***************************************************************************
// ===========================================================================
//	AoNetRankUtilSendDataMake
/*!
	受信データから名前取得

	@param data		[in] 受信データ
	@return 名前(終端文字含む)
*/
// ===========================================================================
extern const char* AoNetRankUtilRecvDataGetName(const AOS_NET_RANK_DATA* data);

// ===========================================================================
//	AoNetRankUtilRecvDataIsSs
/*!
	受信データからスーパーソニック使用の有無を判定

	@param data		[in] 受信データ
	@return 真：スーパーソニック使用　偽：未使用
*/
// ===========================================================================
extern BOOL AoNetRankUtilRecvDataIsSs(const AOS_NET_RANK_DATA* data);

// ===========================================================================
//	AoNetRankUtilRecvDataIsOwn
/*!
	受信データが自身のデータか判定

	@param data		[in] 受信データ
	@return 真：自身のデータである　偽：自身のデータではない
*/
// ===========================================================================
extern BOOL AoNetRankUtilRecvDataIsOwn(const AOS_NET_RANK_DATA* data);

// ===========================================================================
//	AoNetRankUtilRecvDataGetTime
/*!
	受信データからタイム取得

	@param data		[in] 受信データ
	@return タイム
*/
// ===========================================================================
extern u32 AoNetRankUtilRecvDataGetTime(const AOS_NET_RANK_DATA* data);

// ===========================================================================
//	AoNetRankUtilRecvDataGetScore
/*!
	受信データからスコア取得

	@param data		[in] 受信データ
	@return スコア
*/
// ===========================================================================
extern u32 AoNetRankUtilRecvDataGetScore(const AOS_NET_RANK_DATA* data);

// ===========================================================================
//	AoNetRankUtilRecvDataGetRegion
/*!
	受信データからリージョン取得

	@param data		[in] 受信データ
	@return リージョン
*/
// ===========================================================================
extern AOE_NET_RANK_REGION AoNetRankUtilRecvDataGetRegion(
	const AOS_NET_RANK_DATA* data);

// ===========================================================================
//	AoNetRankUtilRecvDataGetRank
/*!
	受信データから順位取得

	@param data		[in] 受信データ
	@return 順位
*/
// ===========================================================================
extern u32 AoNetRankUtilRecvDataGetRank(const AOS_NET_RANK_DATA* data);

#if _XBOX
// ===========================================================================
//	AoNetRankUtilRecvDataGetXUID
/*!
	受信データからXUID取得

	@param data		[in] 受信データ
	@return XUID
*/
// ===========================================================================
extern XUID AoNetRankUtilRecvDataGetXUID(const AOS_NET_RANK_DATA* data);
#endif // _XBOX

// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
