// ===========================================================================
/*!
	@file	aoPresence.cpp
	@brief	プレゼンスシステム定義(未サポートプラットフォーム)

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================

// ----- Include Files ---------------------------------------（インクルード）
#include "pch.h"
#include "aoPresence.h"

#if !_XBOX

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）

// ===========================================================================
//	AoPresenceInit
/*!
	プレゼンスシステム初期化開始

	@note
	アプリケーション起動時に一度だけ呼び出して下さい。\n
*/
// ===========================================================================
void AoPresenceInit(void)
{
	// empty
}

// ===========================================================================
//	AoPresenceInit
/*!
	プレゼンスシステム初期化終了判定

	@return 真：初期化終了済み　偽：それ以外
	@note
	AoPresenceInit関数で開始した終了処理が完了したかどうかを判定します。\n
*/
// ===========================================================================
BOOL AoPresenceInitialized(void)
{
	// empty
	return TRUE;
}

// ===========================================================================
//	AoPresenceInit
/*!
	プレゼンスシステム終了処理

	@note
	アプリケーション終了時に一度だけ呼び出して下さい。\n
*/
// ===========================================================================
void AoPresenceExit(void)
{
	// empty
}

// ===========================================================================
//	AoPresenceSet
/*!
	プレゼンス設定

	@param presence	[in] 設定するプレゼンス
	@param is_trial	[in] 真：体験版　偽：製品版
	@note
	フレンドなどに公開する現在プレイ中のユーザのプレゼンスを設定します。\n
	この関数はゲーム中何度でも呼び出し可能です。\n
	既に同じプレゼンスが設定されている場合は何も行ないません。\n
	無効な引数を指定した場合は、アサートしAOD_PRESENCE_STANDBYを設定します。\n
*/
// ===========================================================================
void AoPresenceSet(AOE_PRESENCE presence, BOOL is_trial)
{
	UNREFERENCED_PARAMETER(presence);
	UNREFERENCED_PARAMETER(is_trial);
	// empty
}

// ----- Static Functions --------------------（スタティック関数の定義：局所）

#endif // !_XBOX

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
