// ===========================================================================
/*!
	@file	aoTvxFile.h
	@brief	TVXファイルモジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	enum TVXE_PRIMTYPE
// ---------------------------------------------------------------------------
//!	プリミティブタイプ列挙
// ===========================================================================
typedef enum tag_AOE_TVX_PRIMTYPE {
	AOD_TVX_PRIMTYPE_POINTS	= 0,	//!< ポイントリスト
	AOD_TVX_PRIMTYPE_LINES,			//!< ラインリスト
	AOD_TVX_PRIMTYPE_LINESTRIP,		//!< ラインストリップ
	AOD_TVX_PRIMTYPE_TRIANGLES,		//!< トライアングルリスト
	AOD_TVX_PRIMTYPE_TRIANGLESTRIP,	//!< トライアングルストリップ
	AOD_TVX_PRIMTYPE_TRIANGLEFAN,	//!< トライアングルファン

	AOD_TVX_PRIMTYPE_NUM,			//!< タイプ数
} AOE_TVX_PRIMTYPE;

// ----- Struct Definitions --------------------------------------（型の宣言）

// ===========================================================================
//	struct AOS_TVX_VERTEX
// ---------------------------------------------------------------------------
//!	頂点型
// ===========================================================================
typedef struct tag_AOS_TVX_VERTEX {
	f32		x;		//!< X座標
	f32		y;		//!< Y座標
	f32		z;		//!< Z座標
	u32		c;		//!< 頂点カラー
	f32		u;		//!< U座標
	f32		v;		//!< V座標
	f32		pad[2];	//!< パディング
} AOS_TVX_VERTEX; // 32 byte

// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	AoTvxIsTvxFile
/*!
	TVXファイル判定

	@param file		[in] ファイル
	@return 真：TVXファイル　偽：それ以外
	@note
	指定されたファイルがTVXファイルであるか判定します。\n
	ヘッダ情報のみを参照して判定を行ないます。\n
*/
// ===========================================================================
extern BOOL AoTvxIsTvxFile(const void* file);

// ===========================================================================
//	AoTvxGetTextureNum
/*!
	テクスチャ数取得

	@param file		[in] ファイル
	@return テクスチャ数
*/
// ===========================================================================
extern u32 AoTvxGetTextureNum(const void* file);

// ===========================================================================
//	AoTvxGetTextureId
/*!
	テクスチャID取得

	@param file		[in] ファイル
	@param tex_no	[in] テクスチャ番号
	@return テクスチャID
*/
// ===========================================================================
extern s32 AoTvxGetTextureId(const void* file, u32 tex_no);

// ===========================================================================
//	AoTvxGetPrimitiveType
/*!
	プリミティブタイプ取得

	@param file		[in] ファイル
	@param tex_no	[in] テクスチャ番号
	@return プリミティブタイプ
*/
// ===========================================================================
extern AOE_TVX_PRIMTYPE AoTvxGetPrimitiveType(const void* file, u32 tex_no);

// ===========================================================================
//	AoTvxGetVertexNum
/*!
	頂点数取得

	@param file		[in] ファイル
	@param tex_no	[in] テクスチャ番号
	@return 頂点数
*/
// ===========================================================================
extern u32 AoTvxGetVertexNum(const void* file, u32 tex_no);

// ===========================================================================
//	AoTvxGetVertex
/*!
	頂点配列取得

	@param file		[in] ファイル
	@param tex_no	[in] テクスチャ番号
	@return 頂点配列先頭ポインタ
*/
// ===========================================================================
extern const AOS_TVX_VERTEX* AoTvxGetVertex(const void* file, u32 tex_no);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
