// ===========================================================================
/*!
	@file	aoYsdFile.h
	@brief	YSDファイルモジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	AoYsdFileIsYsdFile
/*!
	YSDファイル判定

	@param file		[in] YSDファイル
	@return 真：YSDファイル　偽：それ以外
	@note
	指定したバッファに格納されているファイルがYSDファイルであるか判定します。\n
	ヘッダ情報のみをチェックして判定を行ないます。\n
*/
// ===========================================================================
extern BOOL AoYsdFileIsYsdFile(const void* file);

// ===========================================================================
//	AoYsdFileGetPageNum
/*!
	ページ数取得

	@param file		[in] YSDファイル
	@return ページ数
	@note
	指定のYSDファイルに含まれているページ数を返します。\n
	不正な引数を指定した場合は、アサートし0を返します。\n
*/
// ===========================================================================
extern u32 AoYsdFileGetPageNum(const void* file);

// ===========================================================================
//	AoYsdFileGetPageTime
/*!
	ページ時間取得

	@param file		[in] YSDファイル
	@param page_no	[in] ページ番号
	@return ページ時間
	@note
	指定のYSDファイルの、指定番号のページに含まれている時間を返します。\n
	不正な引数を指定した場合は、アサートし0を返します。\n
*/
// ===========================================================================
extern u32 AoYsdFileGetPageTime(const void* file, u32 page_no);

// ===========================================================================
//	AoYsdFileIsPageShowImage
/*!
	ページ画像表示判定

	@param file		[in] YSDファイル
	@param page_no	[in] ページ番号
	@return 真：表示あり　偽：表示なし
	@note
	指定のYSDファイルの、指定番号のページに画像表示があるか判定します。\n
	不正な引数を指定した場合は、アサートしFALSEを返します。\n
*/
// ===========================================================================
extern BOOL AoYsdFileIsPageShowImage(const void* file, u32 page_no);

// ===========================================================================
//	AoYsdFileGetPageShowImageNo
/*!
	ページ表示画像番号取得

	@param file		[in] YSDファイル
	@param page_no	[in] ページ番号
	@return ページ表示画像番号
	@note
	指定のYSDファイルの、指定番号のページの表示画像番号を返します。\n
	AoYsdFileIsPageShowImage関数がTRUEを返す場合のみ呼び出し可能です。\n
	不正な引数を指定した場合は、アサートし0を返します。\n
*/
// ===========================================================================
extern u32 AoYsdFileGetPageShowImageNo(const void* file, u32 page_no);

// ===========================================================================
//	AoYsdFileIsPageHideImage
/*!
	ページ画像非表示判定

	@param file		[in] YSDファイル
	@param page_no	[in] ページ番号
	@return 真：非表示あり　偽：非表示なし
	@note
	指定のYSDファイルの、指定番号のページに画像非表示があるか判定します。\n
	不正な引数を指定した場合は、アサートしFALSEを返します。\n
*/
// ===========================================================================
extern BOOL AoYsdFileIsPageHideImage(const void* file, u32 page_no);

// ===========================================================================
//	AoYsdFileGetPageOption
/*!
	ページオプション取得

	@param file		[in] YSDファイル
	@param page_no	[in] ページ番号
	@return ページオプション
	@note
	指定のYSDファイルの、指定番号のページに含まれているオプションを返します。\n
	不正な引数を指定した場合は、アサートし0を返します。\n
*/
// ===========================================================================
extern u32 AoYsdFileGetPageOption(const void* file, u32 page_no);

// ===========================================================================
//	AoYsdFileGetLineNum
/*!
	ライン数取得

	@param file		[in] YSDファイル
	@param page_no	[in] ページ番号
	@return ライン数
	@note
	指定のYSDファイルの、指定番号のページに含まれている行数を返します。\n
	不正な引数を指定した場合は、アサートし0を返します。\n
*/
// ===========================================================================
extern u32 AoYsdFileGetLineNum(const void* file, u32 page_no);

// ===========================================================================
//	AoYsdFileGetLineId
/*!
	ラインID取得

	@param file		[in] YSDファイル
	@param page_no	[in] ページ番号
	@param line_no	[in] ライン番号
	@return ラインID
	@note
	指定のYSDファイルの、指定番号のページに含まれている指定行のIDを返します。\n
	不正な引数を指定した場合は、アサートし0を返します。\n
*/
// ===========================================================================
extern u32 AoYsdFileGetLineId(const void* file, u32 page_no, u32 line_no);

// ===========================================================================
//	AoYsdFileGetLineString
/*!
	ライン文字列取得

	@param file		[in] YSDファイル
	@param page_no	[in] ページ番号
	@param line_no	[in] ライン番号
	@return ライン文字列(null終端文字列)
	@note
	指定のYSDファイルの、
	指定番号のページに含まれている指定行の文字列を返します。\n
	不正な引数を指定した場合は、アサートし0を返します。\n
*/
// ===========================================================================
extern const char* AoYsdFileGetLineString(
	const void* file, u32 page_no, u32 line_no);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
