// ==========================================================================
/*!
  @file dbgLightEdit.h
  @brief 

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: dbgLightEdit.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef DMG_LIGHT_EDIT_H_
#define DMG_LIGHT_EDIT_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

#if defined (MTD_DEBUG)

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// DbgLightEditStateInit
/*!
 *	デバックライトエディット ステータス初期化
 *
 */
// ==========================================================================
extern void DbgLightEditStateInit(void);

// ==========================================================================
// DbgLightEditInit
/*!
 *	デバックライトエディット 初期化
 *
 */
// ==========================================================================
extern void DbgLightEditInit(void);

// ==========================================================================
// DbgLightEditExit
/*!
 *	デバックライトエディット 終了処理
 *
 */
// ==========================================================================
extern void DbgLightEditExit(void);

// ==========================================================================
// DbgLightEditIsEdit
/*!
 *	デバックライトエディット 編集中チェック
 *
 */
// ==========================================================================
extern BOOL DbgLightEditIsEdit(void);


#endif // #if defined (MTD_DEBUG)


#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // DMG_LIGHT_EDIT_H_

//----- Include Files -------------------------------------------------------
