// ==========================================================================
/*!
  @file dbgModelBuild.h
  @brief デバック用モデルビルド

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: dbgModelBuild.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef DBG_MODEL_BUILD_H_
#define DBG_MODEL_BUILD_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
#if _PC | _XBOX
// ==========================================================================
// DbgDummyInitLogo
/*!
 *	デバッグ用 モデルビルド
 */
// ==========================================================================
extern void DbgModelBuildInit(void *arg);
#endif // #if _PC | _XBOX

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // _PT_H_

//----- Include Files -------------------------------------------------------
