// ===========================================================================
/*!
	@file	dmBuyScreen.h
	@brief	製品版（完全版）購入画面モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

#if _PC || _XBOX || _PS3 || _IPHONE

// ----- Include Files ---------------------------------------（インクルード）
#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	struct DME_BUY_SCR_RESULT
// ---------------------------------------------------------------------------
//!	製品版（完全版）購入画面結果列挙
// ===========================================================================
typedef enum tag_DME_BUY_SCR_RESULT {
	DMD_BUY_SCR_RESULT_BUY		= 0,	//!< 購入した
	DMD_BUY_SCR_RESULT_CANCEL,			//!< キャンセルした

#if !_PS3
	DMD_BUY_SCR_RESULT_BACK,			//!< ゲーム終了
#endif // !_PS3

	DMD_BUY_SCR_RESULT_NUM,				//!< 結果数
	DMD_BUY_SCR_RESULT_NONE,			//!< 無効コード
} DME_BUY_SCR_RESULT;

// ----- Struct Definitions --------------------------------------（型の宣言）

// ===========================================================================
//	struct DMS_BUY_SCR_WORK
// ---------------------------------------------------------------------------
//!	製品版（完全版）購入画面ワーク
// ===========================================================================
typedef struct tag_DMS_BUY_SCR_WORK {
#if !_IPHONE
	AOS_TEXTURE			tex;			//!< テクスチャ
	BOOL				builded;		//!< テクスチャ構築済みフラグ
	void*				file;			//!< AMBファイル

#if _PS3
	AOS_TEXTURE			btn_tex;		//!< ボタンテクスチャ
	BOOL				btn_builded;	//!< ボタンテクスチャ構築済みフラグ
	void*				btn_file;		//!< ボタンAMBファイル
#endif // _PS3

	AMS_TCB*			tcb;			//!< タスクTCBポインタ
	DME_BUY_SCR_RESULT	result;			//!< 結果
#else //!_IPHONE
	void				*instance;		//<インスタンス
	DME_BUY_SCR_RESULT	result;			//!< 結果
#endif //!_IPHONE
} DMS_BUY_SCR_WORK;

// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//! 製品版（完全版）購入画面 ワーク初期化
// ===========================================================================
extern void DmBuyScreenInit(DMS_BUY_SCR_WORK* work);

// ===========================================================================
//! 製品版（完全版）購入画面 ファイル読み込み開始
// ===========================================================================
extern void DmBuyScreenLoadStart(DMS_BUY_SCR_WORK* work);

// ===========================================================================
//! 製品版（完全版）購入画面 ファイル読み込み完了判定
// ===========================================================================
extern BOOL DmBuyScreenLoadIsFinished(const DMS_BUY_SCR_WORK* work);

// ===========================================================================
//! 製品版（完全版）購入画面 テクスチャ構築開始
// ===========================================================================
extern void DmBuyScreenBuildStart(DMS_BUY_SCR_WORK* work);

// ===========================================================================
//! 製品版（完全版）購入画面 テクスチャ構築完了判定
// ===========================================================================
extern BOOL DmBuyScreenBuildIsFinished(const DMS_BUY_SCR_WORK* work);

// ===========================================================================
//! 製品版（完全版）購入画面 開始
// ===========================================================================
extern void DmBuyScreenStart(
	DMS_BUY_SCR_WORK* work, BOOL is_ui_show, BOOL is_save = FALSE);

// ===========================================================================
//! 製品版（完全版）購入画面 完了判定
// ===========================================================================
extern BOOL DmBuyScreenIsFinished(const DMS_BUY_SCR_WORK* work);

// ===========================================================================
//! 製品版（完全版）購入画面 結果取得
// ===========================================================================
extern DME_BUY_SCR_RESULT DmBuyScreenGetResult(const DMS_BUY_SCR_WORK* work);

// ===========================================================================
//! 製品版（完全版）購入画面 テクスチャ解放開始
// ===========================================================================
extern void DmBuyScreenFlushStart(DMS_BUY_SCR_WORK* work);

// ===========================================================================
//! 製品版（完全版）購入画面 テクスチャ解放完了判定
// ===========================================================================
extern BOOL DmBuyScreenFlushIsFinished(const DMS_BUY_SCR_WORK* work);

// ===========================================================================
//! 製品版（完全版）購入画面 ファイル解放
// ===========================================================================
extern void DmBuyScreenRelease(DMS_BUY_SCR_WORK* work);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

#endif // _PC || _XBOX || _PS3 || _IPHONE

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
