// ==========================================================================
/*!
  @file dmCmnBackup.h
  @brief デモ・共通バックアップモジュール

  @author Kazuki Yoshida
				Copyright(c) 2009 Dimps

  $Id: dmCmnBackup.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef DM_CMN_BACKUP_H_
#define DM_CMN_BACKUP_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// DmCmnBackupLoad
/*!
 *	データロード処理
 */
// ==========================================================================
extern void DmCmnBackupLoad(void);

// ==========================================================================
// DmCmnBackupIsLoadFinished
/*!
 *	データロードチェック処理
 *
 *	@note	内部でセーブ直後のデータと比較し、変更がある場合のみ、
 *			セーブ処理を行う。
 *	@param	is_first	[in] 初回セーブかどうか
 *	@reutrn	TRUE : 終了
 *			FALSE: セーブ中
 */
// ==========================================================================
extern BOOL DmCmnBackupIsLoadFinished(void);

// ==========================================================================
// DmCmnBackupIsLoadSuccessed
/*!
 *	データロード成功チェック処理
 *
 *	@note	ロード成功、またはロード失敗でもセーブ不要エラーの場合は
 *			成功とみなし、それ以外のタイトルへ戻す必要のある場合のみ、
 *			失敗と返すセーブ成功チェック処理
 *	@reutrn	TRUE : 成功
 *			FALSE: ロード失敗(タイトルへ遷移させる場合のエラー)
 */
// ==========================================================================
extern BOOL DmCmnBackupIsLoadSuccessed(void);

// ==========================================================================
// DmCmnBackupSave
/*!
 *	データセーブ処理
 *
 *	@note	内部でセーブ直後のデータと比較し、変更がある場合のみ、
 *			セーブ処理を行う。
 *	@param	is_first	[in] 初回セーブかどうか
 *	@param	is_new		[in] ロードなしセーブかどうか(TRUEの場合、is_firstは必ずFALSE)
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern void DmCmnBackupSave(BOOL is_first, BOOL is_new, BOOL is_del = FALSE);

// ==========================================================================
// DmCmnBackupIsSaveFinished
/*!
 *	データセーブ処理
 *
 *	@note	内部でセーブ直後のデータと比較し、変更がある場合のみ、
 *			セーブ処理を行う。
 *	@param	is_first	[in] 初回セーブかどうか
 *	@reutrn	TRUE : 終了
 *			FALSE: セーブ中
 */
// ==========================================================================
extern BOOL DmCmnBackupIsSaveFinished(void);

// ==========================================================================
// DmCmnBackupIsSaveSuccessed
/*!
 *	データセーブ処理
 *
 *	@note	セーブ成功、またはセーブ失敗でもセーブ不要エラーの場合は
 *			成功とみなし、それ以外のタイトルへ戻す必要のある場合のみ、
 *			失敗と返すセーブ成功チェック処理
 *	@reutrn	TRUE : 成功
 *			FALSE: セーブ失敗(タイトルへ遷移させる場合のエラー)
 */
// ==========================================================================
extern BOOL DmCmnBackupIsSaveSuccessed(void);



#if	defined(__cplusplus)
} /* extern "C" */
#endif


#endif // DM_CMN_BACKUP_H_

//----- Include Files -------------------------------------------------------
