// =======================================================================
/*!
	@file	dmFileSlct.h
	@brief	デモ・セーブファイル選択画面

	@author Kazuki Yoshida
				Copyright(c) 2009 Dimps
	$Id: dmFileSlct.h 2 2011-04-11 05:21:26Z thamada $
	$Date:: 2011-04-11 14:21:26 +0900#$
  
 */
// =======================================================================
/*
 *
 *
 */

#ifndef DM_FILESLCT_H_
#define DM_FILESLCT_H_

#if _WII || _PC

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

//! 外部データ構造体
typedef struct tag_DMS_FILESLCT_DATA_MGR {
	void *arc_cmn_amb[4];
} DMS_FILESLCT_DATA_MGR;


// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ==========================================================================
// DmFileSlctBuild
/*!
 *	ファイル選択データ構築
 */
// ==========================================================================
extern void DmFileSlctBuild(void *arc_amb[], DMS_FILESLCT_DATA_MGR *data_amb);


// ==========================================================================
// DmFileSlctBuildCheck
/*!
 *	ファイル選択データ構築 終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL DmFileSlctBuildCheck(void);


// ==========================================================================
// DmFileSlctFlush
/*!
 *	ファイル選択データフラッシュ
 *
 *	@reutrn	リングシステムワークアドレス
 */
// ==========================================================================
extern void DmFileSlctFlush(void);


// ==========================================================================
// DmFileSlctFlushCheck
/*!
 *	ファイル選択データフラッシュ終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL DmFileSlctFlushCheck(void);


// ==========================================================================
// DmFileSlctStart
/*!
	セーブファイル選択画面開始処理
 */
// ==========================================================================
extern void DmFileSlctStart(void* arg);



// ==========================================================================
// DmFileSlctIsExit
/*!
	セーブファイル選択画面の終了確認処理
 */
// ==========================================================================
extern s32 DmFileSlctIsExit(void);



// ==========================================================================
// DmFileSlctExit
/*!
	セーブファイル選択画面の終了処理
 */
// ==========================================================================
extern void DmFileSlctExit(void);



#endif // #if _WII || _PC

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================


#endif // DM_FILESLCT_H_

// ***************************************************************************
// ラベル
// ***************************************************************************
