// =======================================================================
/*!
	@file	dmLoading.h
	@brief	デモ・ローディング画面

	@author Kazuki Yoshida
				Copyright(c) 2009 Dimps
	$Id: dmLoading.h 2 2011-04-11 05:21:26Z thamada $
	$Date:: 2011-04-11 14:21:26 +0900#$
  
 */
// =======================================================================
/*
 *
 *
 */

#ifndef DM_LOADING_H_
#define DM_LOADING_H_



// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ==========================================================================
// DmLoadingBuild
/*!
 *	ローディング画面データ構築
 */
// ==========================================================================
extern void DmLoadingBuild(AMS_FS *arc_amb);


// ==========================================================================
// DmLoadingBuildCheck
/*!
 *	ローディング画面データ構築 終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL DmLoadingBuildCheck(void);


// ==========================================================================
// DmLoadingFlush
/*!
 *	ローディング画面データフラッシュ
 *
 *	@reutrn	リングシステムワークアドレス
 */
// ==========================================================================
extern void DmLoadingFlush(void);


// ==========================================================================
// DmLoadingFlushCheck
/*!
 *	ローディング画面データフラッシュ終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL DmLoadingFlushCheck(void);




// ==========================================================================
// DmLoadingStart
/*!
	ローディング画面開始処理
 */
// ==========================================================================
extern void DmLoadingStart(void);



// ==========================================================================
// DmLoadingIsExit
/*!
	ローディング画面の終了確認処理
 */
// ==========================================================================
extern BOOL DmLoadingIsExit(void);



// ==========================================================================
// DmLoadingExit
/*!
	ローディング画面の終了処理
 */
// ==========================================================================
extern void DmLoadingExit(void);



// ==========================================================================
// DmLoadingSetLoadComplete
/*!
	ローディング完了設定
 */
// ==========================================================================
extern void DmLoadingSetLoadComplete(void);


// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

#endif // DM_LOADING_H_

// ***************************************************************************
// ラベル
// ***************************************************************************
