// =======================================================================
/*!
	@file	dmManual.h
	@brief	デモ・オンラインマニュアル画面

	@author Kazuki Yoshida
				Copyright(c) 2009 Dimps
	$Id: dmManual.h 2 2011-04-11 05:21:26Z thamada $
	$Date:: 2011-04-11 14:21:26 +0900#$
  
 */
// =======================================================================
/*
 *
 *
 */

#ifndef DM_MANUAL_H_
#define DM_MANUAL_H_


#if _PC || _PS3 || _XBOX || _IPHONE

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ==========================================================================
// DmManualBuild
/*!
 *	オンラインマニュアル画面データ構築
 */
// ==========================================================================
extern void DmManualBuild(void *arc_amb[]);


// ==========================================================================
// DmManualBuildCheck
/*!
 *	オンラインマニュアル画面データ構築 終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL DmManualBuildCheck(void);


// ==========================================================================
// DmManualFlush
/*!
 *	オンラインマニュアル画面データフラッシュ
 *
 */
// ==========================================================================
extern void DmManualFlush(void);


// ==========================================================================
// DmManualFlushCheck
/*!
 *	オンラインマニュアル画面データフラッシュ終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL DmManualFlushCheck(void);




// ==========================================================================
// DmManualStart
/*!
	オンラインマニュアル画面開始処理
 */
// ==========================================================================
extern void DmManualStart(void);



// ==========================================================================
// DmManualIsExit
/*!
	オンラインマニュアル画面の終了確認処理
 */
// ==========================================================================
extern BOOL DmManualIsExit(void);



// ==========================================================================
// DmManualExit
/*!
	オンラインマニュアル画面の終了処理
 */
// ==========================================================================
extern void DmManualExit(void);


#endif // #if _PC || _PS3 || _XBOX || _IPHONE


// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

#endif // DM_MANUAL_H_

// ***************************************************************************
// ラベル
// ***************************************************************************
