// ============================================================================
/*!
	@file	dmMovie.hpp
	@brief	ムービー

	@author	Kouji Hokazono <kouji_hokazono@dimps.co.jp>
		Copyright(c) 2010 Dimps
	$Id: dmMovie.hpp 2 2011-04-11 05:21:26Z thamada $
 */
// ============================================================================
/*
 * $Log$
 */

/*!
	@page DmMovie ムービー

	@section DmMovieSummary 概要
		ムービーを提供します。
 */

#if _IPHONE
#pragma once

//------ Include Files -------------- インクルード -----------------------------******_IF*
//------ Debug ------------------------ デバッグ -------------------------------******_DG*
#if defined(MTD_DEBUG)
#endif	//#if defined(MTD_DEBUG)
//------ Macro ---------------------- マクロ -----------------------------------******_MC*
//------ External Definitions ------- グローバル変数及び関数の宣言 -------------******_ED*
// ============================================================================
// DmMovieInit
/*!
	ムービー・初期化

	@param	arg	[in]	引数
 */
// ============================================================================
extern void DmMovieInit(void *arg);



//------ Macro ------------------------ マクロ ---------------------------------******_MC*
namespace dm {
namespace movie {






} //namespace movie
} //namespace dm

	// ============================================================================
	// dm::movie::Init
	/*!
		関数の説明
	 
		@param	org1	[io]	引数１の説明
		@param	org2	[in]	引数２の説明
		@param	org3	[out]	引数３の説明
	 
		@return	戻り値の説明
			or
		@retval	0	正常
		@retval	!0	異常
	 
		@exception 例外

		@note
			補足説明
	 */
	// ============================================================================
#endif //_IPHONE
