// =======================================================================
/*!
	@file	dmOption.h
	@brief	デモ・オプション画面

	@author Kazuki Yoshida
				Copyright(c) 2009 Dimps
	$Id: dmOption.h 2 2011-04-11 05:21:26Z thamada $
	$Date:: 2011-04-11 14:21:26 +0900#$
  
 */
// =======================================================================
/*
 *
 *
 */

#ifndef DM_OPTION_H_
#define DM_OPTION_H_

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ==========================================================================
// DmOptionStart
/*!
	オプション画面開始処理
 */
// ==========================================================================
extern void DmOptionStart(void* arg);


// ==========================================================================
// DmOptionIsExit
/*!
	オプション画面終了チェック処理
 */
// ==========================================================================
extern BOOL DmOptionIsExit(void);


// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================


#endif // DM_OPTION_H_

// ***************************************************************************
// ラベル
// ***************************************************************************
