// ===========================================================================
/*!
	@file	dmRankSysWait.h
	@brief	ランキングシステム アクセス待ち制御モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）

#if defined(MTD_DEBUG)
//! サーバアクセス制限無効化(有効にする場合はコメントアウト)
#define DMD_RANK_SYS_WAIT_ACCESS_CTRL_DISABLE	(1)
#endif // defined(MTD_DEBUG)

// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	DmRankSysWaitInit
/*!
	初期化

	@note
	制御開始時に呼び出してください。\n
*/
// ===========================================================================
extern void DmRankSysWaitInit(void);

// ===========================================================================
//	DmRankSysWaitGetWaitTime
/*!
	アクセス待ち時間取得

	@return アクセス待ち時間(ミリ秒単位)
*/
// ===========================================================================
extern u32 DmRankSysWaitGetWaitTime(void);

// ===========================================================================
//	DmRankSysWaitNoticeTrans
/*!
	アクセス通知
*/
// ===========================================================================
extern void DmRankSysWaitNoticeTrans(void);

#if defined(MTD_DEBUG)
// ===========================================================================
//! テストイベント
// ===========================================================================
extern void DmRankSysWaitTestStart(void *arg);
#endif // defined(MTD_DEBUG)

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
