// ===========================================================================
/*!
	@file	dmRankSys.h
	@brief	ランキングシステム宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）

#define DMD_RANK_SYS_SHOW_MAX	(10)		//!< 一度に表示するランキング数
#define DMD_RANK_SYS_FRIEND_MAX	(101)		//!< フレンドランキング最大数
#define DMD_RANK_SYS_OWN_NEAR	((u32)-1)	//!< 自分周辺取得

// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	enum DME_RANK_SYS_BOARD
// ---------------------------------------------------------------------------
//!	ボード列挙
// ===========================================================================
typedef enum tag_DME_RANK_SYS_BOARD {
	DMD_RANK_SYS_BOARD_Z11		= 0,	//!< Zone1-1
	DMD_RANK_SYS_BOARD_Z12,				//!< Zone1-2
	DMD_RANK_SYS_BOARD_Z13,				//!< Zone1-3
	DMD_RANK_SYS_BOARD_Z1B,				//!< Zone1-Boss
	DMD_RANK_SYS_BOARD_Z21,				//!< Zone2-1
	DMD_RANK_SYS_BOARD_Z22,				//!< Zone2-2
	DMD_RANK_SYS_BOARD_Z23,				//!< Zone2-3
	DMD_RANK_SYS_BOARD_Z2B,				//!< Zone2-Boss
	DMD_RANK_SYS_BOARD_Z31,				//!< Zone2-1
	DMD_RANK_SYS_BOARD_Z32,				//!< Zone2-2
	DMD_RANK_SYS_BOARD_Z33,				//!< Zone2-3
	DMD_RANK_SYS_BOARD_Z3B,				//!< Zone2-Boss
	DMD_RANK_SYS_BOARD_Z41,				//!< Zone2-1
	DMD_RANK_SYS_BOARD_Z42,				//!< Zone2-2
	DMD_RANK_SYS_BOARD_Z43,				//!< Zone2-3
	DMD_RANK_SYS_BOARD_Z4B,				//!< Zone2-Boss
	DMD_RANK_SYS_BOARD_ZF,				//!< FinalZone
	DMD_RANK_SYS_BOARD_SS1,				//!< SpesialStage1
	DMD_RANK_SYS_BOARD_SS2,				//!< SpesialStage2
	DMD_RANK_SYS_BOARD_SS3,				//!< SpesialStage3
	DMD_RANK_SYS_BOARD_SS4,				//!< SpesialStage4
	DMD_RANK_SYS_BOARD_SS5,				//!< SpesialStage5
	DMD_RANK_SYS_BOARD_SS6,				//!< SpesialStage6
	DMD_RANK_SYS_BOARD_SS7,				//!< SpesialStage7

	DMD_RANK_SYS_BOARD_NUM,				//!< ボード数
	DMD_RANK_SYS_BOARD_NONE,			//!< 無効コード

	DMD_RANK_SYS_BOARD_SS_S = DMD_RANK_SYS_BOARD_SS1, //!< スペステ開始位置
} DME_RANK_SYS_BOARD;

// ===========================================================================
//	enum DME_RANK_SYS_RANK
// ---------------------------------------------------------------------------
//!	ランキングタイプ列挙
// ===========================================================================
typedef enum tag_DME_RANK_SYS_RANK {
	DMD_RANK_SYS_RANK_TIME		= 0,	//!< タイムアタック
	DMD_RANK_SYS_RANK_SCORE,			//!< スコアアタック

	DMD_RANK_SYS_RANK_NUM,				//!< ランキングタイプ数
	DMD_RANK_SYS_RANK_NONE,				//!< 無効コード
} DME_RANK_SYS_RANK;

// ===========================================================================
//	enum DME_RANK_SYS_SS
// ---------------------------------------------------------------------------
//!	スーパーソニックタイプ列挙
// ===========================================================================
typedef enum tag_DME_RANK_SYS_SS {
	DMD_RANK_SYS_SS_BOTH		= 0,	//!< 両方
	DMD_RANK_SYS_SS_DISABLE,			//!< 通常ソニックのみ
	DMD_RANK_SYS_SS_ENABLE,				//!< スーパーソニックのみ

	DMD_RANK_SYS_SS_NUM,				//!< スーパーソニックタイプ数
	DMD_RANK_SYS_SS_NONE,				//!< 無効コード
} DME_RANK_SYS_SS;

// ===========================================================================
//	enum DME_RANK_SYS_REGION
// ---------------------------------------------------------------------------
//!	リージョン列挙
// ===========================================================================
typedef enum tag_DME_RANK_SYS_REGION {
	DMD_RANK_SYS_REGION_JP		= 0,	//!< 日本
	DMD_RANK_SYS_REGION_US,				//!< 北米
	DMD_RANK_SYS_REGION_EU,				//!< 欧州
	DMD_RANK_SYS_REGION_OTHER,			//!< その他

	DMD_RANK_SYS_REGION_NUM,			//!< リージョン数
	DMD_RANK_SYS_REGION_NONE,			//!< 無効コード
} DME_RANK_SYS_REGION;

// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ***************************************************************************
// 初期化&終了処理関連
// ***************************************************************************
// ===========================================================================
//	DmRankSysInit
/*!
	ランキングシステム初期化処理

	@note
	アプリケーション起動時に一度だけ呼び出して下さい。\n
*/
// ===========================================================================
extern void DmRankSysInit(void);

// ===========================================================================
//	DmRankSysExit
/*!
	ランキングシステム終了処理

	@note
	アプリケーション終了時に一度だけ呼び出して下さい。\n
*/
// ===========================================================================
extern void DmRankSysExit(void);


// ***************************************************************************
// サーバ接続関連
// ***************************************************************************
// ===========================================================================
//	DmRankSysStart
/*!
	サーバ接続開始

	@note
	ランキングへアクセスするためのサーバ接続を開始します。\n
	接続完了判定はDmRankSysIsConnected関数で行なって下さい。\n
	また、この関数呼び出し以降は、
	定期的にDmRankSysIsError関数でエラー判定を行うようにして下さい。\n
	既にサーバ接続が開始されている場合は、アサートし何も行ないません。\n
*/
// ===========================================================================
extern void DmRankSysStart(void);

// ===========================================================================
//	DmRankSysIsSaveAfter
/*!
	サーバ接続処理中行われたセーブ処理の後か判定

	@param 真：セーブ処理の後　偽：それ以外
	@note
	サーバ接続中にセーブ処理が必要になった場合、
	セーブ処理が必要になって以降、TRUEを返すようになります。\n
*/
// ===========================================================================
extern BOOL DmRankSysIsSaveAfter(void);

// ===========================================================================
//	DmRankSysStart
/*!
	サーバ接続完了判定

	@return 真：完了済み　偽：それ以外
	@note
	DmRankSysStart関数で開始したサーバ接続処理が
	完了したかどうかを判定します。\n
	この関数がTRUEを返す状態でのみボード関連の関数を呼び出すことができます。\n
	DmRankSysStart関数が呼ばれていない状態で呼び出した場合は、
	アサートしFALSEを返します。\n
*/
// ===========================================================================
extern BOOL DmRankSysIsConnected(void);

// ===========================================================================
//	DmRankSysIsError
/*!
	エラー判定

	@return 真：エラー発生　偽：それ以外
	@note
	通信処理においてエラーが発生したかどうかを判定します。\n
	この関数がTRUEを返す場合は、ただちにDmRankSysEnd関数を呼び出し、
	通信を終了して下さい。\n
	なお、エラー関連のユーザ通知は、内部で全て行ないますので、
	呼び出し側が何らかのユーザ通知を行なう必要はありません。\n
	DmRankSysStart関数が呼び出された段階でエラーはクリアされます。\n
*/
// ===========================================================================
extern BOOL DmRankSysIsError(void);

// ===========================================================================
//	DmRankSysEnd
/*!
	サーバ接続終了開始

	@note
	DmRankSysStart関数で開始した通信処理の終了を開始します。\n
	通信処理は即時に終了しないので、
	DmRankSysIsFinished関数で終了を待つようにして下さい。\n
	既に終了済みの場合は何も行ないません。\n
*/
// ===========================================================================
extern void DmRankSysEnd(void);

// ===========================================================================
//	DmRankSysStart
/*!
	サーバ接続終了判定

	@return 真：終了済み　偽：それ以外
	@note
	全ての通信処理が終了したかどうかを判定します。\n
	DmRankSysEnd関数呼び出しから時間経過によりTRUEを返すようになります。\n
*/
// ===========================================================================
extern BOOL DmRankSysIsFinished(void);


// ***************************************************************************
// ボード関連
// ***************************************************************************
// ===========================================================================
//	DmRankSysNoticeBoard
/*!
	ボード設定

	@param board		[in] ボード
	@param rank			[in] ランキングタイプ
	@param ss			[in] スーパーソニックタイプ
	@param is_friend	[in] 真：フレンドランキング　偽：全体ランキング
	@param is_upload	[in] 真：自身の記録アップロードする　偽：しない
	@note
	表示したいボード情報を設定し、必要な通信処理を行ないます。\n
	この関数は、以下の関数がFALSEを返す状態でのみ呼び出し可能です。\n
	DmRankSysIsUpLoading\n
  	DmRankSysIsDownloading\n
*/
// ===========================================================================
extern void DmRankSysNoticeBoard(
	DME_RANK_SYS_BOARD board, DME_RANK_SYS_RANK rank, DME_RANK_SYS_SS ss,
	BOOL is_friend, BOOL is_upload);

// ===========================================================================
//	DmRankSysIsUpLoading
/*!
	自身の記録のアップロード中判定

	@return 真：アップロード中　偽：それ以外
	@note
	DmRankSysNoticeBoard関数呼出し後、必要ならアップロードを開始し、
	アップロード中は、この関数がTRUEを返します。\n
*/
// ===========================================================================
extern BOOL DmRankSysIsUpLoading(void);

// ===========================================================================
//	DmRankSysNoticeShowRankNo
/*!
	表示先頭順位通知

	@param no			[in] 表示先頭順位(0 - )
	@note
	DmRankSysNoticeBoard関数で設定したボードから
	指定の順位を先頭とする
	最大DMD_RANK_SYS_SHOW_MAX個のランキングを取得します。\n
	通信処理の完了は、
	DmRankSysIsDownloading関数で行なうようにして下さい。\n
	この関数は、以下の関数がFALSEを返す状態でのみ呼び出し可能です。\n
	DmRankSysIsUpLoading\n
	DmRankSysIsDownloading\n
	表示先頭順位にDMD_RANK_SYS_OWN_NEARを指定することで、
	自身の周辺ランキングを取得することができます。\n
*/
// ===========================================================================
extern void DmRankSysNoticeShowRankNo(u32 no);

// ===========================================================================
//	DmRankSysIsDownloading
/*!
	ランキングのダウンロード中判定

	@return 真：ダウンロード中　偽：それ以外
	@note
	DmRankSysNoticeShowRankNo関数で開始した通信処理が
	継続中かどうかを判定します。\n
*/
// ===========================================================================
extern BOOL DmRankSysIsDownloading(void);

// ===========================================================================
//	DmRankSysGetShowNum
/*!
	ランキング表示数取得

	@return ランキング表示数
	@note
	DmRankSysNoticeShowRankNo関数で取得したランキング情報が
	何人分あるかを返します。\n
	この関数はいつでも呼び出し可能です。\n
*/
// ===========================================================================
extern u32 DmRankSysGetShowNum(void);

// ===========================================================================
//	DmRankSysGetRealRankNo
/*!
	実順位取得

	@param no			[in] 表示番号(0 - )
	@return 実ランキング順位
	@note
	引数に指定する表示番号がDmRankSysGetShowNum関数の戻り値未満の値であれば
	いつでも呼び出し可能です。\n
*/
// ===========================================================================
extern u32 DmRankSysGetRealRankNo(u32 no);

// ===========================================================================
//	DmRankSysGetShowRankNo
/*!
	表示順位取得

	@param no			[in] 表示番号(0 - )
	@return 表示ランキング順位
	@note
	引数に指定する表示番号がDmRankSysGetShowNum関数の戻り値未満の値であれば
	いつでも呼び出し可能です。\n
*/
// ===========================================================================
extern u32 DmRankSysGetShowRankNo(u32 no);

// ===========================================================================
//	DmRankSysGetShowName
/*!
	表示名取得

	@param no			[in] 表示番号(0 - )
	@return 表示名
	@note
	引数に指定する表示番号がDmRankSysGetShowNum関数の戻り値未満の値であれば
	いつでも呼び出し可能です。\n
*/
// ===========================================================================
extern const char* DmRankSysGetShowName(u32 no);

// ===========================================================================
//	DmRankSysGetShowScore
/*!
	表示スコア取得

	@param no			[in] 表示番号(0 - )
	@return 表示スコア
	@note
	引数に指定する表示番号がDmRankSysGetShowNum関数の戻り値未満の値であれば
	いつでも呼び出し可能です。\n
*/
// ===========================================================================
extern u32 DmRankSysGetShowScore(u32 no);

// ===========================================================================
//	DmRankSysGetShowRegion
/*!
	表示リージョン取得

	@param no			[in] 表示番号(0 - )
	@return 表示リージョン
	@note
	引数に指定する表示番号がDmRankSysGetShowNum関数の戻り値未満の値であれば
	いつでも呼び出し可能です。\n
*/
// ===========================================================================
extern DME_RANK_SYS_REGION DmRankSysGetShowRegion(u32 no);

// ===========================================================================
//	DmRankSysGetShowRegion
/*!
	表示スーパーソニック使用有無取得

	@param no			[in] 表示番号(0 - )
	@return 真：スーパーソニック使用　偽：未使用
	@note
	引数に指定する表示番号がDmRankSysGetShowNum関数の戻り値未満の値であれば
	いつでも呼び出し可能です。\n
*/
// ===========================================================================
extern BOOL DmRankSysGetShowSs(u32 no);

// ===========================================================================
//	DmRankSysIsShowOwn
/*!
	自身の記録判定

	@param no			[in] 表示番号(0 - )
	@return 真：自身の記録　偽：それ以外
	@note
	引数に指定する表示番号がDmRankSysGetShowNum関数の戻り値未満の値であれば
	いつでも呼び出し可能です。\n
*/
// ===========================================================================
extern BOOL DmRankSysIsShowOwn(u32 no);

// ===========================================================================
//	DmRankSysIsCancelable
/*!
	通信処理のキャンセル可能判定

	@return 真：キャンセル可能　偽：不可能
	@note
	以下の関数がTRUEを返す状態で、
	通信処理のキャンセルが可能かどうかを判定します。\n
	DmRankSysIsUpLoading\n
	DmRankSysIsDownloading\n
	注意：Wii版以外では、常にFALSEを返します。\n
*/
// ===========================================================================
extern BOOL DmRankSysIsCancelable(void);

// ===========================================================================
//	DmRankSysNoticeCancel
/*!
	通信処理のキャンセル通知

	@note
	以下の関数がTRUEを返す状態で、通信処理のキャンセルを行ないます。\n
	DmRankSysIsUpLoading\n
	DmRankSysIsDownloading\n
	キャンセルを行なうと、上記関数はFALSEを返すようになります。\n
	この関数はDmRankSysIsCancelable関数がTRUEを返す状態でのみ
	呼び出し可能です。\n
*/
// ===========================================================================
extern void DmRankSysNoticeCancel(void);

#if _XBOX

// ===========================================================================
//	DmRankSysGamerCardShow
/*!
	ゲーマーカード表示開始

	@param no			[in] 表示番号(0 - )
	@note
	Xbox360版にて、指定番号のユーザのゲーマーカードUIを表示します。\n
	表示の終了はDmRankSysCamerCardShowIsFinished関数で判定して下さい。\n
*/
// ===========================================================================
extern void DmRankSysGamerCardShow(u32 no);

// ===========================================================================
//	DmRankSysCamerCardShowIsFinished
/*!
	ゲーマーカード表示完了判定

	@return 真：終了済み　偽：それ以外
	@note
	Xbox360版にて、DmRankSysGamerCardShow関数で開始したゲーマーカードUI表示が
	終了したか判定します。\n
	DmRankSysGamerCardShow関数を呼び出していない場合は、TRUEを返します。\n
*/
// ===========================================================================
extern BOOL DmRankSysCamerCardShowIsFinished(void);

#endif


// ***************************************************************************
// ユーティリティ
// ***************************************************************************
// ===========================================================================
//	DmRankSysOwnRecodeIsUpdate
/*!
	自身の記録の更新判定

	@param board		[in] ボード
	@return 真：更新されている　偽：更新されていない
*/
// ===========================================================================
extern BOOL DmRankSysOwnRecodeIsUpdate(DME_RANK_SYS_BOARD board);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
