// =======================================================================
/*!
	@file	dmSave.h
	@brief	デモ・セーブ画面

	@author Kazuki Yoshida
				Copyright(c) 2009 Dimps
	$Id: dmSave.h 2 2011-04-11 05:21:26Z thamada $
	$Date:: 2011-04-11 14:21:26 +0900#$
  
 */
// =======================================================================
/*
 *
 *
 */

#ifndef DM_SAVE_H_
#define DM_SAVE_H_

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
//! ウインドウ表示パターンタイプ
typedef enum tag_DME_SAVE_WIN
{
	DME_SAVE_WIN_DATA_LOADING = 0,	//!< ロード処理(現状、タイトルのみで行う)
	DME_SAVE_WIN_ATTENTION_SAVE,	//!< 予備
	DME_SAVE_WIN_NOW_SAVING,		//!< セーブ処理(製品版で汎用的に使うタイプ)
	DME_SAVE_WIN_TRIAL_OUT_SAVE,	//!< 体験版から製品版へ切り替わった際のセーブ処理
	
	DME_SAVE_WIN_NUM,
	DME_SAVE_WIN_NONE
} DME_SAVE_WIN;

// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ==========================================================================
// DmSaveStart
/*!
	セーブ開始処理
  	
	disp_flag : 表示させたいメッセージ(処理含む)のIDをフラグにして引数に設定
  	is_first_save : 初期セーブかどうか(セーブ以外では未使用)
 */
// ==========================================================================
extern void DmSaveStart(u32 disp_flag, BOOL is_first_save, BOOL is_task_draw = FALSE);

// ==========================================================================
// DmSaveAttenMsgStart
/*!
	注意事項メッセージ開始処理
 */
// ==========================================================================
extern void DmSaveAttenMsgStart();

// ==========================================================================
// DmSaveMenuStart
/*!
	メニュ汎用セーブ開始処理
  	※各メニューでセーブを行う場合はこちらを使用してください。
 */
// ==========================================================================
extern void DmSaveMenuStart(BOOL is_task_draw = FALSE, BOOL is_snd_build = FALSE);

// ==========================================================================
// DmSaveIsExit
/*!
	セーブ終了チェック処理
 */
// ==========================================================================
extern BOOL DmSaveIsExit(void);

// ==========================================================================
// DmSaveIsDraw
/*!
	セーブウインドウ描画チェック処理
 */
// ==========================================================================
extern BOOL DmSaveIsDraw(void);

// ==========================================================================
// DmSaveWinSelectDraw
/*!
	ウインドウ用描画設定処理
 */
// ==========================================================================
extern void DmSaveWinSelectDraw(void);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================


#endif // DM_SAVE_H_

// ***************************************************************************
// ラベル
// ***************************************************************************
