// ==========================================================================
/*!
	@file	dmSndBgmPlayer.h
	@brief	デモ・BGMプレイヤーモジュール

	@author	Kazuki Yoshida
				Copyright(c) 2009 Dimps
	$Id: dmSndBgmPlayer.h 2 2011-04-11 05:21:26Z thamada $
	$Date::						   $
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef DM_SND_BGM_PLAYER_H_
#define DM_SND_BGM_PLAYER_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//! BGMインデックス列挙型
typedef enum
{
	DME_SND_BGM_PLAYER_IDX_MENU = 0,
	DME_SND_BGM_PLAYER_IDX_TITLE,
	
	DME_SND_BGM_PLAYER_IDX_MAX
} DME_SND_BGM_PLAYER_IDX;


//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// データ構築
// ==========================================================================
// ==========================================================================
// DmSndBgmPlayerInit
/*!
 *	ゲームサウンド初期化
 */
// ==========================================================================
extern void DmSndBgmPlayerInit(void);

// ==========================================================================
// DmSndBgmPlayerExit
/*!
 *	ゲームサウンド終了処理
 */
// ==========================================================================
extern void DmSndBgmPlayerExit(void);

// ==========================================================================
// DmSndBgmPlayerBgmStop
/*!
 *	ゲームサウンド停止処理
 */
// ==========================================================================
extern void DmSndBgmPlayerBgmStop(void);

// ==========================================================================
// DmSndBgmPlayerIsTaskExit
/*!
 *	ゲームサウンド終了チェック
 */
// ==========================================================================
extern BOOL DmSndBgmPlayerIsTaskExit(void);

// ==========================================================================
// DmSndBgmPlayerIsSndSysBuild
/*!
 *	ゲームサウンド構築終了チェック
 */
// ==========================================================================
extern BOOL DmSndBgmPlayerIsSndSysBuild(void);

// ==========================================================================
// DmSndBgmPlayerPlayBgm
/*!
 *	ゲームサウンド再生
 */
// ==========================================================================
extern void DmSndBgmPlayerPlayBgm(DME_SND_BGM_PLAYER_IDX idx);


#if	defined(__cplusplus)
} /* extern "C" */
#endif


#endif // DM_SND_BGM_PLAYER_H_

//----- Include Files -------------------------------------------------------
