// ==========================================================================
/*!
	@file	dmSound.h
	@brief	デモ・サウンドモジュール

	@author	Kazuki Yoshida
				Copyright(c) 2009 Dimps
	$Id: dmSound.h 2 2011-04-11 05:21:26Z thamada $
	$Date::						   $
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef DM_SOUND_H_
#define DM_SOUND_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------
// 暫定◆
#define dmSoundPlayBgm(a, b)

//! BGMインデックス列挙型
typedef enum
{
	DME_SOUND_BGM_IDX_MENU = 0,
	
	DME_SOUND_BGM_IDX_MAX
} DME_SOUND_BGM_IDX;


//! ジングルインデックス列挙型
typedef enum
{
	DME_SOUND_JINGLE_IDX_TITLE = 0,
	
	DME_SOUND_JINGLE_IDX_MAX
} DME_SOUND_JINGLE_IDX;

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// データ構築
// ==========================================================================
// ==========================================================================
// DmSoundBuild
/*!
 *	ゲームサウンド 構築
 */
// ==========================================================================
extern void DmSoundBuild(void);

// ==========================================================================
// DmSoundBuildCheck
/*!
 *	サウンドデータ構築 終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL DmSoundBuildCheck(void);

// ==========================================================================
// DmSoundFlush
/*!
 *	ゲームサウンド 片付け
 */
// ==========================================================================
extern void DmSoundFlush(void);

// ==========================================================================
// DmSoundInit
/*!
 *	ゲームサウンド初期化
 */
// ==========================================================================
extern void DmSoundInit(void);

// ==========================================================================
// DmSoundExit
/*!
 *	ゲームサウンド終了処理
 */
// ==========================================================================
extern void DmSoundExit(void);

// ==========================================================================
// SE再生
// ==========================================================================
// ==========================================================================
// DmSoundPlaySE
/*!
 *	SE再生
 *
 *	@param	cue_name	[in]	再生するSEのキュー名
 *
 */
// ==========================================================================
extern void DmSoundPlaySE(char *cue_name);

// ==========================================================================
// BGM
// ==========================================================================
// =======================================================================
// DmSoundPlayBGM
/*!
  BGM再生
  
  @param cue_name		[in]	再生するSEのキュー名
  @param fade_farame	[in]	フェードインにかけるフレーム数
  
  @note
  この関数は互換性のために残しています。
  代わりにDmSoundPlayStageBGM()を使用してください。
 */
// =======================================================================
extern void DmSoundPlayBGM(const char *cue_name, Sint32 fade_frame=0);

// =======================================================================
// DmSoundPlayMenuBGM
/*!
  メニューBGM再生
  
  @param fade_frame	[in]	フェードインにかけるフレーム数
  
  @note
  メニューBGMを再生します。
 */
// =======================================================================
extern void DmSoundPlayMenuBGM(DME_SOUND_BGM_IDX idx, Sint32 fade_frame=0);

// =======================================================================
// DmSoundStopBGM
/*!
  BGM停止
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
  
  @note
  この関数は互換性のために残しています。
  代わりにDmSoundStopStageBGM()を使用してください。
 */
// =======================================================================
extern void DmSoundStopBGM(Sint32 fade_frame=0);

// =======================================================================
// DmSoundStopStageBGM
/*!
  ステージBGM停止
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
 */
// =======================================================================
extern void DmSoundStopStageBGM(Sint32 fade_frame=0);

// =======================================================================
// DmSoundPauseStageBGM
/*!
  ステージBGM一時停止
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
 */
// =======================================================================
extern void DmSoundPauseStageBGM(Sint32 fade_frame=0);

// =======================================================================
// DmSoundResumeStageBGM
/*!
  ステージBGM再開
  
  @param fade_frame	[in]	フェードインにかけるフレーム数
 */
// =======================================================================
extern void DmSoundResumeStageBGM(Sint32 fade_frame=0);


// ==========================================================================
// ジングル
// ==========================================================================
// =======================================================================
// DmSoundPlayJingle
/*!
  ジングル再生
  
  @param jngl_idx	[in]	ジングルインデックス（DME_SOUND_JINGLE_IDX_XXX）
  @param fade_frame	[in]	フェードインにかけるフレーム数
 */
// =======================================================================
extern void DmSoundPlayJingle(DME_SOUND_JINGLE_IDX jngl_idx, Sint32 fade_frame=0);

// =======================================================================
// DmSoundStopJingle
/*!
  ジングル停止
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
 */
// =======================================================================
extern void DmSoundStopJingle(Sint32 fade_frame=0);

// ==========================================================================
// ボリューム設定
// ==========================================================================
// =======================================================================
// DmSoundSetVolumeSE
/*!
  SEボリューム設定
  
  @param volume	[in]	ボリューム（倍率）
  
  @note
  SE全体のボリュームを設定します。
 */
// =======================================================================
extern void DmSoundSetVolumeSE(Float volume);

// =======================================================================
// DmSoundSetVolumeBGM
/*!
  BGMボリューム設定
  
  @param volume	[in]	ボリューム（倍率）
  
  @note
  BGM全体のボリュームを設定します（ジングルも含む）。
 */
// =======================================================================
extern void DmSoundSetVolumeBGM(Float volume);

// =======================================================================
// DmSoundIsStopStageBGM
/*!
  ステージBGM停止チェック
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
 */
// =======================================================================
extern BOOL DmSoundIsStopStageBGM(void);

// =======================================================================
// DmSoundIsStopJingle
/*!
  ジングル停止チェック
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
 */
// =======================================================================
extern BOOL DmSoundIsStopJingle(void);


#if	defined(__cplusplus)
} /* extern "C" */
#endif


#endif // DM_SOUND_H_

//----- Include Files -------------------------------------------------------
