// =======================================================================
/*!
	@file	dmStaffRoll.h
	@brief	デモ・スタッフロール画面

	@author Kazuki Yoshida
				Copyright(c) 2009 Dimps
	$Id: dmStaffRoll.h 2 2011-04-11 05:21:26Z thamada $
	$Date:: 2011-04-11 14:21:26 +0900#$
  
 */
// =======================================================================
/*
 *
 *
 */

#ifndef DM_STFRL_H_
#define DM_STFRL_H_



// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）

typedef enum tag_DME_STFRL_3D_DATA_TYPE
{
	DME_STFRL_3D_DATA_TYPE_SONIC = 0,	//!< ソニック
	DME_STFRL_3D_DATA_TYPE_EGGMAN,		//!< エッグマン
	DME_STFRL_3D_DATA_TYPE_RING,		//!< リング
	
	DME_STFRL_3D_DATA_TYPE_NUM,
	DME_STFRL_3D_DATA_TYPE_NONE
} DME_STFRL_3D_DATA_TYPE;


//! ファイルデータ構造体
typedef struct tag_DMS_STFRL_FS_DATA_MGR {
	void *arc_list_font_amb_fs;	// スタッフリスト用フォントデータAMB
	void *arc_scr_amb_fs;			// 一度に保存しておく分のスクリーンアクションAMB
	void *arc_end_amb_fs;		// フルバージョン時の共通アクション(ENDテキストなど)
	void *arc_end_jp_amb_fs;		// フルバージョン時の共通アクション(ENDテキストなど)
	
	void *arc_cmn_amb_fs[2];		// メニュー共通データ
	
	AMS_FS *staff_list_fs;			// スタッフ名簿リストYSDファイル
	
} DMS_STFRL_FS_DATA_MGR;


//! データ構造体
typedef struct tag_DMS_STFRL_DATA_MGR {
	// スタッフロール用AMB
	void *arc_font_amb;			// フォントデータ
	void *arc_scr_amb;			// スクリーンキャプチャ
	void *arc_end_amb;		// エンド画面用アクション(ENDやウインドウメッセージなど)
	void *arc_end_jp_amb;		// エンド画面用アクション(ENDやウインドウメッセージなど)
	
	// メニュー共通データAMB
	void *arc_cmn_amb[2];		// メニュー共通
	
	void *stf_list_ysd;
	
} DMS_STFRL_DATA_MGR;


#if defined(MTD_DEBUG)
extern BOOL dm_stfrl_is_full_disp_efct;
#endif


// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ==========================================================================
// DmStaffRollBuildForGame
/*!
 *	スタッフロールデータ構築(メインゲームから呼び出す専用)
 */
// ==========================================================================
extern void DmStaffRollBuildForGame(void);

// ==========================================================================
// DmStaffRollBuild
/*!
 *	スタッフロール画面データ構築
 */
// ==========================================================================
extern void DmStaffRollBuild(DMS_STFRL_DATA_MGR *data_mgr);


// ==========================================================================
// DmStaffRollBuildCheck
/*!
 *	スタッフロール画面データ構築 終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL DmStaffRollBuildCheck(void);


// ==========================================================================
// DmStaffRollFlush
/*!
 *	スタッフロール画面データフラッシュ
 *
 *	@reutrn	リングシステムワークアドレス
 */
// ==========================================================================
extern void DmStaffRollFlush(void);


// ==========================================================================
// DmStaffRollFlushCheck
/*!
 *	スタッフロール画面データフラッシュ終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL DmStaffRollFlushCheck(void);




// ==========================================================================
// DmStaffRollStart
/*!
	スタッフロール画面開始処理
 */
// ==========================================================================
extern void DmStaffRollStart(void *arg);



// ==========================================================================
// DmStaffRollIsExit
/*!
	スタッフロール画面の終了確認処理
 */
// ==========================================================================
extern BOOL DmStaffRollIsExit(void);



// ==========================================================================
// DmStaffRollExit
/*!
	スタッフロール画面の終了処理
 */
// ==========================================================================
extern void DmStaffRollExit(void);



// ==========================================================================
// DmStaffRollSetLoadComplete
/*!
	スタッフロール完了設定
 */
// ==========================================================================
extern void DmStaffRollSetLoadComplete(void);


// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

#endif // DM_STFRL_H_

// ***************************************************************************
// ラベル
// ***************************************************************************
