// =======================================================================
/*!
	@file	dmUserName.h
	@brief	デモ・ユーザー名設定画面

	@author Kazuki Yoshida
				Copyright(c) 2009 Dimps
	$Id: dmUserName.h 2 2011-04-11 05:21:26Z thamada $
	$Date:: 2011-04-11 14:21:26 +0900#$
  
 */
// =======================================================================
/*
 *
 *
 */

#ifndef DM_USERNAME_H_
#define DM_USERNAME_H_


#if _PC || _WII


// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ==========================================================================
// DmUserNameBuild
/*!
 *	ユーザー名設定データ構築
 */
// ==========================================================================
extern void DmUserNameBuild(void *arc_amb[]);


// ==========================================================================
// DmUserNameBuildCheck
/*!
 *	ユーザー名設定データ構築 終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL DmUserNameBuildCheck(void);


// ==========================================================================
// DmUserNameSetMenuCmnAmaData
/*!
 *	ユーザー名設定画面にメニュー共通AMAデータ設定
  	(構築済みデータをポインタのみ取得)
 */
// ==========================================================================
extern void DmUserNameSetMenuCmnAmaData(void *btn_ama, void *win_ama, void *tex_ama);


// ==========================================================================
// DmUserNameSetMenuCmnAmbData
/*!
 *	ユーザー名設定画面にメニュー共通AMBデータ設定
  	(構築済みデータをポインタのみ取得)
 */
// ==========================================================================
extern void DmUserNameSetMenuCmnAmbData(void *btn_amb, void *win_amb, void *tex_amb);


// ==========================================================================
// DmUserNameSetMenuCmnTexData
/*!
 *	ユーザー名設定画面にメニュー共通TEXデータ設定
  	(構築済みデータをポインタのみ取得)
 */
// ==========================================================================
extern void DmUserNameSetMenuCmnTexData(AOS_TEXTURE *btn_tex, AOS_TEXTURE *win_tex, AOS_TEXTURE *tex_tex);


// ==========================================================================
// DmUserNameFlush
/*!
 *	ユーザー名設定データフラッシュ
 */
// ==========================================================================
extern void DmUserNameFlush(void);


// ==========================================================================
// DmUserNameFlushCheck
/*!
 *	ユーザー名設定データフラッシュ終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL DmUserNameFlushCheck(void);


// ==========================================================================
// DmUserNameStart
/*!
	ユーザー名設定画面開始処理
 */
// ==========================================================================
extern void DmUserNameStart(void);


// ==========================================================================
// DmUserNameIsExit
/*!
	ユーザー名設定画面の終了確認処理
 */
// ==========================================================================
extern s32 DmUserNameIsExit(void);


// ==========================================================================
// DmUserNameExit
/*!
	ユーザー名設定画面の終了処理
 */
// ==========================================================================
extern void DmUserNameExit(void);


// ==========================================================================
// DmUserNameGetUserLangAma
/*!
	ユーザー名設定画面の言語別AMAデータ取得
  	(帯文を外部で使用するため)
 */
// ==========================================================================
extern void *DmUserNameGetUserAma(void);


// ==========================================================================
// DmUserNameGetUserLangTex
/*!
	ユーザー名設定画面の言語別TEXデータ取得
  	(帯文を外部で使用するため)
 */
// ==========================================================================
extern AOS_TEXTURE *DmUserNameGetUserLangTex(void);


// ==========================================================================
// DmUserNameIsMsgWinOpen
/*!
	ユーザー名設定画面のメッセージウインドウが開いているかどうか
 */
// ==========================================================================
extern BOOL DmUserNameIsMsgWinOpen(void);


// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

#endif // #if _PC || _WII

#endif // DM_USERNAME_H_

// ***************************************************************************
// ラベル
// ***************************************************************************
