// ============================================================================
/*!
	@file	erDbgStartWeb.cpp
	@brief	テストイベント・WEB開始

	@author	Kouji Hokazono <kouji_hokazono@dimps.co.jp>
		Copyright(c) 2010 Dimps
	$Id: erDbgStartWeb.cpp 193 2011-05-27 07:34:33Z thamada $
 */
// ============================================================================
/*
 * $Log$
 */

//------ Include ---------------------- インクルード ---------------------------******_IC*
#include "pch.h"
#include "erWeb.hpp"
#include "erDbgStartWeb.hpp"

#if _DEBUG

#if _WII
#pragma warn_notinlined off	//インライン展開出来無い関数に対する警告メッセージの無効化
#endif //_WII


//------ Debug ------------------------ デバッグ -------------------------------******_DG*
#if defined(MTD_DEBUG)
#endif	//#if defined(MTD_DEBUG)
//------ Macro ------------------------ マクロ ---------------------------------******_MC*
//------ C Global Functions ----------- C グローバル関数の定義 -------------------******CGF*
//------ C Global Functions ----------- C グローバル関数の定義 -------------------******CGF*
namespace er {
namespace dbg {



//------ Class ------------------------ クラス ---------------------------------******_CL*
//■//-- Local Constant --------------- ローカル定数 ---------------------------******LCS*
//■//-- Public Constant -------------- 公開定数 -------------------------------******PCS*
//■//-- Public Function -------------- 公開関数 -------------------------------******PFC*
// ============================================================================
// CStartWeb::Enter
/*!
	決定された時に実行される関数
 */
// ============================================================================
void CStartWeb::Enter()
{
}

// ============================================================================
// CStartWeb::Focus
/*!
	選択されている時に実行される関数
 */
// ============================================================================
void CStartWeb::Focus()
{
	m_rect.Update();
	proc_type::operator()();
}


//■//-- Get Function ----------------- 取得関数 -------------------------------******PGF*
//■//-- Set Function ----------------- 設定関数 -------------------------------******PSF*
//■//-- Constructor And Destructor --- コンストラクタ・デストラクタ------------******_CD*
//■//-- Local Function --------------- ローカル関数 ---------------------------******LFC*
// ============================================================================
// CStartWeb::clear
/*!
	クリア
 */
// ============================================================================
void CStartWeb::clear()
{
}

// ============================================================================
// CStartWeb::init
/*!
	初期化
 */
// ============================================================================
void CStartWeb::init()
{
	 SetProc(&CStartWeb::start);

	 m_rect.Create(0, 0, static_cast<Sint32>(AMD_SCREEN_2D_WIDTH), static_cast<Sint32>(AMD_SCREEN_2D_HEIGHT));
	 m_rect.SetDoubleClickTime(10);
}

// ============================================================================
// CStartWeb::start
/*!
	プロシージャ
 */
// ============================================================================
void CStartWeb::start()
{
	int x = 3;
	int y = 12;
	EColor::Type clr = EColor::White;

	Printc(x, y++, clr, "Double tap: Start");
	
	if (m_rect.GetState()[er::CTrgState::EState::DoubleClick]) {
		er::web::StartWeb("http://sega.com/apps");
	}
}


//------------------------------------------------------------------------------**********

































} //namespace dbg
} //namespace er

#endif // #if _DEBUG

// =============================================================================
// Function
/*!
	関数の説明

	@param	org1	[io]	引数１の説明
	@param	org2	[in]	引数２の説明
	@param	org3	[out]	引数３の説明

	@return	戻り値の説明
		or
	@retval	0	正常
	@retval	!0	異常

	@exception 例外
 
	@note
		補足説明
 */
// ==========================================================================
