// ============================================================================
/*!
	@file	erMovie.hpp
	@brief	ムービー

	@author	Kouji Hokazono <kouji_hokazono@dimps.co.jp>
		Copyright(c) 2010 Dimps
	$Id: erMovie.hpp 2 2011-04-11 05:21:26Z thamada $
 */
// ============================================================================
/*
 * $Log$
 */

/*!
	@page erMovieMain ムービー

	@section erMovieSummary 概要
		ムービープレイヤーを提供します。
 */

#pragma once
#if	defined(__cplusplus)
extern "C" {
#endif

//------ C Include Files -------------- インクルード ---------------------------******CIF*
//------ C Macro ---------------------- マクロ ---------------------------------******CMC*
//------ C External Definitions ------- グローバル変数及び関数の宣言 -----------******CED*


#if	defined(__cplusplus)
} // extern "C"
#endif

#if	defined(__cplusplus)
//------ Include ---------------------- インクルード ---------------------------******_IC*
#include "accelBitset.hpp"


//------ Debug ------------------------ デバッグ -------------------------------******_DG*
#if defined(MTD_DEBUG)
#endif	//#if defined(MTD_DEBUG)
//------ Macro ------------------------ マクロ ---------------------------------******_MC*
namespace er {
namespace movie {



//------ Class ------------------------ クラス ---------------------------------******_CL*
/*!	@class
	@brief	プレイヤークラス
		iPhoneのメディアプレイヤー機能を提供します。
 */
class CPlayer {
	//-- Enum Hack -------------------- 定数宣言 -------------------------------******_EH*
protected:
private:
	//-- Public Constant -------------- 公開定数 -------------------------------******PCS*
public:
	//-- Public Variable -------------- 公開変数 -------------------------------******PVA*
	//-- Public Function -------------- 公開関数 -------------------------------******PFC*
	// ============================================================================
	// CPlayer::CreateInstance
	/*!
		作成
	 */
	// ============================================================================
	static CPlayer &CreateInstance();

	// =============================================================================
	// CPlayer::Create
	/*!
		構築

		@param	path		[in]	ファイルパス
		@param	base_dir	[in]	ベースディレクトリ(NULL可)

		@retval	true	成功
		@retval	false	失敗

		@note
			失敗しません。
	 */
	// =============================================================================
	bool Create(const char *path, const char *base_dir = NULL);

	// =============================================================================
	// CPlayer::Release
	/*!
		破棄
	 */
	// =============================================================================
	void Release();

	// =============================================================================
	// CPlayer::Play
	/*!
		再生
	 */
	// =============================================================================
	void Play();

	// =============================================================================
	// CPlayer::Stop
	/*!
		停止
	 */
	// =============================================================================
	void Stop();


	//-- Geter Function --------------- 取得関数 -------------------------------******PGF*
	// =============================================================================
	// CPlayer::IsValid
	/*!
		有効確認
	
		@retval	true	有効
		@retval	false	無効
	 */
	// =============================================================================
	bool IsValid() const;

	// =============================================================================
	// CPlayer::IsPlay
	/*!
		再生確認
	
		@retval	true	再生中
		@retval	false	再生中では無い
	 */
	// =============================================================================
	bool IsPlay() const;


	//-- Seter Function --------------- 設定関数 -------------------------------******PSF*
	//-- Constructor And Destructor --- コンストラクタ・デストラクタ------------******_CD*
	// ============================================================================
	// CPlayer::CPlayer
	/*!
		デフォルトコンストラクタ
	 */
	// ============================================================================
public:
	CPlayer();


	// ============================================================================
	// CPlayer::~CPlayer
	/*!
		デストラクタ
	 */
	// ============================================================================
public:
	virtual ~CPlayer();


	//-- Local Constant --------------- ローカル定数 ---------------------------******LCS*
protected:
private:
	struct BFlag {
		enum {
			Setup,

			Max,
			None,
		};
		typedef accel::CBitset<Max> Type;
	};


	//-- Local Variable --------------- ローカル変数 ---------------------------******LVA*
protected:
private:
	BFlag::Type		m_flag;			//<フラグ
	void			*m_delegate;	//<移譲先
	
	static CPlayer	*p_instance;	//<共通インスタンス


	//-- Local Function --------------- ローカル関数 ---------------------------******LFC*
protected:
private:
//------------------------------------------------------------------------------**********
}; //class CPlayer















} //namespace movie
} //namespace er
#endif //#if	defined(__cplusplus)

	// ============================================================================
	// CShape::Function
	/*!
		関数の説明
	 
		@param	org1	[io]	引数１の説明
		@param	org2	[in]	引数２の説明
		@param	org3	[out]	引数３の説明
	 
		@return	戻り値の説明
			or
		@retval	0	正常
		@retval	!0	異常
	 
		@exception 例外

		@note
			補足説明
	 */
	// ============================================================================
