// ============================================================================
/*!
	@file	erObject.hpp
	@brief	オブジェクトインターフェース

	@author	Kouji Hokazono <kouji_hokazono@dimps.co.jp>
		Copyright(c) 2009 Dimps
	$Id: erObject.hpp 2 2011-04-11 05:21:26Z thamada $
 */
// ============================================================================
/*
 * $Log$
 */

/*!
	@page erObjectMain オブジェクトインターフェース

	@section erObjectSummary 概要
		オブジェクトインターフェースを提供します。
 */

#pragma once
#if	defined(__cplusplus)
extern "C" {
#endif

//------ C Include Files -------------- インクルード ---------------------------******CIF*
//------ C Macro ---------------------- マクロ ---------------------------------******CMC*
//------ C External Definitions ------- グローバル変数及び関数の宣言 -----------******CED*


#if	defined(__cplusplus)
} // extern "C"
#endif

#if	defined(__cplusplus)
//------ Include ---------------------- インクルード ---------------------------******_IC*
//------ Debug ------------------------ デバッグ -------------------------------******_DG*
#if defined(MTD_DEBUG)
#endif	//#if defined(MTD_DEBUG)
//------ Macro ------------------------ マクロ ---------------------------------******_MC*
namespace er {
namespace object {









//------ Class ------------------------ クラス ---------------------------------******_CL*
/*!	@class
	@brief	オブジェクト根底インターフェース
		全てのオブジェクトはこのインターフェースから派生する。
 */
class IObject {
	//-- Enum Hack -------------------- 定数宣言 -------------------------------******_EH*
protected:
private:
	//-- Public Constant -------------- 公開定数 -------------------------------******PCS*
public:
	//-- Public Variable -------------- 公開変数 -------------------------------******PVA*
	//-- Public Function -------------- 公開関数 -------------------------------******PFC*
	//-- Geter Function --------------- 取得関数 -------------------------------******PGF*
	//-- Seter Function --------------- 設定関数 -------------------------------******PSF*
	//-- Constructor And Destructor --- コンストラクタ・デストラクタ------------******_CD*
	// ============================================================================
	// IObject::~IObject
	/*!
		デストラクタ
	 */
	// ============================================================================
public:
	virtual ~IObject() {};


	//-- Local Constant --------------- ローカル定数 ---------------------------******LCS*
protected:
private:
	//-- Local Variable --------------- ローカル変数 ---------------------------******LVA*
protected:
private:
	//-- Local Function --------------- ローカル関数 ---------------------------******LFC*
protected:
private:
//------------------------------------------------------------------------------**********
}; //class IObject


























































//------ Class ------------------------ クラス ---------------------------------******_CL*
/*!	@class
	@brief	オブジェクト破棄インターフェース
		破棄関数を持つオブジェクトはこのインターフェースから派生する。
 */
class IRelease : public virtual IObject {
	//-- Enum Hack -------------------- 定数宣言 -------------------------------******_EH*
protected:
private:
	//-- Public Constant -------------- 公開定数 -------------------------------******PCS*
public:
	//-- Public Variable -------------- 公開変数 -------------------------------******PVA*
	//-- Public Function -------------- 公開関数 -------------------------------******PFC*
	// =============================================================================
	// IRelease::Create
	/*!
		作成
	
		@retval	true	成功
		@retval	false	失敗

		@note
			引数が不定と成るので、純粋仮想関数の定義は行わない
	 */
	// ==========================================================================
	//virtual bool Create() = 0;

	// =============================================================================
	// IRelease::Release
	/*!
		破棄
	 */
	// ==========================================================================
	virtual void Release() = 0;


	//-- Geter Function --------------- 取得関数 -------------------------------******PGF*
	//-- Seter Function --------------- 設定関数 -------------------------------******PSF*
	//-- Constructor And Destructor --- コンストラクタ・デストラクタ------------******_CD*
	// ============================================================================
	// IRelease::~IRelease
	/*!
		デストラクタ
	 */
	// ============================================================================
public:
	virtual ~IRelease() {};


	//-- Local Constant --------------- ローカル定数 ---------------------------******LCS*
protected:
private:
	//-- Local Variable --------------- ローカル変数 ---------------------------******LVA*
protected:
private:
	//-- Local Function --------------- ローカル関数 ---------------------------******LFC*
protected:
private:
//------------------------------------------------------------------------------**********
}; //class IRelease


























































//------ Class ------------------------ クラス ---------------------------------******_CL*
/*!	@class
	@brief	オブジェクト有効確認インターフェース
		有効確認関数を持つオブジェクトはこのインターフェースから派生する。
 */
class IIsValid : public virtual IObject {
	//-- Enum Hack -------------------- 定数宣言 -------------------------------******_EH*
protected:
private:
	//-- Public Constant -------------- 公開定数 -------------------------------******PCS*
public:
	//-- Public Variable -------------- 公開変数 -------------------------------******PVA*
	//-- Public Function -------------- 公開関数 -------------------------------******PFC*
	// =============================================================================
	// IIsValid::IsValid
	/*!
		有効確認
	
		@retval	true	有効
		@retval	false	無効
	 */
	// ==========================================================================
	virtual bool IsValid() const = 0;


	//-- Geter Function --------------- 取得関数 -------------------------------******PGF*
	//-- Seter Function --------------- 設定関数 -------------------------------******PSF*
	//-- Constructor And Destructor --- コンストラクタ・デストラクタ------------******_CD*
	// ============================================================================
	// IIsValid::~IIsValid
	/*!
		デストラクタ
	 */
	// ============================================================================
public:
	virtual ~IIsValid() {};


	//-- Local Constant --------------- ローカル定数 ---------------------------******LCS*
protected:
private:
	//-- Local Variable --------------- ローカル変数 ---------------------------******LVA*
protected:
private:
	//-- Local Function --------------- ローカル関数 ---------------------------******LFC*
protected:
private:
//------------------------------------------------------------------------------**********
}; //class IIsValid


























































//------ Class ------------------------ クラス ---------------------------------******_CL*
/*!	@class
	@brief	オブジェクト前更新インターフェース
		前更新関数を持つオブジェクトはこのインターフェースから派生する。
 */
class IPreUpdate : public virtual IObject {
	//-- Enum Hack -------------------- 定数宣言 -------------------------------******_EH*
protected:
private:
	//-- Public Constant -------------- 公開定数 -------------------------------******PCS*
public:
	//-- Public Variable -------------- 公開変数 -------------------------------******PVA*
	//-- Public Function -------------- 公開関数 -------------------------------******PFC*
	// =============================================================================
	// IPreUpdate::PreUpdate
	/*!
		前更新
	 */
	// ==========================================================================
	virtual void PreUpdate() = 0;


	//-- Geter Function --------------- 取得関数 -------------------------------******PGF*
	//-- Seter Function --------------- 設定関数 -------------------------------******PSF*
	//-- Constructor And Destructor --- コンストラクタ・デストラクタ------------******_CD*
	// ============================================================================
	// IPreUpdate::~IPreUpdate
	/*!
		デストラクタ
	 */
	// ============================================================================
public:
	virtual ~IPreUpdate() {};


	//-- Local Constant --------------- ローカル定数 ---------------------------******LCS*
protected:
private:
	//-- Local Variable --------------- ローカル変数 ---------------------------******LVA*
protected:
private:
	//-- Local Function --------------- ローカル関数 ---------------------------******LFC*
protected:
private:
//------------------------------------------------------------------------------**********
}; //class IPreUpdate


























































//------ Class ------------------------ クラス ---------------------------------******_CL*
/*!	@class
	@brief	オブジェクト更新インターフェース
		更新関数を持つオブジェクトはこのインターフェースから派生する。
 */
class IUpdate : public virtual IObject {
	//-- Enum Hack -------------------- 定数宣言 -------------------------------******_EH*
protected:
private:
	//-- Public Constant -------------- 公開定数 -------------------------------******PCS*
public:
	//-- Public Variable -------------- 公開変数 -------------------------------******PVA*
	//-- Public Function -------------- 公開関数 -------------------------------******PFC*
	// =============================================================================
	// IUpdate::Update
	/*!
		更新
	 */
	// ==========================================================================
	virtual void Update() = 0;


	//-- Geter Function --------------- 取得関数 -------------------------------******PGF*
	//-- Seter Function --------------- 設定関数 -------------------------------******PSF*
	//-- Constructor And Destructor --- コンストラクタ・デストラクタ------------******_CD*
	// ============================================================================
	// IUpdate::~IUpdate
	/*!
		デストラクタ
	 */
	// ============================================================================
public:
	virtual ~IUpdate() {};


	//-- Local Constant --------------- ローカル定数 ---------------------------******LCS*
protected:
private:
	//-- Local Variable --------------- ローカル変数 ---------------------------******LVA*
protected:
private:
	//-- Local Function --------------- ローカル関数 ---------------------------******LFC*
protected:
private:
//------------------------------------------------------------------------------**********
}; //class IUpdate


























































//------ Class ------------------------ クラス ---------------------------------******_CL*
/*!	@class
	@brief	オブジェクト後更新インターフェース
		後更新関数を持つオブジェクトはこのインターフェースから派生する。
 */
class IPostUpdate : public virtual IObject {
	//-- Enum Hack -------------------- 定数宣言 -------------------------------******_EH*
protected:
private:
	//-- Public Constant -------------- 公開定数 -------------------------------******PCS*
public:
	//-- Public Variable -------------- 公開変数 -------------------------------******PVA*
	//-- Public Function -------------- 公開関数 -------------------------------******PFC*
	// =============================================================================
	// IPostUpdate::PostUpdate
	/*!
		後更新
	 */
	// ==========================================================================
	virtual void PostUpdate() = 0;


	//-- Geter Function --------------- 取得関数 -------------------------------******PGF*
	//-- Seter Function --------------- 設定関数 -------------------------------******PSF*
	//-- Constructor And Destructor --- コンストラクタ・デストラクタ------------******_CD*
	// ============================================================================
	// IPostUpdate::~IPostUpdate
	/*!
		デストラクタ
	 */
	// ============================================================================
public:
	virtual ~IPostUpdate() {};


	//-- Local Constant --------------- ローカル定数 ---------------------------******LCS*
protected:
private:
	//-- Local Variable --------------- ローカル変数 ---------------------------******LVA*
protected:
private:
	//-- Local Function --------------- ローカル関数 ---------------------------******LFC*
protected:
private:
//------------------------------------------------------------------------------**********
}; //class IPostUpdate


























































//------ Class ------------------------ クラス ---------------------------------******_CL*
/*!	@class
	@brief	オブジェクト描画インターフェース
		描画関数を持つオブジェクトはこのインターフェースから派生する。
 */
class IDraw : public virtual IObject {
	//-- Enum Hack -------------------- 定数宣言 -------------------------------******_EH*
protected:
private:
	//-- Public Constant -------------- 公開定数 -------------------------------******PCS*
public:
	//-- Public Variable -------------- 公開変数 -------------------------------******PVA*
	//-- Public Function -------------- 公開関数 -------------------------------******PFC*
	// =============================================================================
	// IDraw::Draw
	/*!
		描画
	 */
	// ==========================================================================
	virtual void Draw() const = 0;


	//-- Geter Function --------------- 取得関数 -------------------------------******PGF*
	//-- Seter Function --------------- 設定関数 -------------------------------******PSF*
	//-- Constructor And Destructor --- コンストラクタ・デストラクタ------------******_CD*
	// ============================================================================
	// IDraw::~IDraw
	/*!
		デストラクタ
	 */
	// ============================================================================
public:
	virtual ~IDraw() {};


	//-- Local Constant --------------- ローカル定数 ---------------------------******LCS*
protected:
private:
	//-- Local Variable --------------- ローカル変数 ---------------------------******LVA*
protected:
private:
	//-- Local Function --------------- ローカル関数 ---------------------------******LFC*
protected:
private:
//------------------------------------------------------------------------------**********
}; //class IDraw


























































} //namespace object
} //namespace er
#endif //#if	defined(__cplusplus)

	// ============================================================================
	// CShape::Function
	/*!
		関数の説明
	 
		@param	org1	[io]	引数１の説明
		@param	org2	[in]	引数２の説明
		@param	org3	[out]	引数３の説明
	 
		@return	戻り値の説明
			or
		@retval	0	正常
		@retval	!0	異常
	 
		@exception 例外

		@note
			補足説明
	 */
	// ============================================================================
