// ==========================================================================
/*!
  @file gmBoss3.h
  @brief É{ÉX3

  @author Hanaoka
				Copyright(c) 2009 Dimps

  $Id: gmBoss3.h 2 2011-04-11 05:21:26Z thamada $
  $Date: 2011-04-11 14:21:26 +0900 (Êúà, 11 4 2011) $
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_BOSS3_H_
#define GM_BOSS3_H_


#if	defined(__cplusplus)
extern "C" {
#endif

//----- Include Files -------------------------------------------------------

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------

// =======================================================================
// GmBoss3Build
/*!
 *	É{ÉX3ç\íz
 */
// =======================================================================
extern void GmBoss3Build( void );

// =======================================================================
// GmBoss3Flush
/*!
 *	É{ÉX3âï˙
 */
// =======================================================================
extern void GmBoss3Flush( void );

// ==========================================================================
// GmBoss3Init
/*!
 *	É{ÉX3ä«óùèâä˙âªä÷êî
 *
 *	@param eve_rec	[io] ÉåÉRÅ[ÉhÉ|ÉCÉìÉ^
 *	@param pos_x	[in] èoåªç¿ïW
 *	@param pos_y	[in] 
 *	@param type		[in] èàóùì‡óeÉ^ÉCÉv í èÌÇÕ0
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmBoss3Init( GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type );

// ==========================================================================
// GmBoss3BodyInit
/*!
 *	É{ÉX3ëÃèâä˙âªä÷êî
 *
 *	@param eve_rec	[io] ÉåÉRÅ[ÉhÉ|ÉCÉìÉ^
 *	@param pos_x	[in] èoåªç¿ïW
 *	@param pos_y	[in] 
 *	@param type		[in] èàóùì‡óeÉ^ÉCÉv í èÌÇÕ0
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmBoss3BodyInit( GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type );

// ==========================================================================
// GmBoss3EggInit
/*!
 *	É{ÉX3ÉGÉbÉOÉ}Éìèâä˙âªä÷êî
 *
 *	@param eve_rec	[io] ÉåÉRÅ[ÉhÉ|ÉCÉìÉ^
 *	@param pos_x	[in] èoåªç¿ïW
 *	@param pos_y	[in] 
 *	@param type		[in] èàóùì‡óeÉ^ÉCÉv í èÌÇÕ0
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmBoss3EggInit( GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type );


#if	defined(__cplusplus)
} /* extern "C" */
#endif

//----- Include Files -------------------------------------------------------

#endif // GM_BOSS3_H_






