// ==========================================================================
/*!
  @file gmCamera.h
  @brief 

  @author 
				Copyright(c) 2009 Dimps

  $Id: gmCamera.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_CAMERA_H_
#define GM_CAMERA_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------
//#define	GMD_SCR_PLY_Y_OFFS	(12 << FX32_SHIFT)	// スクロール中心プレイヤーＹオフセット
#define	GMD_SCR_PLY_Y_OFFS	(6 << FX32_SHIFT)	// スクロール中心プレイヤーＹオフセット
#define	GMD_SCR_ALLOW_SPD	(4.0f)		// 地上/空中スクロールトリガ抑制拡縮速度
#define	GMD_SCR_ROLL_MAX	(0x0800)	// 最大画面回転角度

#define GMD_CAMERA_ADDMAP_NUM	(4)	//!< 追加マップ用カメラ数

enum {
	GME_CAMERA_NO_MAIN	= 0,	//!< メインカメラ
	GME_CAMERA_NO_FAR,			//!< 遠景カメラ
	GME_CAMERA_NO_SNEAR,		//!< 超近景カメラ(追加マップ)
	GME_CAMERA_NO_MID1,			//!< 中景スクロールタイプカメラ(追加マップ)
	GME_CAMERA_NO_MID2,			//!< 中景スクロールタイプカメラ(追加マップ)
	GME_CAMERA_NO_MID3,			//!< 中景スクロールタイプカメラ(追加マップ)
								// 中景タイプは以降連番で
	GME_CAMERA_NO_WATER,		//!< 水面カメラ

	GME_CAMERA_NO_MAX
};

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmCameraInit
/*!
 *	カメラ初期化
 */
// ==========================================================================
extern void GmCameraInit(void);

// ==========================================================================
// GmCameraExit
/*!
 *	カメラ終了
 */
// ==========================================================================
extern void GmCameraExit(void);

// ==========================================================================
// GmCameraPosSet
/*!
 *	カメラ指定座標セット
 *
 *	@param	pos_x		[in]	指定Ｘ座標
 *	@param	pos_y		[in]	指定Ｙ座標
 *	@param	pos_z		[in]	指定Ｚ座標
 */
// ==========================================================================
extern void GmCameraPosSet(fx32 pos_x, fx32 pos_y, fx32 pos_z);

// ==========================================================================
// GmCameraVibrationSet
/*!
 *	カメラ画面振動セット
 *
 *	@param	obj_camera	[in]	オブジェクトカメラ
 */
// ==========================================================================
extern void GmCameraVibrationSet(fx32 vib_x, fx32 vib_y, fx32 vib_z);

// ==========================================================================
// GmCameraAllowSet
/*!
 *	スクロール開始遊びセット
 *
 *	@param	obj_camera	[in]	オブジェクトカメラ
 */
// ==========================================================================
extern void GmCameraAllowSet(Float alw_x, Float alw_y, Float alw_z);

// ==========================================================================
// GmCameraAllowReset
/*!
 *	スクロール開始遊びリセット
 *
 *	@param	obj_camera	[in]	オブジェクトカメラ
 */
// ==========================================================================
extern void GmCameraAllowReset(void);

// ==========================================================================
// GmCameraDelaySet
/*!
 *	スクロール遅延遊びセット
 *
 *	@param	obj_camera	[in]	オブジェクトカメラ
 */
// ==========================================================================
extern void GmCameraDelaySet(Float dly_x, Float dly_y, Float dly_z);

// ==========================================================================
// GmCameraDelayReset
/*!
 *	スクロール遅延遊びセット
 *
 *	@param	obj_camera	[in]	オブジェクトカメラ
 */
// ==========================================================================
extern void GmCameraDelayReset(void);


// ==========================================================================
// GmCameraScaleSet
/*!
 *	表示スケールの変更（拡縮）
 *
 *	@param	scale_target	[in]	目標スケール(1.0f で基準サイズに戻る)
 *	@param	scale_spd		[in]	スケール変更速度
 *
 *	@note
 *		簡易処理のため大きな縮小率をセットするとマップ描画範囲や
 *		イベント生成範囲にて不具合が生じるため、設定数値に注意
 */
// ==========================================================================
extern void GmCameraScaleSet(float scale_target, float scale_spd);

// ==========================================================================
// GmCameraSetClipCamera
/*!
 *	クリッピング, イベント生成範囲基点 を設定
 *
 *	@param	obj_camera	[in]	対象カメラ
 *
 *	@note
 *		disp_pos の設定が済んだ後に呼び出してください。\n
 *		基本的に、ObjObjectCameraSet とセットで呼び出します
 */
// ==========================================================================
extern void GmCameraSetClipCamera(OBS_CAMERA *obj_camera);

// ==========================================================================
// ユーザーカメラ処理
// ==========================================================================
// ==========================================================================
// GmCameraFunc
/*!
 *	メインカメラ
 *
 *	@param	obj_camera	[in]	オブジェクトカメラ
 */
// ==========================================================================
extern void GmCameraFunc(OBS_CAMERA *obj_camera);

// ==========================================================================
// GmCameraTruckFunc
/*!
 *	メインカメラ トロッコ用
 *	@param	obj_camera	[in]	オブジェクトカメラ
 */
// ==========================================================================
extern void GmCameraTruckFunc(OBS_CAMERA *obj_camera);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_CAMERA_H_

//----- Include Files -------------------------------------------------------
