// =======================================================================
/*!
  @file	gmDebugPause.h
  @brief メインゲームデバッグポーズ

  @author Keisuke Tanaka
 				Copyright(c) 2009 Dimps
  $Id: gmDebugPause.h 2 2011-04-11 05:21:26Z thamada $
 */
// =======================================================================
/*
 * $Log$
 */

/* 重複インクルード回避手法 */

#ifndef GM_DEBUG_PAUSE_H_
#define GM_DEBUG_PAUSE_H_

#if	defined(__cplusplus)
extern "C" {
#endif

/*------ Include Files -------------------------------------------------*/

/*------ Macros --------------------------------------------------------*/

/*------ Macro Functions -----------------------------------------------*/

/*------ Definitions ---------------------------------------------------*/

/*------ External Declarations -----------------------------------------*/
// =======================================================================
// GmDbgPauseInit
/*!
  デバッグポーズ初期化
 */
// =======================================================================
extern void GmDbgPauseInit(void);


// =======================================================================
// test_func
/*!
  関数機能
 
  @param param0 [in] 入力引数0説明
  @param param1 [out] 出力ポインタ引数1説明
  @param param2 [io] 入出力ポインタ引数2説明
 
  @return 返値説明
 
  @note
  補足説明
 */
// =======================================================================

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif /* GM_DEBUG_PAUSE_H_ */
