// ==========================================================================
/*!
  @file gmEneHari.h
  @brief エネミー ハリセンボ

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmEneHari.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_ENE_HARI_H_
#define GM_ENE_HARI_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmEneHariSenboBuild
/*!
 *	エネミー ハリセンボ データ構築
 */
// ==========================================================================
extern void GmEneHariSenboBuild(void);

// ==========================================================================
// GmEneHariSenboFlush
/*!
 *	エネミー ハリセンボ データ片付け
 */
// ==========================================================================
extern void GmEneHariSenboFlush(void);

// ==========================================================================
// GmEneHariSenboInit
/*!
 *	エネミー ハリセンボ 初期化関数
 *
 *	@param eve_rec	[io] レコードポインタ
 *	@param pos_x	[in] 出現座標
 *	@param pos_y	[in] 
 *	@param type		[in] 処理内容タイプ 通常は0
 *
 *	@note
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmEneHariSenboInit(GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_ENE_HARI_H_

//----- Include Files -------------------------------------------------------
