// ==========================================================================
/*!
  @file gmEneBuku.h
  @brief エネミー ブクブク

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmEneBukuBuku.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_ENE_BUKU_H_
#define GM_ENE_BUKU_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmEneBukuBuild
/*!
 *	エネミー ブクブク データ構築
 */
// ==========================================================================
extern void GmEneBukuBuild(void);

// ==========================================================================
// GmEneBukuFlush
/*!
 *	エネミー ブクブク データ片付け
 */
// ==========================================================================
extern void GmEneBukuFlush(void);

// ==========================================================================
// GmEneBukuInit
/*!
 *	エネミー ブクブク 初期化関数
 *
 *	@param eve_rec	[io] レコードポインタ
 *	@param pos_x	[in] 出現座標
 *	@param pos_y	[in] 
 *	@param type		[in] 処理内容タイプ 通常は0
 *
 *	@note
 *		user_work	: 左移動限界\n
 *		usre_flag	: 右移動限界
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmEneBukuInit(GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_ENE_BUKU_H_

//----- Include Files -------------------------------------------------------
