// =======================================================================
/*!
  @file	gmFix.h
  @brief FIX

  @author Keisuke Tanaka
 				Copyright(c) 2009 Dimps
  $Id: gmFix.h 2 2011-04-11 05:21:26Z thamada $
 */
// =======================================================================
/*
 * $Log$
 */

/* 重複インクルード回避手法 */

#ifndef GM_FIX_H_
#define GM_FIX_H_

#if	defined(__cplusplus)
extern "C" {
#endif

/*------ Include Files -------------------------------------------------*/

/*------ Macros --------------------------------------------------------*/

/*------ Macro Functions -----------------------------------------------*/

/*------ Definitions ---------------------------------------------------*/

/*------ External Declarations -----------------------------------------*/
// =======================================================================
// GmFixBuildDataInit
/*!
  テクスチャビルド開始
 */
// =======================================================================
extern void GmFixBuildDataInit(void);

// =======================================================================
// GmFixBuildDataLoop
/*!
  テクスチャビルド完了待ち
  
  @retval TRUE	ビルド完了
  @retval FALSE	ビルド中
 */
// =======================================================================
extern BOOL GmFixBuildDataLoop(void);

// =======================================================================
// GmFixFlushDataInit
/*!
  テクスチャフラッシュ開始
 */
// =======================================================================
extern void GmFixFlushDataInit(void);

// =======================================================================
// GmFixFlushDataLoop
/*!
  テクスチャフラッシュ完了待ち
  
  @retval TRUE	フラッシュ完了
  @retval FALSE	フラッシュ中
 */
// =======================================================================
extern BOOL GmFixFlushDataLoop(void);

// =======================================================================
// GmFixInit
/*!
  FIX初期化
 */
// =======================================================================
extern void GmFixInit(void);

// =======================================================================
// GmFixExit
/*!
  FIX終了
 */
// =======================================================================
extern void GmFixExit(void);

// =======================================================================
// GmFixSetDisp
/*!
  表示設定
  
  @param enable		[in]	有効フラグ（TRUE:表示, FALSE:非表示）
  
  @note
  FALSE設定することで表示関連処理を無効にします。
 */
// =======================================================================
extern void GmFixSetDisp(BOOL enable);

#if _IPHONE
// =======================================================================
// GmFixSetDispEx
/*!
  拡張表示設定
  
  @param enable			[in]	有効フラグ（TRUE:表示, FALSE:非表示）
  @param enable_ss		[in]	有効フラグ（TRUE:表示, FALSE:非表示）バーチャルパッド(スーバーソニック)
  @param enable_pause	[in]	有効フラグ（TRUE:表示, FALSE:非表示）バーチャルパッド(ポーズ)
  @param enable_action	[in]	有効フラグ（TRUE:表示, FALSE:非表示）バーチャルパッド(アクション)
  @param enable_move	[in]	有効フラグ（TRUE:表示, FALSE:非表示）バーチャルパッド(十時キー)

  @note
  FALSE設定することで表示関連処理を無効にします。
 */
// =======================================================================
extern void GmFixSetDispEx(BOOL enable, BOOL enable_ss, BOOL enable_pause
						, BOOL enable_action, BOOL enable_move);
#endif //_IPHONE

// =======================================================================
// GmFixIsDisp
/*!
  表示中判定
  
  @retval TRUE	表示中
  @retval FALSE	非表示中
 */
// =======================================================================
extern BOOL GmFixIsDisp(void);

// =======================================================================
// GmFixRequestTimerFlash
/*!
  タイマフラッシュ動作開始リクエスト
  
  @note
  FIXが起動していないときは何もしません。
 */
// =======================================================================
extern void GmFixRequestTimerFlash(void);

// =======================================================================
// test_func
/*!
  関数機能
 
  @param param0 [in] 入力引数0説明
  @param param1 [out] 出力ポインタ引数1説明
  @param param2 [io] 入出力ポインタ引数2説明
 
  @return 返値説明
 
  @note
  補足説明
 */
// =======================================================================

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif /* GM_FIX_H_ */
