// ==========================================================================
/*!
  @file gmGameDBuild.h
  @brief ゲームデータ構築

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmGameDBuild.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_GAME_D_BUILD_H_
#define GM_GAME_D_BUILD_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// データビルド
// ==========================================================================
// ==========================================================================
// GmGameDatBuildInit
/*!
 *	ゲームデータ構築 初期化
 *
 *	@note
 *		データを初期化を行う前の初期化を行います。
 */
// ==========================================================================
extern void GmGameDatBuildInit(void);

// ==========================================================================
// GmGameDatBuildStandard
/*!
 *	ゲームデータ構築 標準データ
 *
 *	@note
 *		読み込み済みのデータを初期化します。\n
 *		ゲーム構造体に対象のステージを設定しておいてください。\n
 *		g_gs_main_sys_info のゲーム設定情報が正常に設定されている必要があります。
 */
// ==========================================================================
extern void GmGameDatBuildStandard(void);

// ==========================================================================
// GmGameDatBuildArea
/*!
 *	ゲームデータ構築 エリアデータ
 *
 *	@note
 *		読み込み済みのデータを初期化します。\n
 *		ゲーム構造体に対象のステージを設定しておいてください。\n
 *		g_gs_main_sys_info のゲーム設定情報が正常に設定されている必要があります。
 */
// ==========================================================================
extern void GmGameDatBuildArea(void);

// ==========================================================================
// GmGameDatBuildCommonCheck
/*!
 *	ゲームデータ構築 共通構築処理
 *
 *	@return	TRUE : 構築終了
 *
 *	@note
 *		共通の構築処理を行います。
 */
// ==========================================================================
extern BOOL GmGameDatBuildCommonCheck(void);

// ==========================================================================
// GmGameDatBuildStandardCheck
/*!
 *	ゲームデータ構築 標準データ 構築終了チェック
 *
 *	@return	TRUE : 構築終了
 *
 *	@note
 *		標準データが構築終了済みかをチェックします。
 */
// ==========================================================================
extern BOOL GmGameDatBuildStandardCheck(void);

// ==========================================================================
// GmGameDatBuildAreaCheck
/*!
 *	ゲームデータ構築 エリアデータ 構築終了チェック
 *
 *	@return	TRUE : 構築終了
 *
 *	@note
 *		エリアデータが構築終了済みかをチェックします。
 */
// ==========================================================================
extern BOOL GmGameDatBuildAreaCheck(void);

// ==========================================================================
// データフラッシュ
// ==========================================================================
// ==========================================================================
// GmGameDatFlushInit
/*!
 *	ゲームデータ片付け 初期化
 *
 *	@note
 *		データ片付けを行う前の初期化を行います。
 */
// ==========================================================================
extern void GmGameDatFlushInit(void);

// ==========================================================================
// GmGameDatFlushStandard
/*!
 *	ゲームデータ片付け 標準データ
 *
 *	@note
 *		構築したデータを片付けます。\n
 *		g_gs_main_sys_info のゲーム設定情報が正常に設定されている必要があります。
 */
// ==========================================================================
extern void GmGameDatFlushStandard(void);

// ==========================================================================
// GmGameDatFlushArea
/*!
 *	ゲームデータ片付け エリアデータ
 *
 *	@note
 *		構築したデータを片付けます。\n
 *		g_gs_main_sys_info のゲーム設定情報が正常に設定されている必要があります。
 */
// ==========================================================================
extern void GmGameDatFlushArea(void);

// ==========================================================================
// GmGameDatFlushCommonCheck
/*!
 *	ゲームデータ片付け 共通片付け処理
 *
 *	@return	TRUE : 終了
 *
 *	@note
 *		共通の片付け処理を行います。
 */
// ==========================================================================
extern BOOL GmGameDatFlushCommonCheck(void);

// ==========================================================================
// GmGameDatFlushStandardCheck
/*!
 *	ゲームデータ片付け 標準データ 片付け終了チェック
 *
 *	@return	TRUE : 終了
 *
 *	@note
 *		標準データが片付け終了済みかをチェックします。
 */
// ==========================================================================
extern BOOL GmGameDatFlushStandardCheck(void);

// ==========================================================================
// GmGameDatFlushAreaCheck
/*!
 *	ゲームデータ片付け エリアデータ 片付け終了チェック
 *
 *	@return	TRUE : 終了
 *
 *	@note
 *		エリアデータが片付け終了済みかをチェックします。
 */
// ==========================================================================
extern BOOL GmGameDatFlushAreaCheck(void);

// ==========================================================================
// ボス連戦用
// ==========================================================================
// ==========================================================================
// GmGameDatBuildBossBattleInit
/*!
 *	ゲームデータ構築 初期化 ボス連戦用
 *
 *	@note
 *		データを初期化を行う前の初期化を行います。
 */
// ==========================================================================
extern void GmGameDatBuildBossBattleInit(void);

// ==========================================================================
// GmGameDatBuildBossBattle
/*!
 *	ゲームデータ構築 ボス連戦用
 *
 *	@param	boss_type	[in]	ビルドタイプ	GME_GAMEDAT_LOAD_BOSS_TYPE
 *
 *	@note
 *		読み込み済みのデータを初期化します。\n
 *		ゲーム構造体に対象のステージを設定しておいてください。\n
 *		g_gs_main_sys_info のゲーム設定情報が正常に設定されている必要があります。
 */
// ==========================================================================
extern void GmGameDatBuildBossBattle(s32 boss_type);

// ==========================================================================
// GmGameDatBuildBossBattleCheck
/*!
 *	ゲームデータ構築 構築終了チェック ボス連戦用
 *
 *	@return	TRUE : 構築終了
 *
 *	@note
 *		データが構築終了済みかをチェックします。
 */
// ==========================================================================
extern BOOL GmGameDatBuildBossBattleCheck(void);

// ==========================================================================
// GmGameDatFlushBossBattleInit
/*!
 *	ゲームデータ片付け ボス連戦用
 *
 *	@note
 *		データ片付けを行う前の初期化を行います。
 */
// ==========================================================================
extern void GmGameDatFlushBossBattleInit(void);

// ==========================================================================
// GmGameDatFlushBossBattle
/*!
 *	ゲームデータ片付け ボス連戦用
 *
 *	@param	boss_type	[in]	フラッシュタイプ GME_GAMEDAT_LOAD_BOSS_TYPE
 *
 *	@note
 *		構築したデータを片付けます。\n
 *		g_gs_main_sys_info のゲーム設定情報が正常に設定されている必要があります。
 */
// ==========================================================================
extern void GmGameDatFlushBossBattle(s32 boss_type);

// ==========================================================================
// GmGameDatFlushBossBattleCheck
/*!
 *	ゲームデータ片付け 片付け終了チェック ボス連戦用
 *
 *	@return	TRUE : 終了
 *
 *	@note
 *		データが片付け終了済みかをチェックします。
 */
// ==========================================================================
extern BOOL GmGameDatFlushBossBattleCheck(void);


// ==========================================================================
// モデルデータ構築
// ==========================================================================
// ==========================================================================
// GmGameDBuildModelBuildInit
/*!
 *	3Dモデルデータ構築処理用初期化
 *
 *	@note
 *		GmObjのデータ構築処理を開始する前に初期化します。
 */
// ==========================================================================
extern void GmGameDBuildModelBuildInit(void);

// ==========================================================================
// GmGameDBuildRegBuildModel
/*!
 *	モデル構築登録
 *
 *	@param mdl_amb		[in] モデルAMB
 *	@param tex_amb		[in] テクスチャAMB
 *	@param draw_flag	[in] 描画フラグ
 *	@param txb			[in] 差し替えテクスチャ用TXB (NULL可)
 *
 *	@return	構築中 OBS_ACTION3D_NN_WORK
 *
 *	@note
 *		mdl_amb に含まれるモデルをすべてOBS_ACTION3D_NN_WORKで初期化します。\n
 *		GmObjBuildModelで登録した後、GmGameDBuildCheckBuildModel でオブジェクト登録と\n
 *		登録終了確認を行う必要があります。\n
 *		取得される OBS_ACTION3D_NN_WORK はモデルの個数分です。\n
 *		GmGameDBuildCheckBuildModel でTRUEが返るまでは、構築は保障されません。
 */
// ==========================================================================
extern OBS_ACTION3D_NN_WORK* GmGameDBuildRegBuildModel(AMS_AMB_HEADER *mdl_amb, AMS_AMB_HEADER *tex_amb, NNF_DRAWOBJ draw_flag, void *txb=NULL);

// ==========================================================================
// GmGameDBuildCheckBuildModel
/*!
 *	モデル構築登録 及び 終了チェック
 *
 *	@return	TRUE : 登録されたモデルの構築を終了
 *
 *	@note
 *		GmGameDBuildRegBuildModelで登録されたモデルの構築命令発行と\n
 *		終了チェックを行います。\n
 *		登録が終了するまで毎フレーム呼び出す必要があります。
 */
// ==========================================================================
extern BOOL GmGameDBuildCheckBuildModel(void);

// ==========================================================================
// GmGameDBuildModelFlushInit
/*!
 *	GmObjのデータ片付け処理用初期化。
 *
 *	@note
 *		GmObjのデータ片付け処理を開始する前に初期化します。
 */
// ==========================================================================
extern void GmGameDBuildModelFlushInit(void);

// ==========================================================================
// GmGameDBuildRegFlushModel
/*!
 *	モデル片付け登録
 *
 *	@param mdl_amb	[in] モデルAMB
 *	@param tex_amb	[in] テクスチャAMB
 *
 *	@return	構築中 OBS_ACTION3D_NN_WORK * モデル数
 *
 *	@note
 *		mdl_amb に含まれるモデルをすべてOBS_ACTION3D_NN_WORKで初期化します。\n
 *		GmObjBuildModelで登録した後、GmGameDBuildCheckBuildModel でオブジェクト登録と\n
 *		登録終了確認を行う必要があります。\n
 *		取得される OBS_ACTION3D_NN_WORK はモデルの個数分です。\n
 *		GmGameDBuildCheckBuildModel でTRUEが返るまでは、構築は保障されません。
 */
// ==========================================================================
extern void GmGameDBuildRegFlushModel(OBS_ACTION3D_NN_WORK *obj_3d_list, s32 num);

// ==========================================================================
// GmGameDBuildCheckFlushModel
/*!
 *	モデル片付け登録 及び 終了チェック
 *
 *	@return	TRUE : 登録されたモデルの片付けを終了
 *
 *	@note
 *		GmGameDBuildRegFlushModelで登録されたモデルの開放命令発行と\n
 *		終了チェックを行います。\n
 *		開放が終了するまで毎フレーム呼び出す必要があります。
 */
// ==========================================================================
extern BOOL GmGameDBuildCheckFlushModel(void);


// ==========================================================================
// データリビルド
// ==========================================================================
// ==========================================================================
// GmGameDatFlashRestart
/*!
 *	ゲームデータ片付け リスタート用
 *
 *	@note
 *		ビルド済みのデータをフラッシュします。
 */
// ==========================================================================
extern void GmGameDatFlashRestart(void);

// ==========================================================================
// GmGameDatReBuildRestart
/*!
 *	ゲームデータ構築 リスタート用
 *
 *	@note
 *		ビルド済みのデータを再構築します。\n
 *		基本的には、構築待機をしなくていいデータのみを再構築します
 */
// ==========================================================================
extern void GmGameDatReBuildRestart(void);

// ==========================================================================
// GmGameDatReBuildRestartCheck
/*!
 *	ゲームデータ構築 リスタート用 再構築終了チェック
 *
 *	@return	TRUE : 終了
 *
 *	@note
 *		データ再構築が終了済みかをチェックします。
 */
// ==========================================================================
extern BOOL GmGameDatReBuildRestartCheck(void);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_GAME_D_BUILD_H_

//----- Include Files -------------------------------------------------------
