// =======================================================================
/*!
	@file	gmGmkSlot.h
	@brief	ギミック スロット＠ゾーン２　ストッパーと連動

	@author ei-chi co.ltd
				Copyright(c) 2009 Dimps
	$Id: gmGmkSlot.h 2 2011-04-11 05:21:26Z thamada $
	$Date:: 2011-04-11 14:21:26 +0900#$
  
 */
// =======================================================================
/*
 *
 *
 */

#ifndef GM_GMK_SLOT_H
#define GM_GMK_SLOT_H


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

#include "gmPlayer.h"

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------

// ==========================================================================
// GmGmkSlotIsStatus
/*!
	ギミック スロット＠ゾーン２　ストッパーと連動

	@note
		スロット要求に成功した後の、スロットの終了判定となります。
		引数のidと違うidになった場合は何らかのエラーです。

 */
// ==========================================================================
extern BOOL GmGmkSlotIsStatus(int slot_id);
// ==========================================================================

// ==========================================================================
// GmGmkSlotInit
/*!
 *	ギミック スロット＠ゾーン２　ストッパーと連動 初期化関数
 *
 *	@param eve_rec	[io] レコードポインタ
 *	@param pos_x	[in] 出現座標X
 *	@param pos_y	[in] 出現座標Y
 *	@param type		[in] 処理内容タイプ 通常は0
 *
 *	@note
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmGmkSlotInit(GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type);


// ===========================================================================
// GmGmkSlotBuild
/*!
	ギミック スロット＠ゾーン２　ストッパーと連動 データロード
	
	
	@note

 */
// ===========================================================================
extern void GmGmkSlotBuild(void);


// ===========================================================================
// GmGmkSlotFlush
/*!
	ギミック スロット＠ゾーン２　ストッパーと連動 データ破棄
	
	
	@note

 */
// ===========================================================================
extern void GmGmkSlotFlush(void);

// ==========================================================================
// GmGmkSlotStartRequest
/*!
	ギミック スロット＠ゾーン２　ストッパーと連動

	@note
		ストッパーからスロットゲームの開始を要求します
		安全のため戻り値がFALSEだった場合、スロットの起動に失敗のため
		ソニックを開放しなくてはなりません。
		引数にスロットのＩＤを指定してください。
 */
// ==========================================================================
extern BOOL GmGmkSlotStartRequest(int slot_id, GMS_PLAYER_WORK *ply_work);


#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_GMK_SLOT_H

//----- Include Files -------------------------------------------------------
