// =======================================================================
/*!
	@file	gmGmkCannon.h
	@brief	ギミック 大砲＠ゾーン２

	@author ei-chi co.ltd
				Copyright(c) 2009 Dimps
	$Id: gmGmkCannon.h 2 2011-04-11 05:21:26Z thamada $
	$Date:: 2011-04-11 14:21:26 +0900#$
  
 */
// =======================================================================
/*
 *
 *
 */

#ifndef GM_GMK_CANNON_H
#define GM_GMK_CANNON_H


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmGmkCannonInit
/*!
 *	ギミック 大砲＠ゾーン２ 初期化関数
 *	GmGmkCannonInit
 *
 *	@param eve_rec	[io] レコードポインタ
 *	@param pos_x	[in] 出現座標X
 *	@param pos_y	[in] 出現座標Y
 *	@param type		[in] 処理内容タイプ 通常は0
 *
 *	@note
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmGmkCannonInit(GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type);


// ===========================================================================
// GmGmkCannonBuild
/*!
	ギミック 大砲＠ゾーン２ データロード
	
	
	@note

 */
// ===========================================================================
void GmGmkCannonBuild(void);


// ===========================================================================
// GmGmkCannonFlush
/*!
	ギミック 大砲＠ゾーン２ データ破棄
	
	
	@note

 */
// ===========================================================================
void GmGmkCannonFlush(void);



#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_GMK_CANNON_H

//----- Include Files -------------------------------------------------------
