// ==========================================================================
/*!
  @file gmGmkFlipper.h
  @brief ƒMƒ~ƒbƒN@ƒtƒŠƒbƒp[

  @author Hanaoka
				Copyright(c) 2009 Dimps

  $Id: gmGmkFlipper.h 2 2011-04-11 05:21:26Z thamada $
  $Date: 2011-04-11 14:21:26 +0900 (æœˆ, 11 4 2011) $
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_GMK_FLIPPER_H_
#define GM_GMK_FLIPPER_H_


#if	defined(__cplusplus)
extern "C" {
#endif

//----- Include Files -------------------------------------------------------

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmGmkFlipperBuild
/*!
 *	ƒMƒ~ƒbƒN ƒtƒŠƒbƒp[ ƒf[ƒ^\’z
 */
// ==========================================================================
extern void GmGmkFlipperBuild(void);

// ==========================================================================
// GmGmkFlipperFlush
/*!
 *	ƒMƒ~ƒbƒN ƒtƒŠƒbƒp[ ƒf[ƒ^•Ğ•t‚¯
 */
// ==========================================================================
extern void GmGmkFlipperFlush(void);

// ==========================================================================
// GmGmkFlipperInit
/*!
 *	ƒMƒ~ƒbƒN‰Šú‰»ŠÖ”@ƒtƒŠƒbƒp[
 *
 *	@param eve_rec	[io] ƒŒƒR[ƒhƒ|ƒCƒ“ƒ^
 *	@param pos_x	[in] oŒ»À•W
 *	@param pos_y	[in] 
 *	@param type		[in] ˆ—“à—eƒ^ƒCƒv ’Êí‚Í0
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmGmkFlipperInit( GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type );

#if	defined(__cplusplus)
} /* extern "C" */
#endif

//----- Include Files -------------------------------------------------------

#endif // GM_GMK_FLIPPER_H_
