// ==========================================================================
/*!
  @file gmGmkSwitch.h
  @brief ギミック スイッチ

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmGmkSwitch.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_GMK_SWITCH_H_
#define GM_GMK_SWITCH_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------
#define GMD_GMK_SW_MAX		(64)		//!< スイッチ最大数

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmGmkSwitchBuildType3
/*!
 *	ギミック スイッチ データ構築 ZONE3タイプ
 */
// ==========================================================================
void GmGmkSwitchBuildTypeZone3(void);

// ==========================================================================
// GmGmkSwitchBuildType4
/*!
 *	ギミック スイッチ データ構築 ZONE4タイプ
 */
// ==========================================================================
extern void GmGmkSwitchBuildTypeZone4(void);

// ==========================================================================
// GmGmkSwitchReBuild
/*!
 *	ギミック スイッチ 再構築
 */
// ==========================================================================
extern void GmGmkSwitchReBuild(void);

// ==========================================================================
// GmGmkSwitchFlush
/*!
 *	ギミック スイッチ データ片付け
 */
// ==========================================================================
extern void GmGmkSwitchFlush(void);

// ==========================================================================
// GmGmkSwitchInit
/*!
 *	ギミック スイッチ 初期化関数
 *
 *	@param eve_rec	[io] レコードポインタ
 *	@param pos_x	[in] 出現座標
 *	@param pos_y	[in] 
 *	@param type		[in] 処理内容タイプ 通常は0
 *			
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmGmkSwitchInit(GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type);

// ==========================================================================
// GmGmkSwitchIsOn
/*!
 *	ギミック スイッチ 状態チェック
 *
 *	@param sw_id	[io] スイッチID
 *
 *	@retuen		TRUE : スイッチON
 */
// ==========================================================================
extern BOOL GmGmkSwitchIsOn(u32 sw_id);

// ==========================================================================
// GmGmkSwitchTypeIsGear
/*!
 *	ギミック スイッチ 歯車タイプチェック
 *
 *	@param sw_id	[io] スイッチID
 *
 *	@retuen		TRUE : 歯車スイッチ
 */
// ==========================================================================
extern BOOL GmGmkSwitchTypeIsGear(u32 sw_id);

// ==========================================================================
// GmGmkSwitchSetOnGearSwitch
/*!
 *	ギミック スイッチ 歯車スイッチ ON設定
 *
 *	@param sw_id	[io] スイッチID
 *	@param per		[io] 展開率 (0 ～ FX32_ONE)
 */
// ==========================================================================
extern void GmGmkSwitchSetOnGearSwitch(u32 sw_id, fx32 per);

// ==========================================================================
// GmGmkSwitchSetOffGearSwitch
/*!
 *	ギミック スイッチ 歯車スイッチ OFF設定
 *
 *	@param sw_id	[io] スイッチID
 *	@param per		[io] 展開率 (0 ～ FX32_ONE)
 */
// ==========================================================================
extern void GmGmkSwitchSetOffGearSwitch(u32 sw_id, fx32 per);

// ==========================================================================
// GmGmkSwitchGetPer
/*!
 *	ギミック スイッチ 歯車スイッチ 展開度取得
 *
 *	@param sw_id	[io] スイッチID
 *
 *	@return 展開度
 *
 *	@note
 *		展開度は、スイッチOFF(FX32_ONE) から スイッチON(0) となります
 */
// ==========================================================================
extern fx32 GmGmkSwitchGetPer(u32 sw_id);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_GMK_SWITCH_H_

//----- Include Files -------------------------------------------------------
