// ==========================================================================
/*!
  @file gmGmkSpring.h
  @brief ギミック スプリング

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmGmkSpring.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_GMK_SPRING_H_
#define GM_GMK_SPRING_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmGmkSpringBuild
/*!
 *	ギミック スプリング データ構築
 */
// ==========================================================================
extern void GmGmkSpringBuild(void);

// ==========================================================================
// GmGmkSpringFlush
/*!
 *	ギミック スプリング データ片付け
 */
// ==========================================================================
extern void GmGmkSpringFlush(void);

// ==========================================================================
// GmGmkSpringInit
/*!
 *	ギミック スプリング 初期化関数
 *
 *	@param eve_rec	[io] レコードポインタ
 *	@param pos_x	[in] 出現座標
 *	@param pos_y	[in] 
 *	@param type		[in] 処理内容タイプ 通常は0
 *
 *	@note
 *		user_timer : FWアクションID\n
 *		user_work  : 実行アクションID
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmGmkSpringInit(GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // _PT_H_

//----- Include Files -------------------------------------------------------
