// ==========================================================================
/*!
  @file gmGmkGear.h
  @brief ギミック歯車

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmGmkGear.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_GMK_GEAR_H_
#define GM_GMK_GEAR_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------
#define GMD_GMK_GEAR_STAGGER_BACK	(0)		//!< おっとっと後ろタイプ

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmGmkGearBuild
/*!
 *	ギミック 歯車 データ構築
 */
// ==========================================================================
extern void GmGmkGearBuild(void);

// ==========================================================================
// GmGmkGearFlush
/*!
 *	ギミック 歯車 データ片付け
 */
// ==========================================================================
extern void GmGmkGearFlush(void);

// ==========================================================================
// GmGmkGearSetLight
/*!
 *	ギミック 歯車用ライト設定
 */
// ==========================================================================
extern void GmGmkGearSetLight(void);

// ==========================================================================
// GmGmkGearInit
/*!
 *	ギミック 歯車 初期化関数
 *
 *	@param eve_rec	[io] レコードポインタ
 *	@param pos_x	[in] 出現座標
 *	@param pos_y	[in] 
 *	@param type		[in] 処理内容タイプ 通常は0
 *
 *	@note
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmGmkGearInit(GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type);

// ==========================================================================
// GmGmkGearMoveEndInit
/*!
 *	ギミック 移動歯車終端 初期化関数
 *
 *	@param eve_rec	[io] レコードポインタ
 *	@param pos_x	[in] 出現座標
 *	@param pos_y	[in] 
 *	@param type		[in] 処理内容タイプ 通常は0
 *
 *	@note
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmGmkGearMoveEndInit(GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_GMK_GEAR_H_

//----- Include Files -------------------------------------------------------
