// =======================================================================
/*!
	@file	gmGmkBreakObj.h
	@brief	ギミック 破壊可能なオブジェ

	@author ei-chi co.ltd
				Copyright(c) 2009 Dimps
	$Id: gmGmkBreakObj.h 2 2011-04-11 05:21:26Z thamada $
	$Date:: 2011-04-11 14:21:26 +0900#$
  
 */
// =======================================================================
/*
 *
 *
 */

#ifndef GM_GMK_BREAKOBJ_H_
#define GM_GMK_BREAKOBJ_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmGmkBreakObjInit
/*!
 *	ギミック 破壊可能オブジェ 初期化関数
 *
 *	@param eve_rec	[io] レコードポインタ
 *	@param pos_x	[in] 出現座標X
 *	@param pos_y	[in] 出現座標Y
 *	@param type		[in] 処理内容タイプ 通常は0
 *
 *	@note
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmGmkBreakObjInit(GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type);

// ===========================================================================
// GmGmkBreakObjBuild
/*!
	ギミック 破壊可能オブジェ データロード
	
	
	@note

 */
// ===========================================================================
void GmGmkBreakObjBuild(void);
// ===========================================================================


// ===========================================================================
// GmGmkBreakLandFlush
/*!
	ギミック 崩壊足場 データ破棄
	
	
	@note

 */
// ===========================================================================
void GmGmkBreakObjFlush(void);
// ===========================================================================



#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_GMK_NEEDLE_H_

//----- Include Files -------------------------------------------------------
