// ==========================================================================
/*!
  @file gmGmkDSign.h
  @brief 危険告知看板

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmGmkDSign.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_GMK_D_SIGN_H_
#define GM_GMK_D_SIGN_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmGmkDSignBuild
/*!
 *	ギミック 危険告知看板 データ構築
 */
// ==========================================================================
extern void GmGmkDSignBuild(void);

// ==========================================================================
// GmGmkDSignFlush
/*!
 *	ギミック 危険告知看板 データ片付け
 */
// ==========================================================================
extern void GmGmkDSignFlush(void);

// ==========================================================================
// GmGmkDSignInit
/*!
 *	ギミック 危険告知看板 初期化関数
 *
 *	@param eve_rec	[io] レコードポインタ
 *	@param pos_x	[in] 出現座標
 *	@param pos_y	[in] 
 *	@param type		[in] 処理内容タイプ 通常は0
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmGmkDSignInit(GMS_EVE_RECORD_EVENT *eve_rec ,fx32 pos_x, fx32 pos_y, u8 type);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_GMK_D_SIGN_H_

//----- Include Files -------------------------------------------------------
