// ==========================================================================
/*!
  @file gmGmkSwWall.h
  @brief ギミック スイッチ壁

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmGmkSwWall.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_GMK_SW_WALL_H_
#define GM_GMK_SW_WALL_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmGmkSwWallBuild
/*!
 *	ギミック スイッチ壁 データ構築
 */
// ==========================================================================
extern void GmGmkSwWallBuild(void);

// ==========================================================================
// GmGmkSwWallFlush
/*!
 *	ギミック スイッチ壁 データ片付け
 */
// ==========================================================================
extern void GmGmkSwWallFlush(void);

// ==========================================================================
// GmGmkSwWallInit
/*!
 *	ギミック スイッチ壁 初期化関数
 *
 *	@param eve_rec	[io] レコードポインタ
 *	@param pos_x	[in] 出現座標
 *	@param pos_y	[in] 
 *	@param type		[in] 処理内容タイプ 通常は0
 *			
 */
// ==========================================================================
extern OBS_OBJECT_WORK* GmGmkSwWallInit(GMS_EVE_RECORD_EVENT *eve_rec, fx32 pos_x, fx32 pos_y, u8 type);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_GMK_SW_WALL_H_

//----- Include Files -------------------------------------------------------
