// ==========================================================================
/*!
  @file pt.h
  @brief 

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmMap.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_MAP_H_
#define GM_MAP_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------
typedef enum tag_GME_MAP_ADD_MAP {
	GME_MAP_ADD_MAP_NEAR	= 0,		//!< 超近景
	GME_MAP_ADD_MAP_MID,				//!< 中景
	GME_MAP_ADD_MAP_MID1,				//!< 中景 スクロールタイプ1
	GME_MAP_ADD_MAP_MID2,				//!< 中景 スクロールタイプ2
	GME_MAP_ADD_MAP_MID3,				//!< 中景 スクロールタイプ3

	GME_MAP_ADD_MAP_MAX
} GME_MAP_ADD_MAP;

#if _IPHONE
typedef enum tag_GME_MAP_DRAW_SIZE {
	GME_MAP_DRAW_SIZE_DEF = 0,	//!< 基本
	GME_MAP_DRAW_SIZE_HORI,		//!< 0 or 180
	GME_MAP_DRAW_SIZE_VERT,		//!< 90 or 270
	GME_MAP_DRAW_SIZE_ZONE1_BOSS,	//!< BOSS1
	GME_MAP_DRAW_SIZE_ZONE2_BOSS,	//!< BOSS2
	GME_MAP_DRAW_SIZE_ZONE3_BOSS,	//!< BOSS3
	GME_MAP_DRAW_SIZE_ZONE4_BOSS,	//!< BOSS4
	GME_MAP_DRAW_SIZE_ZONE4_BOSS_2,	//!< BOSS4_2
	GME_MAP_DRAW_SIZE_ZONEF_BOSS,	//!< BOSSF
	
	GME_MAP_DRAW_SIZE_NUM //!< 総数
} GME_MAP_DRAW_SIZE;
#endif // _IPHONE

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// データ構築
// ==========================================================================
// ==========================================================================
// GmMapBuildDataInit
/*!
 *	マップデータ構築 準備
 */
// ==========================================================================
extern void GmMapBuildDataInit(void);

// ==========================================================================
// GmMapBuildDataLoop
/*!
 *	マップデータ構築
 *
 *	@return	TRUE : ビルド終了
 */
// ==========================================================================
extern BOOL GmMapBuildDataLoop(void);

// ==========================================================================
// GmMapBuildColData
/*!
 *	マップ地形データ構築
 */
// ==========================================================================
extern void GmMapBuildColData(void);

// ==========================================================================
// GmMapFlushData
/*!
 *	マップデータ開放
 */
// ==========================================================================
extern void GmMapFlushData(void);

// ==========================================================================
// GmMapFlushDataLoop
/*!
 *	マップデータ片付けループ
 *
 *	@return	TRUE : 片付け終了
 */
// ==========================================================================
extern BOOL GmMapFlushDataLoop(void);

// ==========================================================================
// GmMapFlushColData
/*!
 *	マップ地形データ開放
 */
// ==========================================================================
extern void GmMapFlushColData(void);

// ==========================================================================
// GmMapDataRelease
/*!
 *	マップデータ開放
 */
// ==========================================================================
extern void GmMapRelease(void);

// ==========================================================================
// 初期化
// ==========================================================================
// ==========================================================================
// GmMapInit
/*!
 *	マップ初期化
 */
// ==========================================================================
extern void GmMapInit(void);

// ==========================================================================
// 終了処理
// ==========================================================================
// ==========================================================================
// GmMapExit
/*!
 *	マップ終了処理
 */
// ==========================================================================
extern void GmMapExit(void);

// ==========================================================================
// GmMapSetDrawState
/*!
 *	マップ描画コマンドステート設定
 *
 *	@param	command_state	[in]	GmMapDrawMap 使用時の描画コマンドステートを設定
 *
 *	@note
 *		初期設定は OBD_DRAW_CMD_STATE_3DNN です。
 */
// ==========================================================================
extern void GmMapSetDrawState(u32 command_state);

// ==========================================================================
// GmMapSetDrawMarginNormal
/*!
 *	マップ描画範囲補正設定 通常状態
 *
 *	@note
 *		描画時範囲補正値を通常状態値にします。
 */
// ==========================================================================
extern void GmMapSetDrawMarginNormal(void);

// ==========================================================================
// GmMapSetDrawMarginMag
/*!
 *	マップ描画範囲補正設定 範囲拡大状態
 *
 *	@note
 *		描画時範囲補正値を範囲拡大状態にします
 */
// ==========================================================================
extern void GmMapSetDrawMarginMag(void);

// ==========================================================================
// GmMapDrawMap
/*!
 *	マップ描画
 *
 *	@param	obj3d_tbl	[in]	描画するマップ描画オブジェクトワークテーブル
 *	@param	mp_header	[in]	描画するマップ MPデータ
 *	@param	md_header	[in]	描画するマップ MDデータ
 *	@param	pos_x		[in]	描画領域 左上基点 X (2D座標系)
 *	@param	pos_y		[in]	描画領域 左上基点 Y (2D座標系)
 *	@param	trans_x		[in]	移動量 (3D座標系)
 *	@param	trans_y		[in]	移動量 (3D座標系)
 *	@param	trans_z		[in]	移動量 (3D座標系)
 *	@param	loop_h		[in]	横描画領域がはみ出した時にループ描画する
 */
// ==========================================================================
extern void GmMapDrawMap(OBS_ACTION3D_NN_WORK *obj3d_tbl, MP_HEADER *mp_header, MD_HEADER *md_header, float pos_x, float pos_y,
				  float trans_x, float trans_y, float trans_z, BOOL loop_h = FALSE);

// ==========================================================================
// 追加背景用カメラ管理
// ==========================================================================
// ==========================================================================
// GmMapSetAddMapXLoop
/*!
 *	追加マップ (超近景 中景色) 横ループあり
 */
// ==========================================================================
extern void GmMapSetAddMapXLoop(void);

// ==========================================================================
// GmMapEnableAddMapUserScrlX
/*!
 *	追加マップ (超近景 中景色) ユーザー設定横方向スクロール値使用
 */
// ==========================================================================
extern void GmMapEnableAddMapUserScrlX(void);

// ==========================================================================
// GmMapDisenableAddMapUserScrlX
/*!
 *	追加マップ (超近景 中景色) ユーザー設定横方向スクロール値無効
 */
// ==========================================================================
extern void GmMapDisenableAddMapUserScrlX(void);

// ==========================================================================
// GmMapSetAddMapScrlScaleX
/*!
 *	追加マップ (超近景 中景) スクロールスケール 倍率設定
 *
 *	@note
 *		通常 mag == 1
 */
// ==========================================================================
extern void GmMapSetAddMapScrlScaleMagX(GME_MAP_ADD_MAP map_type, s32 mag);

// ==========================================================================
// GmMapSetAddMapUserScrlXAddSize
/*!
 *	追加マップ (超近景 中景色) ユーザー設定横方向スクロール値使用
 *
 *	@param	move_size	[in]	メインカメラ移動量
 */
// ==========================================================================
extern void GmMapSetAddMapUserScrlXAddSize(float move_size);

// ==========================================================================
// GmMapGetAddMapCameraPos
/*!
 *	メインカメラから追加背景用カメラ位置取得
 *
 *	@param	main_camera_pos [in]	メインカメラ座標
 *	@param	dest_camera		[out]	超近景用座標
 *	@param	camera_id		[in]	カメラID
 */
// ==========================================================================
//extern void GmMapGetAddMapCameraPos(const NNS_VECTOR *main_camera_pos, NNS_VECTOR *dest_camera, s32 camera_id);
extern void GmMapGetAddMapCameraPos(const NNS_VECTOR *main_disp_pos, const NNS_VECTOR *main_target_pos,
				NNS_VECTOR *dest_disp_pos, NNS_VECTOR *dest_target_pos, s32 camera_id);
	
// ==========================================================================
// GmMapIsDrawEnableMMapBack
/*!
 *	M面以降を描画するか否か
 *
 *  @return TRUE:描画する　FALSE:しない
 *
 *  @note メインカメラ位置から描画するか否かを判定します。
 */
// ==========================================================================
extern BOOL GmMapIsDrawEnableMMapBack(void);

// ==========================================================================
// GmMapSetDispB
/*!
 *	マップ表示設定
 *
 *	@param	disp	[in]	表示設定 TRUE : 表示  FALSE : 非表示
 */
// ==========================================================================
extern void GmMapSetDispB(BOOL disp);

// ==========================================================================
// GmMapSetDisp
/*!
 *	マップ全体表示設定
 *
 *	@param	disp	[in]	表示設定 TRUE : 表示  FALSE : 非表示
 */
// ==========================================================================
extern void GmMapSetDisp(BOOL disp);

// ==========================================================================
// ライトセット
// ==========================================================================
// ==========================================================================
// GmMapSetLight
/*!
 *	マップライト設定 (NNE_LIGHT_5 を使用)
 */
// ==========================================================================
extern void GmMapSetLight(void);
	
// ==========================================================================
// GmMapSetMapDrawSize
/*!
 *	マップの生成範囲を設定する
 *
 * @param size GME_MAP_DRAW_SIZEで定義される値
 */
// ==========================================================================
	extern void GmMapSetMapDrawSize(GME_MAP_DRAW_SIZE size);
	
	
#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_MAP_H_

//----- Include Files -------------------------------------------------------
