// ================================================================
/*!
  @file gmObj.h
  @brief メインゲーム オブジェクト関連処理

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmObj.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ================================================================
/*
 * Memo
 *
 */

#ifndef GM_OBJ_H_
#define GM_OBJ_H_

//----- Include Files -------------------------------------------------------
#include "objObject.h"
#include "gmObjDef.h"

#if	defined(__cplusplus)
extern "C" {
#endif


//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// 汎用処理
// ==========================================================================
// ==========================================================================
// GmObjCollision
/*!
 *	あたりチェック
 *
 *	@param	obj_work	[in]	オブジェクトワーク
 *
 *	@note
 *		g_obj.ppCollision に設定
 */
// ==========================================================================
extern void GmObjCollision(OBS_OBJECT_WORK *obj_work);

// ==========================================================================
// GmObjDrawSort
/*!
 *	描画ソート処理
 *
 *	@note
 *		g_obj.ppDrawSort に設定
 */
// ==========================================================================
extern void GmObjDrawSort(void);

// ==========================================================================
// GmObjPreFunc
/*!
 *	オブジェクトシステム 前処理
 *
 *	@note
 *		g_obj.ppPre に設定
 */
// ==========================================================================
extern void GmObjPreFunc(void);

// ==========================================================================
// GmObjRegistRectAuto
/*!
 *	自動矩形登録
 *
 *	@param	obj_work	[in]	オブジェクトワーク
 *
 *	@note
 *		g_obj.ppRegRecAuto に設定
 */
// ==========================================================================
extern void GmObjRegistRectAuto(OBS_OBJECT_WORK *obj_work);

// ==========================================================================
// GmObjObjPreFunc
/*!
 *	オブジェクトシステム オブジェクト共通前処理
 *
 *	@note
 *		g_obj.ppObjPre に設定
 */
// ==========================================================================
extern void GmObjObjPreFunc(OBS_OBJECT_WORK *obj_work);

// ==========================================================================
// GmObjObjPostFunc
/*!
 *	オブジェクトシステム オブジェクト共通後処理
 *
 *	@note
 *		g_obj.ppObjPost に設定
 */
// ==========================================================================
extern void GmObjObjPostFunc(OBS_OBJECT_WORK *obj_work);

// ==========================================================================
// GmObjActionCallBackSetRect
/*!
 *	アクションコールバックでの矩形情報設定
 *
 *	@param	cmd_rect	[in]	矩形コマンド情報
 *	@param	rect_work	[in]	設定する矩形ワーク
 */
// ==========================================================================
//extern void GmObjActionCallBackSetRect(const MTS_ACT_COMMAND_RECT *cmd_rect, OBS_RECT_WORK *rect_work);

// ==========================================================================
// 矩形
// ==========================================================================

// ==========================================================================
// Utility
// ==========================================================================
// ==========================================================================
// GmObjCheckMapLeftLimit
/*!
 *	オブジェクトがMAP左端にあるかチェック
 *
 *	@param	obj_work	[in]	オブジェクトワーク
 *	@param	ofst		[in]	MAP端判定オフセット
 *
 *	@return	TRUE : オブジェクトが画面左端にある
 */
// ==========================================================================
extern BOOL GmObjCheckMapLeftLimit(OBS_OBJECT_WORK *obj_work, s32 ofst);

// ==========================================================================
// GmObjCheckMapRightLimit
/*!
 *	オブジェクトがMAP右端にあるかチェック
 *
 *	@param	obj_work	[in]	オブジェクトワーク
 *	@param	ofst		[in]	MAP端判定オフセット
 *
 *	@return	TRUE : オブジェクトが画面右端にある
 */
// ==========================================================================
extern BOOL GmObjCheckMapRightLimit(OBS_OBJECT_WORK *obj_work, s32 ofst);

// ==========================================================================
// GmObjSetClip
/*!
 *	画面外クリッピング設定
 *
 *	@param	obj_work	[inout]	オブジェクトワーク
 *	@param	out_ofst	[in]	クリップ範囲オフセット
 *	@parma	plus_top	[in]	クリップ範囲オフセット加算値 LEFT
 *	@parma	plus_left	[in]	クリップ範囲オフセット加算値 TOP
 *	@parma	plus_right	[in]	クリップ範囲オフセット加算値 RIGHT
 *	@parma	plus_bottom	[in]	クリップ範囲オフセット加算値 BOTTOM
 */
// ==========================================================================
extern void GmObjSetClip(OBS_OBJECT_WORK *obj_work, s16 out_ofst, s16 plus_left, s16 plus_top, s16 plus_right, s16 plus_bottom);

// ==========================================================================
// GmObjGetRotPosXY
/*!
 *	XY座標を指定の角度で回転した座標を取得する
 *
 *	@param	pos_x		[in]	回転する元座標X
 *	@param	pos_y		[in]	回転する元座標Y
 *	@param	dest_x		[in]	回転後の座標Xを格納するバッファ(NULL不可)
 *	@param	dest_y		[in]	回転後の座標Yを格納するバッファ(NULL不可)
 *	@param	dir			[in]	回転角度
 *
 *	@note
 *		dest_x, dest_y は必ず指定する事\n
 *		dir == 0 でも計算するので、必要ならば外でチェックする事
 */
// ==========================================================================
extern void GmObjGetRotPosXY(fx32 pos_x, fx32 pos_y, fx32 *dest_x, fx32 *dest_y, u16 dir);

// ==========================================================================
// GmObjSetAllObjectNoDisp
/*!
 *	存在するすべてのオブジェクトをNODISPにする
 */
// ==========================================================================
extern void GmObjSetAllObjectNoDisp(void);

// ==========================================================================
// GmObjSetObjectNoFunc
/*!
 *	指定のオブジェクトタイプのオブジェクトの処理をNOFUNCにする
 *
 *	@param	obj_type_flag [in]	オブジェクトタイプフラグ
 *
 *	@note
 *		オブジェクトタイプフラグは、obj_typeでシフトしたフラグを使う\n
 *		(1 << obj_type1) | (1 << obj_type2) | (1 << obj_type3) ....\n
 *		最上位ビットは使えません
 */
// ==========================================================================
extern void GmObjSetObjectNoFunc(u32 obj_type_flag);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_OBJ_H_

//----- Include Files -------------------------------------------------------
