// =======================================================================
/*!
  @file	gmOver.h
  @brief ゲームオーバー・タイムーオーバー演出

  @author Keisuke Tanaka
 				Copyright(c) 2009 Dimps
  $Id: gmOver.h 2 2011-04-11 05:21:26Z thamada $
 */
// =======================================================================
/*
 * $Log$
 */

/* 重複インクルード回避手法 */

#ifndef GM_OVER_H_
#define GM_OVER_H_

#if	defined(__cplusplus)
extern "C" {
#endif

/*------ Include Files -------------------------------------------------*/

/*------ Macros --------------------------------------------------------*/

/*------ Macro Functions -----------------------------------------------*/

/*------ Definitions ---------------------------------------------------*/
//! デモタイプ列挙型
typedef enum
{
	GME_OVER_TYPE_GAMEOVER	= 0,	//!< ゲームオーバー
	GME_OVER_TYPE_TIMEOVER,			//!< タイムオーバー
	
	GME_OVER_TYPE_MAX
} GME_OVER_TYPE;

/*------ External Declarations -----------------------------------------*/
// =======================================================================
// GmOverBuildDataInit
/*!
  テクスチャビルド開始
 */
// =======================================================================
extern void GmOverBuildDataInit(void);

// =======================================================================
// GmOverBuildDataLoop
/*!
  テクスチャビルド完了待ち
  
  @retval TRUE	ビルド完了
  @retval FALSE	ビルド中
 */
// =======================================================================
extern BOOL GmOverBuildDataLoop(void);

// =======================================================================
// GmOverFlushDataInit
/*!
  テクスチャフラッシュ開始
 */
// =======================================================================
extern void GmOverFlushDataInit(void);

// =======================================================================
// GmOverFlushDataLoop
/*!
  テクスチャフラッシュ完了待ち
  
  @retval TRUE	フラッシュ完了
  @retval FALSE	フラッシュ中
 */
// =======================================================================
extern BOOL GmOverFlushDataLoop(void);

// =======================================================================
// GmOverStart
/*!
  ゲーム／タイムオーバー開始
  
  @param type	[in]	デモタイプ(GME_OVER_TYPE_XXX)
 */
// =======================================================================
extern void GmOverStart(GME_OVER_TYPE type);

// =======================================================================
// GmOverExit
/*!
  ゲーム／タイムオーバー終了
 */
// =======================================================================
extern void GmOverExit(void);


// =======================================================================
// test_func
/*!
  関数機能
 
  @param param0 [in] 入力引数0説明
  @param param1 [out] 出力ポインタ引数1説明
  @param param2 [io] 入出力ポインタ引数2説明
 
  @return 返値説明
 
  @note
  補足説明
 */
// =======================================================================

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif /* GM_OVER_H_ */
