// ===========================================================================
/*!
	@file	gmPauseMenu.h
	@brief	アクト中ポーズメニューUIモジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）

// ===========================================================================
//	enum GME_PMENU_RESULT
// ---------------------------------------------------------------------------
//!	ポーズメニュー結果列挙
// ===========================================================================
typedef enum tag_GME_PMENU_RESULT {
	GME_PMENU_RESULT_RETRY		= 0,	//!< リトライ

#if !_WII
	GME_PMENU_RESULT_OPTION,			//!< 遊び方&オプション
#endif // !_WII

#if _PC || _XBOX
	GME_PMENU_RESULT_RANKING,			//!< ランキング
	GME_PMENU_RESULT_TROPHY,			//!< 実績
#endif // _PC || _XBOX

	GME_PMENU_RESULT_BACK,				//!< ワールドマップに戻る
	GME_PMENU_RESULT_MAINMENU,			//!< メインメニューに戻る

	GME_PMENU_RESULT_CANCEL,			//!< キャンセル

	GME_PMENU_RESULT_NUM,				//!< 結果数
	GME_PMENU_RESULT_NONE,				//!< 無効コード
} GME_PMENU_RESULT;

// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ***************************************************************************
// リソース管理
// ***************************************************************************
// ===========================================================================
//	GmPauseMenuLoadStart
/*!
	リソースファイル読み込み開始

	@note
	ポーズメニューに必要なファイルの読み込みを開始します。\n
	この関数は即時復帰となります。\n
	完了判定はGmPauseMenuLoadIsFinished関数で行うようにして下さい。\n
	既に読み込みを開始している場合に呼び出すと、アサートし何も行いません。\n
	GmPauseMenuLoadIsFinished関数がTRUEを返す状態で呼び出すと、
	アサートし何も行いません。\n
*/
// ===========================================================================
extern void GmPauseMenuLoadStart(void);

// ===========================================================================
//	GmPauseMenuLoadIsFinished
/*!
	リソースファイル読み込み完了判定

	@return 真：完了済み　偽：それ以外
	@note
	GmPauseMenuLoadStart関数で開始したファイル読み込みが
	完了したかどうかを判定します。\n
	GmPauseMenuLoadStart関数を呼び出す前と、
	GmPauseMenuRelease関数を呼び出した後は、は常にFALSEを返します。\n
*/
// ===========================================================================
extern BOOL GmPauseMenuLoadIsFinished(void);

// ===========================================================================
//	GmPauseMenuBuildStart
/*!
	リソース構築開始

	@note
	ポーズメニューに必要なリソースの構築を開始します。\n
	この関数は即時復帰となります。\n
	完了判定はGmPauseMenuBuildIsFinished関数で行うようにして下さい。\n
	GmPauseMenuLoadIsFinished関数がFALSEを返す状態では
	呼び出すことはできません。\n
	(呼び出した場合はアサートし何も行いません。)\n
	既に構築を開始している場合に呼び出すと、アサートし何も行いません。\n
	GmPauseMenuBuildIsFinished関数がTRUEを返す状態で呼び出すと、
	アサートし何も行いません。\n
*/
// ===========================================================================
extern void GmPauseMenuBuildStart(void);

// ===========================================================================
//	GmPauseMenuBuildIsFinished
/*!
	リソース構築完了判定

	@return 真：完了済み　偽：それ以外
	@note
	GmPauseMenuBuildStart関数で開始した構築処理が
	完了したかどうかを判定します。\n
	GmPauseMenuBuildStart関数を呼び出す前と、
	GmPauseMenuFlushStart関数を呼び出した後は、は常にFALSEを返します。\n
*/
// ===========================================================================
extern BOOL GmPauseMenuBuildIsFinished(void);

// ===========================================================================
//	GmPauseMenuFlushStart
/*!
	リソース解放開始

	@note
	ポーズメニューに必要なリソースの解放を開始します。\n
	この関数は即時復帰となります。\n
	完了判定はGmPauseMenuFlushIsFinished関数で行うようにして下さい。\n
	GmPauseMenuBuildIsFinished関数がFALSEを返す状態では
	呼び出すことはできません。\n
	(呼び出した場合はアサートし何も行いません。)\n
	既に解放を開始している場合に呼び出すと、アサートし何も行いません。\n
	GmPauseMenuFlushIsFinished関数がTRUEを返す状態で呼び出すと、
	アサートし何も行いません。\n
*/
// ===========================================================================
extern void GmPauseMenuFlushStart(void);

// ===========================================================================
//	GmPauseMenuFlushIsFinished
/*!
	リソース解放完了判定

	@return 真：完了済み　偽：それ以外
	@note
	GmPauseMenuFlushStart関数で開始した解放処理が
	完了したかどうかを判定します。\n
	GmPauseMenuFlushStart関数を呼び出す前と、
	GmPauseMenuBuildStart関数を呼び出した後は、は常にFALSEを返します。\n
*/
// ===========================================================================
extern BOOL GmPauseMenuFlushIsFinished(void);

// ===========================================================================
//	GmPauseMenuRelease
/*!
	リソースファイル解放

	@note
	ポーズメニューに必要なファイルの解放を行います。\n
	この関数は完了復帰となります。\n
	GmPauseMenuFlushIsFinished関数がFALSEを返す状態では
	呼び出すことはできません。\n
	(呼び出した場合はアサートし何も行いません。)\n
	既に解放済みの場合は何も行いません。\n
*/
// ===========================================================================
extern void GmPauseMenuRelease(void);


// ***************************************************************************
// 実行
// ***************************************************************************
// ===========================================================================
//	GmPauseMenuStart
/*!
	ポーズメニュー開始

	@param prio		[in] メインタスク優先度
	@note
	ポーズメニューを開始します。\n
	以降、GmPauseMenuIsFinished関数がTRUEを返すまで、
	内部でポーズメニュー処理を進めます。\n
*/
// ===========================================================================
extern void GmPauseMenuStart(u32 prio);

// ===========================================================================
//	GmPauseMenuCancel
/*!
	ポーズメニューキャンセル

	@note
	GmPauseMenuStart関数で開始したポーズメニュー処理を強制的に終了させます。\n
	メニューがどのような状態であっても、即時に終了するので、
	リセット時などを除き、通常は使用しないで下さい。\n
	この関数を呼び出した場合、GmPauseMenuGetResult関数で取得できる結果は、
	必ずGME_PMENU_RESULT_CANCELとなります。\n
	この関数を呼び出した直後から、
	GmPauseMenuIsFinished関数がTRUEを返すようになります。\n
*/
// ===========================================================================
extern void GmPauseMenuCancel(void);

// ===========================================================================
//	GmPauseMenuIsFinished
/*!
	ポーズメニュー完了判定

	@note
	GmPauseMenuStart関数で開始したポーズメニュー処理が
	完了したかを判定します。\n
	GmPauseMenuStart関数呼び出し前はTRUEを返します。\n
*/
// ===========================================================================
extern BOOL GmPauseMenuIsFinished(void);

// ===========================================================================
//	GmPauseMenuGetResult
/*!
	ポーズメニュー結果取得

	@note
	GmPauseMenuStart関数で開始したポーズメニューにおいて、
	ユーザが何を選択したかを返します。\n
	この関数はGmPauseMenuIsFinished関数がTRUEを返す状態で呼び出して下さい。\n
	それ以外の状態で呼び出すとアサートしGME_PMENU_RESULT_NONEを返します。\n
	GmPauseMenuStart関数を呼び出す前に呼び出した場合は
	GME_PMENU_RESULT_NONEを返します。\n
*/
// ===========================================================================
extern GME_PMENU_RESULT GmPauseMenuGetResult(void);


#if defined(MTD_DEBUG)

// ***************************************************************************
// デバッグ
// ***************************************************************************
// ===========================================================================
//! ポーズメニュー確認用イベント開始
// ===========================================================================
extern void GmPauseMenuDebugEventStart(void* arg);

#endif // defined(MTD_DEBUG)

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
