// ==========================================================================
/*!
  @file gmPlyEfct.h
  @brief プレイヤーエフェクト

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmPlyEfct.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_PLY_EFCT_H_
#define GM_PLY_EFCT_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------
/// 軌跡エフェクトタイプ GmPlyEfctCreateTrail()
typedef enum tag_GME_PLY_EFCT_TRAIL_TYPE {
	GME_PLY_EFCT_TRAIL_TYPE_HOMING	= 0,
	GME_PLY_EFCT_TRAIL_TYPE_SPINDASH,

	GME_PLY_EFCT_TRAIL_TYPE_MAX
} GME_PLY_EFCT_TRAIL_TYPE;

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// 軌跡エフェクト
// ==========================================================================
// ==========================================================================
// GmPlyEfctTrailSysInit
/*!
 *	プレイヤー 軌跡エフェクトシステム初期化
 */
// ==========================================================================
extern void GmPlyEfctTrailSysInit(void);

// ==========================================================================
// GmPlyEfctTrailSysExit
/*!
 *	プレイヤー 軌跡エフェクトシステム終了処理
 */
// ==========================================================================
extern void GmPlyEfctTrailSysExit(void);

// ==========================================================================
// GmPlyEfctCreateTrail
/*!
 *	プレイヤー 軌跡エフェクト生成
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *	@param	efct_type	[in]	エフェクトタイプ GME_PLY_EFCT_TRAIL_TYPE
 */
// ==========================================================================
extern void GmPlyEfctCreateTrail(GMS_PLAYER_WORK *ply_work, GME_PLY_EFCT_TRAIL_TYPE efct_type);

// ==========================================================================
// バリアエフェクト
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateBarrier
/*!
 *	プレイヤー バリアエフェクト
 */
// ==========================================================================
extern void GmPlyEfctCreateBarrier(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 無敵エフェクト
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateInvincible
/*!
 *	プレイヤー 無敵エフェクト
 */
// ==========================================================================
extern void GmPlyEfctCreateInvincible(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 最速ダッシュ 回転足
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateInvincible
/*!
 *	最速ダッシュ 回転足
 */
// ==========================================================================
extern void GmPlyEfctCreateRollDash(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 汗
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateSweat
/*!
 *	汗
 */
// ==========================================================================
extern void GmPlyEfctCreateSweat(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 砂煙
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateRunDust
/*!
 *	走り 砂煙
 */
// ==========================================================================
extern void GmPlyEfctCreateRunDust(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateDash1Dust
/*!
 *	ダッシュ1 砂煙
 */
// ==========================================================================
extern void GmPlyEfctCreateDash1Dust(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateDash2Dust
/*!
 *	ダッシュ2 砂煙
 */
// ==========================================================================
extern void GmPlyEfctCreateDash2Dust(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateDash2Impact
/*!
 *	ダッシュ2 衝撃波
 */
// ==========================================================================
extern void GmPlyEfctCreateDash2Impact(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSpinDust
/*!
 *	その場スピン 砂煙
 */
// ==========================================================================
extern void GmPlyEfctCreateSpinDust(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSpinAddDust
/*!
 *	スピン加速 砂煙
 */
// ==========================================================================
extern void GmPlyEfctCreateSpinAddDust(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSpinDashImpact
/*!
 *	スピンダッシュ 衝撃波
 */
// ==========================================================================
extern void GmPlyEfctCreateSpinDashImpact(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSpinDashDust
/*!
 *	スピンダッシュ 砂煙
 */
// ==========================================================================
extern void GmPlyEfctCreateSpinDashDust(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSpinDashCircleBlur
/*!
 *	スピンダッシュ 円ブラー
 *
 *	@return	GMS_EFFECT_3DES_WORKワーク
 *
 *	@note
 *		user_timer	: アクションタイプ
 */
// ==========================================================================
extern void* GmPlyEfctCreateSpinDashCircleBlur(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSpinDashBlur
/*!
 *	スピンダッシュ ブラー
 *
 *	@param	type	[in]	0 : 大   1 : 小
 *
 *	@return	GMS_EFFECT_3DES_WORKワーク
 *
 *	@note
 *		user_timer	: アクションタイプ
 */
// ==========================================================================
extern void* GmPlyEfctCreateSpinDashBlur(GMS_PLAYER_WORK *ply_work, u32 type);

// ==========================================================================
// GmPlyEfctCreateBrakeImpact
/*!
 *	ブレーキ 衝撃波
 */
// ==========================================================================
extern void GmPlyEfctCreateBrakeImpact(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateBrakeDust
/*!
 *	ブレーキ 砂煙
 */
// ==========================================================================
extern void GmPlyEfctCreateBrakeDust(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateJumpDust
/*!
 *	ジャンプ 砂煙
 */
// ==========================================================================
extern void GmPlyEfctCreateJumpDust(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ZONE依存足元砂煙
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateInvincible
/*!
 *	プレイヤー ZONE依存足元砂煙
 */
// ==========================================================================
extern void GmPlyEfctCreateFootSmoke(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 水しぶき
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateSpray
/*!
 *	水しぶき
 *
 *	@note
 *		user_timer	: エフェクト生成間隔
 */
// ==========================================================================
extern void GmPlyEfctCreateSpray(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 泡
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateBubble
/*!
 *	泡
 *
 *	@note
 *		user_timer	: エフェクト生成間隔
 */
// ==========================================================================
extern void GmPlyEfctCreateBubble(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 水中死亡前カウンタ
// ==========================================================================
// ==========================================================================
// GmPlyEfctWaterCount
/*!
 *	水中死亡前カウンタ
 *
 *	@param	no	[in]	生成するNO 0 ～ 4(1 ～ 5)
 *
 *	@note
 *		user_timer	: 生存時間
 */
// ==========================================================================
extern void GmPlyEfctWaterCount(GMS_PLAYER_WORK *ply_work, u32 no);

// ==========================================================================
// 水中死亡
// ==========================================================================
// ==========================================================================
// GmPlyEfctWaterDeath
/*!
 *	水中死亡
 */
// ==========================================================================
extern void GmPlyEfctWaterDeath(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 走り水しぶき
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateRunSpray
/*!
 *	走り水しぶき
 */
// ==========================================================================
extern void GmPlyEfctCreateRunSpray(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ホーミング
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateHomingImpact
/*!
 *	ホーミング衝撃波
 *
 *	@note
 *		user_timer	: エフェクト生成間隔
 */
// ==========================================================================
extern void GmPlyEfctCreateHomingImpact(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateHomingCursol
/*!
 *	ホーミング カーソル
 */
// ==========================================================================
extern void GmPlyEfctCreateHomingCursol(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ジャンプダッシュ
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateJumpDash
/*!
 *	ジャンプダッシュエフェクト
 *
 *	@note
 *		移動速度設定後に呼び出し
 */
// ==========================================================================
extern void GmPlyEfctCreateJumpDash(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// スピン移行
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateSpinStartBlur
/*!
 *	スピン開始ブラー
 *
 *	@return	GMS_EFFECT_3DES_WORKワーク
 *
 *	@note
 *		user_timer	: スピンブラーフレーム
 *		user_work	: アクションタイプ
 */
// ==========================================================================
extern void* GmPlyEfctCreateSpinStartBlur(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// スピンジャンプ
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateSpinJumpBlur
/*!
 *	スピンジャンプ ブラー
 *
 *	@return	GMS_EFFECT_3DES_WORKワーク
 *
 *	@note
 *		user_timer	: アクションタイプ
 */
// ==========================================================================
extern void* GmPlyEfctCreateSpinJumpBlur(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// スーパーソニックオーラ
// ==========================================================================
// ==========================================================================
// GmPlyEfctCreateSuperStart
/*!
 *	スーパーソニック開始
 */
// ==========================================================================
extern void GmPlyEfctCreateSuperStart(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSuperEnd
/*!
 *	スーパーソニック終了
 */
// ==========================================================================
extern void GmPlyEfctCreateSuperEnd(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSuperAuraDeco
/*!
 *	スーパーソニックオーラ 装飾
 */
// ==========================================================================
extern void GmPlyEfctCreateSuperAuraDeco(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSuperAuraBase
/*!
 *	スーパーソニックオーラ ベース
 */
// ==========================================================================
extern void GmPlyEfctCreateSuperAuraBase(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSuperAuraSpin
/*!
 *	スーパーソニックオーラ スピン
 */
// ==========================================================================
extern void GmPlyEfctCreateSuperAuraSpin(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSuperAuraDash
/*!
 *	スーパーソニックオーラ ダッシュ
 */
// ==========================================================================
extern void GmPlyEfctCreateSuperAuraDash(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlyEfctCreateSteamPipe
/*!
 *	プレイヤー スチームパイプ導入時エフェクト
 */
// ==========================================================================
extern void GmPlyEfctCreateSteamPipe(GMS_PLAYER_WORK *ply_work);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_PLY_EFCT_H_

//----- Include Files -------------------------------------------------------
