// ==========================================================================
/*!
  @file gmPlySeq.h
  @brief 

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmPlySeq.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_PLY_SEQ_H_
#define GM_PLY_SEQ_H_


//----- Include Files -------------------------------------------------------
#include "gmPlayer.h"
#include "gmPlayerDat.h"
#include "gmPlySeqDat.h"

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------
/// シーケンス初期化処理テーブル
//extern void (*const g_gm_ply_seq_init_tbl[GSD_CHAR_ID_MAX][GME_PLY_SEQ_STATE_MAX])(GMS_PLAYER_WORK*);
extern void (*const *g_gm_ply_seq_init_tbl_list[GSD_CHAR_ID_MAX])(GMS_PLAYER_WORK*);

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmPlySeqSetSeqState
/*!
 *	シーケンス 必要ステータス設定
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqSetSeqState(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqMain
/*!
 *	シーケンスメイン処理
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *
 *	@note
 *		現在の状況・入力によって、シーケンス変更チェックを行ったりします。
 */
// ==========================================================================
extern void GmPlySeqMain(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqChangeSequence
/*!
 *	シーケンス変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *	@param	seq_state	[in]	シーケンスタイプ
 *
 *	@return	TRUE : シーケンス変更
 */
// ==========================================================================
extern BOOL GmPlySeqChangeSequence(GMS_PLAYER_WORK *ply_work, GME_PLY_SEQ_STATE seq_state);

// ==========================================================================
// GmPlySeqChangeSequenceState
/*!
 *	シーケンスステート変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *	@param	seq_state	[in]	シーケンスタイプ
 *
 *	@note
 *		ギミック用にシーケンスステートのみ置き換えます
 */
// ==========================================================================
extern void GmPlySeqChangeSequenceState(GMS_PLAYER_WORK *ply_work, GME_PLY_SEQ_STATE seq_state);

// ==========================================================================
// プログラムターン
// ==========================================================================
// ==========================================================================
// GmPlySeqSetProgramTurn
/*!
 *	プログラム 振り向き設定
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *	@parma	turn_spd	[in]	ターン速度
 */
// ==========================================================================
extern void GmPlySeqSetProgramTurn(GMS_PLAYER_WORK *ply_work, u16 turn_spd);

// ==========================================================================
// GmPlySeqSetProgramTurnTbl
/*!
 *	プログラム 振り向き設定 テーブルタイプ
 *
 *	@param	ply_work		[in]	プレイヤーワーク
 *	@parma	turn_tbl		[in]	ターン角度テーブル
 *	@parma	tbl_num			[in]	ターンテーブルデータ数
 *	@param	rev_depend_mtn	[in]	モーション依存タイプターン
 */
// ==========================================================================
extern void GmPlySeqSetProgramTurnTbl(GMS_PLAYER_WORK *ply_work, u16 *turn_tbl, s32 tbl_num, BOOL rev_depend_mtn);

// ==========================================================================
// GmPlySeqSetProgramTurnFwTurn
/*!
 *	プログラム 振り向き設定 FW時ターン
 *
 *	@param	ply_work		[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqSetProgramTurnFwTurn(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 落下ターン
// ==========================================================================
// ==========================================================================
// GmPlySeqSetFallTurn
/*!
 *	プログラム 落下振り向き設定
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *	@parma	turn_spd	[in]	ターン速度
 */
// ==========================================================================
extern void GmPlySeqSetFallTurn(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// FW
// ==========================================================================
// ==========================================================================
// GmPlySeqChangeFw
/*!
 *	FWへ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqChangeFw(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitFw
/*!
 *	FW 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitFw(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 歩き
// ==========================================================================
// ==========================================================================
// GmPlySeqInitWalk
/*!
 *	歩き 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitWalk(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ターン
// ==========================================================================
// ==========================================================================
// GmPlySeqInitTurn
/*!
 *	振り向き 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitTurn(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 見上げ
// ==========================================================================
// ==========================================================================
// GmPlySeqInitLookupStart
/*!
 *	見上げ開始 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitLookupStart(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitLookupMiddle
/*!
 *	見上げ中 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitLookupMiddle(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitLookupEnd
/*!
 *	見上げ終了 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitLookupEnd(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// しゃがみ
// ==========================================================================
// ==========================================================================
// GmPlySeqInitSquatStart
/*!
 *	しゃがみ開始 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitSquatStart(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitSquatMiddle
/*!
 *	しゃがみ中 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitSquatMiddle(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitSquatEnd
/*!
 *	しゃがみ終了 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitSquatEnd(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ブレーキ
// ==========================================================================
// ==========================================================================
// GmPlySeqInitBrake
/*!
 *	ブレーキ 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitBrake(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// スピン
// ==========================================================================
// ==========================================================================
// GmPlySeqInitSpin
/*!
 *	スピン 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitSpin(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// スピンダッシュ
// ==========================================================================
// ==========================================================================
// GmPlySeqInitSpinDashAcc
/*!
 *	スピン加速 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitSpinDashAcc(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitSpinDash
/*!
 *	スピンダッシュ 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitSpinDash(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// よろけ
// ==========================================================================
// ==========================================================================
// GmPlySeqInitStaggerFront
/*!
 *	よろけ前 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitStaggerFront(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitStaggerBack
/*!
 *	よろけ後ろ 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitStaggerBack(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitStaggerDanger
/*!
 *	よろけ危険 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitStaggerDanger(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 落下
// ==========================================================================
// ==========================================================================
// GmPlySeqInitFall
/*!
 *	落下 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitFall(GMS_PLAYER_WORK *ply_work);
extern void GmPlySeqInitFallState(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ジャンプ
// ==========================================================================
// ==========================================================================
// GmPlySeqInitJump
/*!
 *	ジャンプ 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitJump(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqAtkReactionInit
/*!
 *	攻撃跳ね返り 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqAtkReactionInit(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqSetJumpState
/*!
 *	ジャンプ ステータス初期化
 *
 *	@param	ply_work		[in]	プレイヤーワーク
 *	@param	nofall_timer	[in]	FALL計算を行わない時間
 *	@param	flag			[in]	各種設定フラグ GMD_PLY_SEQ_SETJUMPSTATE_***
 *
 *	@note
 *		ジャンプシーケンス用のステータス設定を行い、\n
 *		処理をジャンプ(gmPlySeqJumpMain)に切り替えます
 */
// ==========================================================================
extern void GmPlySeqSetJumpState(GMS_PLAYER_WORK *ply_work, s32 nofall_timer, u32 flag);
// 以下フラグ
#define GMD_PLY_SEQ_SETJUMPSTATE_IGNORE_JUMPBTN	(1 << 0)	//!< ジャンプボタン無視
#define GMD_PLY_SEQ_SETJUMPSTATE_GMK_JUMP		(1 << 1)	//!< ギミックジャンプ
#define GMD_PLY_SEQ_SETJUMPSTATE_NOHOMING		(1 << 2)	//!< ホーミング不可に
#define GMD_PLY_SEQ_SETJUMPSTATE_NOJUMPMOVE		(1 << 3)	//!< ジャンプ中移動不可に

// ================================================================
// GmPlySeqSetNoJumpMoveTime
/*!
 *	ジャンプ中移動不可時間設定
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *	@param	time		[in]	ジャンプ中移動不可時間
 *
 *	@note
 *		//GmPlySeqSetJumpState で GMD_PLY_SEQ_SETJUMPSTATE_NOJUMPMOVE を有効にした場合に\n
 *		//有効時間を設定します。
 *		//GmPlySeqSetJumpState の後に設定してください。
 *		GMD_PLF_NOJUMPMOVE も設定します。
 *
 */
// ==========================================================================
inline void GmPlySeqSetNoJumpMoveTime(GMS_PLAYER_WORK *ply_work, fx32 time)
{
	MTM_ASSERT(time >= 0);
	ply_work->no_jump_move_timer = time;
	ply_work->player_flag |= GMD_PLF_NOJUMPMOVE;
}

// ==========================================================================
// GmPlySeqInitJumpEX
/*!
 *	ジャンプ 特殊初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *	@param	spd_x		[in]	ジャンプ速度X
 *	@param	spd_y		[in]	ジャンプ速度Y
 */
// ==========================================================================
extern void GmPlySeqInitJumpEX(GMS_PLAYER_WORK *ply_work, fx32 spd_x, fx32 spd_y);

// ==========================================================================
// GmPlySeqAtkReactionInit
/*!
 *	攻撃跳ね返り 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *
 *	@note
 *		spd.x, spd_m は、初期化前の速度を維持する
 */
// ==========================================================================
extern void GmPlySeqAtkReactionInit(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqAtkReactionSpdInit
/*!
 *	攻撃跳ね返り 速度設定つき 初期化
 *
 *	@param	ply_work			[in]	プレイヤーワーク
 *	@param	spd_x				[in]	速度X
 *	@param	no_spddown_timer	[in]	スピードダウンなし時間
 */
// ==========================================================================
extern void GmPlySeqAtkReactionSpdInit(GMS_PLAYER_WORK *ply_work, fx32 spd_x, fx32 no_spddown_timer);


// ==========================================================================
// 壁押し
// ==========================================================================
// ==========================================================================
// GmPlySeqInitWallPush
/*!
 *	壁押し 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitWallPush(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ホーミング
// ==========================================================================
// ==========================================================================
// GmPlySeqInitHoming
/*!
 *	ホーミング 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitHoming(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ホーミング跳ね返り
// ==========================================================================
// ==========================================================================
// GmPlySeqInitHomingRef
/*!
 *	ホーミング跳ね返り 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitHomingRef(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ジャンプダッシュ(ホーミングできなかった時)
// ==========================================================================
// ==========================================================================
// GmPlySeqInitJumpDash
/*!
 *	ジャンプダッシュ 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitJumpDash(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ダメージ
// ==========================================================================
// ==========================================================================
// GmPlySeqChangeDamage
/*!
 *	ダメージへ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqChangeDamage(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqChangeDamageSetSpd
/*!
 *	ダメージへ変更 速度変更つき
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *	@param	spd_x		[in]	設定速度X
 *	@param	spd_y		[in]	設定速度Y
 */
// ==========================================================================
extern void GmPlySeqChangeDamageSetSpd(GMS_PLAYER_WORK *ply_work, fx32 spd_x, fx32 spd_y);

// ==========================================================================
// GmPlySeqInitDamage
/*!
 *	ダメージ 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitDamage(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 死亡
// ==========================================================================
// ==========================================================================
// GmPlySeqChangeDeath
/*!
 *	死亡へ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqChangeDeath(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitDeath
/*!
 *	死亡 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitDeath(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// スーパーソニック変身
// ==========================================================================
// ==========================================================================
// GmPlySeqChangeTransformSuper
/*!
 *	スーパーソニック変身へ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqChangeTransformSuper(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitTransformSuper
/*!
 *	スーパーソニック変身 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitTransformSuper(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 通常ACTゴール
// ==========================================================================
// ==========================================================================
// GmPlySeqChangeNormalActGoal
/*!
 *	通常ACTゴールへ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqChangeActGoal(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ボスステージゴール
// ==========================================================================
// ==========================================================================
// GmPlySeqChangeBossGoal
/*!
 *	ボスステージゴールへ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqChangeBossGoal(GMS_PLAYER_WORK *ply_work, fx32 capsule_pos_x, fx32 capsule_pos_y);

// ==========================================================================
// GmPlySeqInitBossGaol
/*!
 *	ボスステージゴール 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitBossGaol(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// ボスFINAL演出
// ==========================================================================
// ==========================================================================
// GmPlySeqChangeBoss5Demo
/*!
 *	ボスFINAL 演出へ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *	@param	dest_pos_x	[in]	移動目標位置X
 *	@param	is_goal		[in]	クリア演出フラグ
 *
 *	@note
 *	外部から直接呼び出してください。
 */
// ==========================================================================
extern void GmPlySeqChangeBoss5Demo(GMS_PLAYER_WORK *ply_work, fx32 dest_pos_x, BOOL is_goal);

// ==========================================================================
// GmPlySeqInitBoss5Demo
/*!
 *	ボスFINAL 演出 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *
 *	@note
 *	GmPlySeqChangeSequence()によって呼び出されます。
 */
// ==========================================================================
extern void GmPlySeqInitBoss5Demo(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqChangeBoss5DemoEnd
/*!
 *	ボスFINAL 演出終了へ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *
 *	@note
 *	演出シーケンスを終了させます。外部から直接呼び出してください。
 */
// ==========================================================================
extern void GmPlySeqChangeBoss5DemoEnd(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// タイムアタックリトライ FW
// ==========================================================================
// ==========================================================================
// GmPlySeqChangeTRetryFw
/*!
 *	タイムアタックリトライFWへ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqChangeTRetryFw(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitTRetryFw
/*!
 *	タイムアタックリトライFWへ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitTRetryFw(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// タイムアタックリトライ その場加速
// ==========================================================================
// ==========================================================================
// GmPlySeqChangeTRetryAcc
/*!
 *	タイムアタックリトライその場加速へ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqChangeTRetryAcc(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitTRetryAcc
/*!
 *	タイムアタックリトライその場加速へ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitTRetryAcc(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// タイムアタックリトライ その場加速
// ==========================================================================
// ==========================================================================
// GmPlySeqChangeTRetryRun
/*!
 *	タイムアタックリトライRUNへ変更
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqChangeTRetryRun(GMS_PLAYER_WORK *ply_work);

// トロッコ専用
// ==========================================================================
// トロッコFW
// ==========================================================================
// ==========================================================================
// GmPlySeqInitTruckFw
/*!
 *	トロッコFW 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *
 *	@note
 */
// ==========================================================================
extern void GmPlySeqInitTruckFw(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// トロッコ歩き
// ==========================================================================
// ==========================================================================
// GmPlySeqInitTruckWalk
/*!
 *	トロッコ歩き 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *
 *	@note
 *		user_timer	: エフェクト間隔用
 */
// ==========================================================================
extern void GmPlySeqInitTruckWalk(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// トロッコ落下
// ==========================================================================
// ==========================================================================
// GmPlySeqInitTruckFall
/*!
 *	トロッコ落下 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitTruckFall(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// トロッコジャンプ
// ==========================================================================
// ==========================================================================
// GmPlySeqInitTruckJump
/*!
 *	トロッコジャンプ 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitTruckJump(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// トロッコしゃがみ
// ==========================================================================
// ==========================================================================
// GmPlySeqInitTruckSquatStart
/*!
 *	トロッコしゃがみ開始 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitTruckSquatStart(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitTruckSquatMiddle
/*!
 *	トロッコしゃがみ中 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitTruckSquatMiddle(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitTruckSquatEnd
/*!
 *	トロッコしゃがみ終了 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitTruckSquatEnd(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// トロッコ用よろけ
// ==========================================================================
// ==========================================================================
// GmPlySeqInitTruckStaggerFront
/*!
 *	トロッコ用よろけ前 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitTruckStaggerFront(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// GmPlySeqInitTruckStaggerBack
/*!
 *	トロッコ用よろけ後ろ 初期化
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 */
// ==========================================================================
extern void GmPlySeqInitTruckStaggerBack(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
// 各種設定
// ==========================================================================
// ==========================================================================
// GmPlySeqLandingSet
/*!
 *	着地設定
 *
 *	@param	ply_work	[in]	プレイヤーワーク
 *	@param	dir_z		[in]	接地角度
 */
// ==========================================================================
extern void GmPlySeqLandingSet(GMS_PLAYER_WORK *ply_work, u16 dir_z);

// ==========================================================================
// 移動処理
// ==========================================================================
// ==========================================================================
// gmLActMoveFunc
/*!
 *	移動処理
 *
 *	@param	obj_work	[in]	オブジェクトワーク
 *
 *	@note
 *		ppMoveに設定
 */
// ==========================================================================
extern void GmPlySeqMoveFunc(OBS_OBJECT_WORK *obj_work);

// =====================================================================
// 移動設定
// =====================================================================
// ================================================================
// GmPlySeqMoveWalk
/*!
  プレイヤー移動設定関数 歩き移動

  @param ply_work [in] プレイヤーワークポインタ
    
 */
// ================================================================
extern void GmPlySeqMoveWalk(GMS_PLAYER_WORK *ply_work);

// ================================================================
// GmPlySeqMoveWalkTruck
/*!
  プレイヤー移動設定関数 歩き移動 トロッコ用

  @param ply_work [in] プレイヤーワークポインタ
    
 */
// ================================================================
extern void GmPlySeqMoveWalkTruck(GMS_PLAYER_WORK *ply_work);

// ================================================================
// GmPlySeqMoveWalkAutoRun
/*!
  プレイヤー移動設定関数 歩き移動 オートラン用

  @param ply_work [in] プレイヤーワークポインタ
    
 */
// ================================================================
extern void GmPlySeqMoveWalkAutoRun(GMS_PLAYER_WORK *ply_work);

// ================================================================
// GmPlySeqMoveJump
/*!
  プレイヤー移動設定関数 ジャンプ時移動

  @param ply_work [in] プレイヤーワークポインタ
    
 */
// ================================================================
extern void GmPlySeqMoveJump(GMS_PLAYER_WORK *ply_work);

// ================================================================
// GmPlySeqMoveJumpTruck
/*!
  プレイヤー移動設定関数 ジャンプ時移動 トロッコ

  @param ply_work [in] プレイヤーワークポインタ
    
 */
// ================================================================
extern void GmPlySeqMoveJumpTruck(GMS_PLAYER_WORK *ply_work);

// ================================================================
// GmPlySeqMoveJumpAutoRun
/*!
  プレイヤー移動設定関数 ジャンプ時移動 オートラン用

  @param ply_work [in] プレイヤーワークポインタ
    
 */
// ================================================================
extern void GmPlySeqMoveJumpAutoRun(GMS_PLAYER_WORK *ply_work);

// ================================================================
// GmPlySeqMoveSpin
/*!
  プレイヤー移動設定関数 スピン時移動

  @param ply_work [in] プレイヤーワークポインタ
    
 */
// ================================================================
extern void GmPlySeqMoveSpin(GMS_PLAYER_WORK *ply_work);

// ================================================================
// GmPlySeqMoveSpinNoDec
/*!
  プレイヤー移動設定関数 スピン減速無し移動

  @param ply_work [in] プレイヤーワークポインタ
    
 */
// ================================================================
extern void GmPlySeqMoveSpinNoDec(GMS_PLAYER_WORK *ply_work);

// ================================================================
// GmPlySeqMoveSpinPinball
/*!
  プレイヤー移動設定関数 ピンボールスピン時移動

  @param ply_work [in] プレイヤーワークポインタ
    
 */
// ================================================================
extern void GmPlySeqMoveSpinPinball(GMS_PLAYER_WORK *ply_work);

// ================================================================
// GmPlySeqMoveFly
/*!
  プレイヤー移動設定関数

  @param ply_work [in] プレイヤーワークポインタ
    
 */
// ================================================================
//extern void GmPlySeqMoveFly(GMS_PLAYER_WORK *ply_work);

// ================================================================
// GmPlySeqMoveAuto
/*!
  プレイヤー移動設定関数

  @param ply_work [in] プレイヤーワークポインタ
    
 */
// ================================================================
//extern void GmPlySeqMoveAuto(GMS_PLAYER_WORK *ply_work);

// =====================================================================
// 移動ユーティリティ
// =====================================================================
// =====================================================================
// gmPlayerJumpDirec
/*!
  プレイヤージャンプ中の角度変化

  @param ply_work [io] プレイヤーワークポインタ
    
 */
// =====================================================================
extern void GmPlySeqJumpDirec(GMS_PLAYER_WORK *ply_work);

// =====================================================================
// GmPlySeqTruckJumpDirec
/*!
  プレイヤートロッコジャンプ中の角度変化

  @param ply_work [io] プレイヤーワークポインタ
    
 */
// =====================================================================
extern void GmPlySeqTruckJumpDirec(GMS_PLAYER_WORK *ply_work);

// ==========================================================================
//
// ==========================================================================
// ==========================================================================
// GmPlySeqCheckAcceptHoming
/*!
  プレイヤー ホーミング可能チェック

  @param ply_work [io] プレイヤーワークポインタ
    
 */
// ==========================================================================
extern BOOL GmPlySeqCheckAcceptHoming(GMS_PLAYER_WORK *ply_work);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_PLY_SEQ_H_

//----- Include Files -------------------------------------------------------
