// ==========================================================================
/*!
  @file gmSound.h
  @brief ゲームサウンド

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmSound.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_SOUND_H_
#define GM_SOUND_H_


//----- Include Files -------------------------------------------------------
#include "gsSound.h"

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------
// 暫定◆
#define GmSoundPlayBgm(a, b)

//! ジングルインデックス列挙型
typedef enum
{
	GME_SOUND_JINGLE_IDX_1UP	= 0,
	GME_SOUND_JINGLE_IDX_CLEAR,
	GME_SOUND_JINGLE_IDX_CLEAR_FINAL,
	GME_SOUND_JINGLE_IDX_EMERALD,
	GME_SOUND_JINGLE_IDX_INVINCIBLE,
	GME_SOUND_JINGLE_IDX_NEW_RECORD,
	GME_SOUND_JINGLE_IDX_OBORE,
	GME_SOUND_JINGLE_IDX_GAMEOVER,
	
	GME_SOUND_JINGLE_IDX_MAX
} GME_SOUND_JINGLE_IDX;

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// データ構築
// ==========================================================================
// ==========================================================================
// GmSoundBuild
/*!
 *	ゲームサウンド 構築
 */
// ==========================================================================
extern void GmSoundBuild(void);

// ==========================================================================
// GmSoundBuildCheck
/*!
 *	サウンドデータ構築 終了チェック
 *
 *	@reutrn	TRUE : 終了
 */
// ==========================================================================
extern BOOL GmSoundBuildCheck(void);

// ==========================================================================
// GmSoundFlush
/*!
 *	ゲームサウンド 片付け
 */
// ==========================================================================
extern void GmSoundFlush(void);

// ==========================================================================
// GmSoundInit
/*!
 *	ゲームサウンド初期化
 */
// ==========================================================================
extern void GmSoundInit(void);

// ==========================================================================
// GmSoundExit
/*!
 *	ゲームサウンド終了処理
 */
// ==========================================================================
extern void GmSoundExit(void);

// ==========================================================================
// SE再生
// ==========================================================================
// ==========================================================================
// GmSoundPlaySE
/*!
 *	SE再生
 *
 *	@param	cue_name	[in]	再生するSEのキュー名
 *	@param	se_handle	[in]	SEハンドル NULL可
 *
 */
// ==========================================================================
extern void GmSoundPlaySE(char *cue_name, GSS_SND_SE_HANDLE *se_handle=NULL);

#if _IPHONE
// ==========================================================================
// GmSoundPlaySEForce
/*!
 *	SE再生 強制
 *
 *	@param	cue_name	[in]	再生するSEのキュー名
 *	@param	se_handle	[in]	SEハンドル NULL可
 *
 *	@note 通常のSE再生と違い、現在の発音数による再生拒否が行われない
 *
 */
// ==========================================================================
void GmSoundPlaySEForce(char *cue_name, GSS_SND_SE_HANDLE *se_handle=NULL);
#endif // _IPHONE

// ==========================================================================
// GmSoundStopSE
/*!
 *	SE停止
 *
 *	@param	se_handle	[in]	SEハンドル
 */
// ==========================================================================
#define GmSoundStopSE(se_handle)		GsSoundStopSeHandle(se_handle)

// ==========================================================================
// BGM
// ==========================================================================
// =======================================================================
// GmSoundPlayBGM
/*!
  BGM再生
  
  @param cue_name		[in]	再生するSEのキュー名
  @param fade_farame	[in]	フェードインにかけるフレーム数
  
  @note
  この関数は互換性のために残しています。
  代わりにGmSoundPlayStageBGM()を使用してください。
 */
// =======================================================================
extern void GmSoundPlayBGM(const char *cue_name, Sint32 fade_frame=0);

// =======================================================================
// GmSoundPlayStageBGM
/*!
  ステージBGM再生
  
  @param fade_frame	[in]	フェードインにかけるフレーム数
  
  @note
  現在のステージに応じたサウンドを再生します。
 */
// =======================================================================
extern void GmSoundPlayStageBGM(Sint32 fade_frame=0);

// =======================================================================
// GmSoundStopBGM
/*!
  BGM停止
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
  
  @note
  この関数は互換性のために残しています。
  代わりにGmSoundStopStageBGM()を使用してください。
 */
// =======================================================================
extern void GmSoundStopBGM(Sint32 fade_frame=0);

// =======================================================================
// GmSoundStopStageBGM
/*!
  ステージBGM停止
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
 */
// =======================================================================
extern void GmSoundStopStageBGM(Sint32 fade_frame=0);

// =======================================================================
// GmSoundPauseStageBGM
/*!
  ステージBGM一時停止
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
 */
// =======================================================================
extern void GmSoundPauseStageBGM(Sint32 fade_frame=0);

// =======================================================================
// GmSoundResumeStageBGM
/*!
  ステージBGM再開
  
  @param fade_frame	[in]	フェードインにかけるフレーム数
 */
// =======================================================================
extern void GmSoundResumeStageBGM(Sint32 fade_frame=0);

// =======================================================================
// 早足BGM
// =======================================================================
// =======================================================================
// GmSoundChangeSpeedupBGM
/*!
 *	早足BGM再生
 */
// =======================================================================
extern void GmSoundChangeSpeedupBGM(void);

// =======================================================================
// 怒りボスBGM
// =======================================================================
// =======================================================================
// GmSoundChangeAngryBossBGM
/*!
 *	怒りボスBGM再生
 */
// =======================================================================
extern void GmSoundChangeAngryBossBGM(void);

// =======================================================================
// ボス戦勝利時BGM
// =======================================================================
// =======================================================================
// GmSoundChangeWinBossBGM
/*!
 *	ボス戦勝利時BGM変更再生
 */
// =======================================================================
extern void GmSoundChangeWinBossBGM(void);

// =======================================================================
// FinalボスBGM
// =======================================================================
// =======================================================================
// GmSoundChangeFinalBossBGM
/*!
 *	ファイナルボスBGM再生
 */
// =======================================================================
extern void GmSoundChangeFinalBossBGM(void);

// ==========================================================================
// ジングル
// ==========================================================================
// =======================================================================
// GmSoundPlayJingle
/*!
  ジングル再生
  
  @param jngl_idx	[in]	ジングルインデックス（GME_SOUND_JINGLE_IDX_XXX）
  @param fade_frame	[in]	フェードインにかけるフレーム数
 */
// =======================================================================
extern void GmSoundPlayJingle(GME_SOUND_JINGLE_IDX jngl_idx, Sint32 fade_frame=0);

// =======================================================================
// GmSoundStopJingle
/*!
  ジングル停止
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
 */
// =======================================================================
extern void GmSoundStopJingle(Sint32 fade_frame=0);

// ==========================================================================
// BGMタイプジングル
// ==========================================================================
// =======================================================================
// GmSoundPlayBGMJingle
/*!
  BGMタイプジングル再生
  
  @param jngl_idx	[in]	ジングルインデックス（GME_SOUND_JINGLE_IDX_XXX）
  @param fade_frame	[in]	フェードインにかけるフレーム数
 */
// =======================================================================
extern void GmSoundPlayBGMJingle(GME_SOUND_JINGLE_IDX jngl_idx, Sint32 fade_frame=0);

// =======================================================================
// GmSoundStopBGMJingle
/*!
  BGMタイプジングル停止
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
 */
// =======================================================================
extern void GmSoundStopBGMJingle(Sint32 fade_frame=0);

// =======================================================================
// GmSoundPauseBGMJingle
/*!
  BGMタイプジングル一時停止
  
  @param fade_frame	[in]	フェードアウトにかけるフレーム数
 */
// =======================================================================
extern void GmSoundPauseBGMJingle(Sint32 fade_frame=0);

// =======================================================================
// GmSoundResumeBGMJingle
/*!
  BGMタイプジングル再開
  
  @param fade_frame	[in]	フェードインにかけるフレーム数
 */
// =======================================================================
extern void GmSoundResumeBGMJingle(Sint32 fade_frame=0);

// ==========================================================================
// ボリューム設定
// ==========================================================================
// =======================================================================
// GmSoundSetVolumeSE
/*!
  SEボリューム設定
  
  @param volume	[in]	ボリューム（倍率）
  
  @note
  SE全体のボリュームを設定します。
 */
// =======================================================================
extern void GmSoundSetVolumeSE(Float volume);

// =======================================================================
// GmSoundSetVolumeBGM
/*!
  BGMボリューム設定
  
  @param volume	[in]	ボリューム（倍率）
  
  @note
  BGM全体のボリュームを設定します（ジングルも含む）。
 */
// =======================================================================
extern void GmSoundSetVolumeBGM(Float volume);

// =======================================================================
// 特殊ジングル管理
// =======================================================================
// =======================================================================
// GmSoundPlayJingleObore
/*!
 *	ジングル再生 溺れ
 */
// =======================================================================
extern void GmSoundPlayJingleObore(void);

// =======================================================================
// GmSoundStopJingleObore
/*!
 *	ジングル停止 溺れ
 */
// =======================================================================
extern void GmSoundStopJingleObore(void);

// =======================================================================
// GmSoundPlayJingleInvincible
/*!
 *	ジングル再生 無敵
 */
// =======================================================================
extern void GmSoundPlayJingleInvincible(void);

// =======================================================================
// GmSoundStopJingleInvincible
/*!
 *	ジングル停止 無敵
 */
// =======================================================================
extern void GmSoundStopJingleInvincible(void);

// =======================================================================
// GmSoundPlayJingle1UP
/*!
 *	ジングル再生 1UP
 *
 *	@param	ret_bgm	[in]	BGM復帰あり
 *
 *	@note
 *		ret_bgm : FALSEの時、BGMの終了は行いません
 */
// =======================================================================
extern void GmSoundPlayJingle1UP(BOOL ret_bgm);

// =======================================================================
// GmSoundPlayGameOver
/*!
 *	ジングル再生 ゲームオーバー
 *
 *	@note
 *		BGMの停止を行います
 */
// =======================================================================
extern void GmSoundPlayGameOver(void);

// =======================================================================
// GmSoundPlayClear
/*!
 *	ジングル再生 ゲームクリアー
 *
 *	@note
 *		BGMの停止を行います
 */
// =======================================================================
extern void GmSoundPlayClear(void);

// =======================================================================
// GmSoundPlayClearFinal
/*!
 *	ジングル再生 ゲームクリアー ファイナル
 *
 *	@note
 *		BGMの停止を行います
 */
// =======================================================================
extern void GmSoundPlayClearFinal(void);

// =======================================================================
// 全サウンドポーズ(ポーズからのデモ移行用)
// =======================================================================
// =======================================================================
// GmSoundAllPause
/*!
 *	サウンドポーズ
 *
 *	@note
 *		すべてのストリームサウンドを一時停止します。
 */
// =======================================================================
extern void GmSoundAllPause(void);

// =======================================================================
// GmSoundAllResume
/*!
 *	サウンド復旧
 *
 *	@note
 *		GmSoundAllPauseで一時停止したストリームサウンドを復旧します。
 */
// =======================================================================
extern void GmSoundAllResume(void);

#if	defined(__cplusplus)
} /* extern "C" */
#endif


#endif // GM_SOUND_H_

//----- Include Files -------------------------------------------------------
