// ==========================================================================
/*!
  @file gmSpStageBra.h
  @brief 

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: gmSpStageBra.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef GM_SP_STAGE_BRA_H_
#define GM_SP_STAGE_BRA_H_


//----- Include Files -------------------------------------------------------

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Variables --------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// GmSpStageBranchInit
/*!
 *	スペステ分岐初期化
 *
 *	@param	arg	[in]	マップからの遷移時 移行スペステステージID(u16)
 */
// ==========================================================================
extern void GmSpStageBranchInit(void *arg);

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // GM_SP_STAGE_BRA_H_

//----- Include Files -------------------------------------------------------
