// ===========================================================================
/*!
	@file	gsCharCode.h
	@brief	ゲーム中で使用する文字コード変換モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	GsCharCodeConvAsciiToGame
/*!
	ASCIIコード文字からゲーム中コード文字への変換

	@param src		[in]  変換元のASCIIコード文字
	@return 変換後のゲーム中コード文字
*/
// ===========================================================================
extern u8 GsCharCodeConvAsciiToGame(char src);

// ===========================================================================
//	GsCharCodeConvGameToAscii
/*!
	ゲーム中コード文字からASCIIコード文字への変換

	@param src		[in]  変換元のゲーム中コード文字
	@return 変換後のASCIIコード文字
*/
// ===========================================================================
extern char GsCharCodeConvGameToAscii(u8 src);

// ===========================================================================
//	GsCharCodeConvStringAsciiToGame
/*!
	ASCIIコード文字列からゲーム中コード文字列への変換

	@param dest		[out] 変換後のゲーム中コード文字列格納バッファ
	@param dest_len	[in]  destの文字列長
	@param src		[in]  変換元のASCIIコード文字列格納バッファ
	@param src_len	[in]  srcの文字列長
*/
// ===========================================================================
extern void GsCharCodeConvStringAsciiToGame(
	u8* dest, u32 dest_len, const char* src, u32 src_len);

// ===========================================================================
//	GsCharCodeConvStringGameToAscii
/*!
	ゲーム中コード文字列からASCIIコード文字列への変換

	@param dest		[out] 変換後のASCIIコード文字列格納バッファ
	@param dest_len	[in]  destの文字列長
	@param src		[in]  変換元のゲーム中コード文字列格納バッファ
	@param src_len	[in]  srcの文字列長
*/
// ===========================================================================
extern void GsCharCodeConvStringGameToAscii(
	char* dest, u32 dest_len, const u8* src, u32 src_len);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
