// ===========================================================================
/*!
	@file	gsCharCode.cpp
	@brief	ゲーム中で使用する文字コード変換モジュール定義

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================

// ----- Include Files ---------------------------------------（インクルード）
#include "pch.h"
#include "gsCharCode.h"

// ----- Macros ------------------------------------------------（マクロ定義）

#define GSD_CHAR_CODE_GAME_CODE_NUM		(77)	//!< ゲーム中コード数

// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）

// ===========================================================================
//! ASCIIコード -> ゲーム中コード 変換テーブル
// ===========================================================================
static const u8 g_gs_char_code_ascii_to_game_tbl[128] =
{
	0,	// NUL（null文字)
	76,	// SOH（ヘッダ開始）
	76,	// STX（テキスト開始）
	76,	// ETX（テキスト終了）
	76,	// EOT（転送終了）
	76,	// ENQ（照会）
	76,	// ACK（受信ＯＫ）
	76,	// BEL（警告）
	76,	// BS（後退）
	76,	// HT（水平タブ）
	76,	// LF（改行）
	76,	// VT（垂直タブ）
	76,	// FF（改頁）
	76,	// CR（復帰）
	76,	// SO（シフトアウト）
	76,	// SI（シフトイン）
	76,	// DLE（データリンクエスケープ）
	76,	// DC1（装置制御１）
	76,	// DC2（装置制御２）
	76,	// DC3（装置制御３）
	76,	// DC4（装置制御４）
	76,	// NAK（受信失敗）
	76,	// SYN（同期）
	76,	// ETB（転送ブロック終了）
	76,	// CAN（とりけし）
	76,	// EM（メディア終了）
	76,	// SUB（置換）
	76,	// ESC（エスケープ）
	76,	// FS（フォーム区切り）
	76,	// GS（グループ区切り）
	76,	// RS（レコード区切り）
	76,	// US（ユニット区切り）
	76,	// （スペース）
	68,	// !
	76,	// "
	76,	// #
	76,	// $
	76,	// %
	70,	// &
	76,	// '
	74,	// (
	75,	// )
	76,	// *
	76,	// +
	76,	// ,
	63,	// -
	66,	// .
	67,	// /
	10,	// 0
	1,	// 1
	2,	// 2
	3,	// 3
	4,	// 4
	5,	// 5
	6,	// 6
	7,	// 7
	8,	// 8
	9,	// 9
	64,	// :
	65,	// ;
	72,	// <
	76,	// =
	73,	// >
	69,	// ?
	71,	// @
	11,	// A
	12,	// B
	13,	// C
	14,	// D
	15,	// E
	16,	// F
	17,	// G
	18,	// H
	19,	// I
	20,	// J
	21,	// K
	22,	// L
	23,	// M
	24,	// N
	25,	// O
	26,	// P
	27,	// Q
	28,	// R
	29,	// S
	30,	// T
	31,	// U
	32,	// V
	33,	// W
	34,	// X
	35,	// Y
	36,	// Z
	76,	// [
	76,	// \.
	76,	// ]
	76,	// ^
	76,	// _
	76,	// `
	37,	// a
	38,	// b
	39,	// c
	40,	// d
	41,	// e
	42,	// f
	43,	// g
	44,	// h
	45,	// i
	46,	// j
	47,	// k
	48,	// l
	49,	// m
	50,	// n
	51,	// o
	52,	// p
	53,	// q
	54,	// r
	55,	// s
	56,	// t
	57,	// u
	58,	// v
	59,	// w
	60,	// x
	61,	// y
	62,	// z
	76,	// {
	76,	// |
	76,	// }
	76,	// ~
	76,	// DEL（削除）
};

// ===========================================================================
//! ゲーム中コード -> ASCIIコード 変換テーブル
// ===========================================================================
static const char
	g_gs_char_code_game_to_ascii_tbl[GSD_CHAR_CODE_GAME_CODE_NUM] =
{
	'\0',
	'1',
	'2',
	'3',
	'4',
	'5',
	'6',
	'7',
	'8',
	'9',
	'0',
	'A',
	'B',
	'C',
	'D',
	'E',
	'F',
	'G',
	'H',
	'I',
	'J',
	'K',
	'L',
	'M',
	'N',
	'O',
	'P',
	'Q',
	'R',
	'S',
	'T',
	'U',
	'V',
	'W',
	'X',
	'Y',
	'Z',
	'a',
	'b',
	'c',
	'd',
	'e',
	'f',
	'g',
	'h',
	'i',
	'j',
	'k',
	'l',
	'm',
	'n',
	'o',
	'p',
	'q',
	'r',
	's',
	't',
	'u',
	'v',
	'w',
	'x',
	'y',
	'z',
	'-',
	':',
	';',
	'.',
	'/',
	'!',
	'?',
	'&',
	'@',
	'<',
	'>',
	'(',
	')',
	' ',
};

// ----- Global Functions ----------------------（グローバル関数の定義：外部）

// ===========================================================================
//	GsCharCodeConvAsciiToGame
/*!
	ASCIIコード文字からゲーム中コード文字への変換

	@param src		[in]  変換元のASCIIコード文字
	@return 変換後のゲーム中コード文字
*/
// ===========================================================================
u8 GsCharCodeConvAsciiToGame(char src)
{
	if ((u32)src >= 128) {
		return 76;
	}
	return g_gs_char_code_ascii_to_game_tbl[(u32)src];
}

// ===========================================================================
//	GsCharCodeConvGameToAscii
/*!
	ゲーム中コード文字からASCIIコード文字への変換

	@param src		[in]  変換元のゲーム中コード文字
	@return 変換後のASCIIコード文字
*/
// ===========================================================================
char GsCharCodeConvGameToAscii(u8 src)
{
	if ((u32)src >= GSD_CHAR_CODE_GAME_CODE_NUM) {
		return ' ';
	}
	return g_gs_char_code_game_to_ascii_tbl[src];
}

// ===========================================================================
//	GsCharCodeConvStringAsciiToGame
/*!
	ASCIIコード文字列からゲーム中コード文字列への変換

	@param dest		[out] 変換後のゲーム中コード文字列格納バッファ
	@param dest_len	[in]  destの文字列長
	@param src		[in]  変換元のASCIIコード文字列格納バッファ
	@param src_len	[in]  srcの文字列長
*/
// ===========================================================================
void GsCharCodeConvStringAsciiToGame(
	u8* dest, u32 dest_len, const char* src, u32 src_len)
{
	u32 i;
	for (i = 0; (i < dest_len) && (i < src_len); ++i) {
		if (src[i] == '\0') {
			break;
		}
		dest[i] = GsCharCodeConvAsciiToGame(src[i]);
	}
	for (; i < dest_len; ++i) {
		dest[i] = 0;
	}
}

// ===========================================================================
//	GsCharCodeConvStringGameToAscii
/*!
	ゲーム中コード文字列からASCIIコード文字列への変換

	@param dest		[out] 変換後のASCIIコード文字列格納バッファ
	@param dest_len	[in]  destの文字列長
	@param src		[in]  変換元のゲーム中コード文字列格納バッファ
	@param src_len	[in]  srcの文字列長
*/
// ===========================================================================
void GsCharCodeConvStringGameToAscii(
	char* dest, u32 dest_len, const u8* src, u32 src_len)
{
	u32 i;
	for (i = 0; (i < dest_len) && (i < src_len); ++i) {
		if (src[i] == 0) {
			break;
		}
		dest[i] = GsCharCodeConvGameToAscii(src[i]);
	}
	for (; i < dest_len; ++i) {
		dest[i] = '\0';
	}
}

// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
