// ===========================================================================
/*!
	@file	gsDebug.cpp
	@brief	システムデバッグモジュール定義

	@author	K.OKUGAWA Copyright (C) 2010 Dimps.
 */
// ===========================================================================

// ----- Include Files ---------------------------------------（インクルード）
#include "pch.h"
#include "gsDebug.h"
#include "gsMainSys.h"

#if defined(MTD_DEBUG)
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）

static void gsDebugTaskProcedure00(AMS_TCB* tcb);
static void gsDebugTaskDestructor00(AMS_TCB* tcb);

// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）

// ===========================================================================
//! デバッグ用タスク作成
// ===========================================================================
void GsDebugCreateDebugTask(void)
{
	amTaskMake(
		gsDebugTaskProcedure00, gsDebugTaskDestructor00,
		0, 0, 0, "gsDebug00");
}

// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//! デバッグ用タスクプロシージャ00
// ===========================================================================
void gsDebugTaskProcedure00(AMS_TCB* tcb)
{
	UNREFERENCED_PARAMETER(tcb);

#if _WII
	// Wiiリモコンのポインタ有効/無効表示
	if (g_gs_main_sys_info.debug_flag & GSD_DEBUG_DEBUG_DISP) {
		if (WPADIsDpdEnabled(WPAD_CHAN0)) {
			amPrintColor(0xff0000ff);
			amPrintf(2, 42, "POINTER : ON");
			amPrintColor(0xffffffff);
		} else {
			amPrintColor(0xffffffff);
			amPrintf(2, 42, "POINTER : OFF");
		}
	}
#endif // _WII
}

// ===========================================================================
//! デバッグ用タスクデストラクタ00
// ===========================================================================
void gsDebugTaskDestructor00(AMS_TCB* tcb)
{
	UNREFERENCED_PARAMETER(tcb);

	// empty
}

#endif // defined(MTD_DEBUG)

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
