// ===========================================================================
/*!
	@file	gsEnvironment.h
	@brief	環境別システム設定モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
#if _PS3
#include "np.h"
#include "np/trophy.h"
#endif // _PS3

// ----- Macros ------------------------------------------------（マクロ定義）

// キーマクロ
#define GSD_KEY_DECIDE		(g_gs_env_key_decide)	//!< 決定キー
#define GSD_KEY_CANCEL		(g_gs_env_key_cancel)	//!< キャンセルキー
#define GSD_KEY_UP			(g_gs_env_key_up)		//!< 上方向キー
#define GSD_KEY_DOWN		(g_gs_env_key_down)		//!< 下方向キー
#define GSD_KEY_LEFT		(g_gs_env_key_left)		//!< 左方向キー
#define GSD_KEY_RIGHT		(g_gs_env_key_right)	//!< 右方向キー

// アラインマクロ
#if !_WII
#define ATTRIBUTE_ALIGN(x)	//Wii以外なら除去
#endif // !_WII

// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）

// ===========================================================================
//	enum GSE_REGION
// ---------------------------------------------------------------------------
//!	リージョン列挙
// ===========================================================================
typedef enum tag_GSE_REGION {
	GSD_REGION_JP		= 0,				//!< 日本
	GSD_REGION_US,							//!< 北米
	GSD_REGION_EU,							//!< 欧州

	GSD_REGION_NUM,							//!< リージョン数
	GSD_REGION_DEF = GSD_REGION_US,			//!< デフォルトリージョン
} GSE_REGION;

// ===========================================================================
//	enum GSE_LANGUAGE
// ---------------------------------------------------------------------------
//!	言語列挙
// ===========================================================================
typedef enum tag_GSE_LANGUAGE {
	GSD_LANGUAGE_JP		= 0,				//!< 日本語
	GSD_LANGUAGE_US,						//!< 英語
	GSD_LANGUAGE_FR,						//!< フランス語
	GSD_LANGUAGE_IT,						//!< イタリア語
	GSD_LANGUAGE_GE,						//!< ドイツ語
	GSD_LANGUAGE_SP,						//!< スペイン語

	GSD_LANGUAGE_NUM,						//!< 言語数

#if defined(HOG_RGN_JP)
	GSD_LANGUAGE_DEF = GSD_LANGUAGE_JP,		//!< デフォルト言語
#elif defined(HOG_RGN_US)
	GSD_LANGUAGE_DEF = GSD_LANGUAGE_US,		//!< デフォルト言語
#elif defined(HOG_RGN_EU)
	GSD_LANGUAGE_DEF = GSD_LANGUAGE_US,		//!< デフォルト言語
#else
	GSD_LANGUAGE_DEF = GSD_LANGUAGE_US,		//!< デフォルト言語
#endif
} GSE_LANGUAGE;

// ===========================================================================
//	enum GSE_DECIDE_KEY
// ---------------------------------------------------------------------------
//! 決定キー列挙
// ===========================================================================
typedef enum tag_GSE_DECIDE_KEY {
	GSD_DECIDE_KEY_O	= 0,				//!< ○キー
	GSD_DECIDE_KEY_X,						//!< ×キー

	GSD_DECIDE_KEY_NUM,						//!< 決定キー数
	GSD_DECIDE_KEY_DEF = GSD_DECIDE_KEY_X,	//!< デフォルト決定キー
} GSE_DECIDE_KEY;

#if _WII
// ===========================================================================
//	enum GSE_WII_LANGUAGE
// ---------------------------------------------------------------------------
//!	Wiiシステム言語列挙
// ===========================================================================
typedef enum tag_GSE_WII_LANGUAGE {
	GSD_WII_LANGUAGE_JP		= 0,			//!< 日本語
	GSD_WII_LANGUAGE_EN,					//!< 英語
	GSD_WII_LANGUAGE_FR,					//!< フランス語
	GSD_WII_LANGUAGE_IT,					//!< イタリア語
	GSD_WII_LANGUAGE_GE,					//!< ドイツ語
	GSD_WII_LANGUAGE_SP,					//!< スペイン語
	GSD_WII_LANGUAGE_DU,					//!< オランダ語

	GSD_WII_LANGUAGE_NUM,					//!< 言語数

#if defined(HOG_RGN_JP)
	GSD_WII_LANGUAGE_DEF = GSD_WII_LANGUAGE_JP,		//!< デフォルト言語
#elif defined(HOG_RGN_US)
	GSD_WII_LANGUAGE_DEF = GSD_WII_LANGUAGE_EN,		//!< デフォルト言語
#elif defined(HOG_RGN_EU)
	GSD_WII_LANGUAGE_DEF = GSD_WII_LANGUAGE_EN,		//!< デフォルト言語
#endif

} GSE_WII_LANGUAGE;
#endif // _WII

// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -------------------------（グローバル変数宣言）

// ***************************************************************************
// キー
// ***************************************************************************
// ===========================================================================
//	u16 g_gs_env_key_decide
// ---------------------------------------------------------------------------
//!	決定キー
// ===========================================================================
extern u16 g_gs_env_key_decide;

// ===========================================================================
//	u16 g_gs_env_key_cancel
// ---------------------------------------------------------------------------
//!	キャンセルキー
// ===========================================================================
extern u16 g_gs_env_key_cancel;

// ===========================================================================
//	u16 g_gs_env_key_up
// ---------------------------------------------------------------------------
//!	上方向キー
// ===========================================================================
extern u16 g_gs_env_key_up;

// ===========================================================================
//	u16 g_gs_env_key_down
// ---------------------------------------------------------------------------
//!	下方向キー
// ===========================================================================
extern u16 g_gs_env_key_down;

// ===========================================================================
//	u16 g_gs_env_key_left
// ---------------------------------------------------------------------------
//!	左方向キー
// ===========================================================================
extern u16 g_gs_env_key_left;

// ===========================================================================
//	u16 g_gs_env_key_right
// ---------------------------------------------------------------------------
//!	右方向キー
// ===========================================================================
extern u16 g_gs_env_key_right;

// ----- External Declarations -------------------------（グローバル関数宣言）

// ***************************************************************************
// 初期化
// ***************************************************************************
// ===========================================================================
//	GsEnvInit
/*!
	システム初期化処理

	@note
	各種本体設定などを参照し、言語設定やキー設定などを行います。\n
	このモジュールの関数を使用する前に呼び出すようにして下さい。\n
*/
// ===========================================================================
extern void GsEnvInit(void);


// ***************************************************************************
// 本体設定取得
// ***************************************************************************
// ===========================================================================
//	GsEnvGetRegion
/*!
	リージョン取得

	@return リージョン
	@note
	本体に設定されているリージョンを返します。\n
*/
// ===========================================================================
extern GSE_REGION GsEnvGetRegion(void);

// ===========================================================================
//	GsEnvIsRegionAsia
/*!
	リージョンアジア判定

	@return 真：アジア　偽：それ以外
*/
// ===========================================================================
extern BOOL GsEnvIsRegionAsia(void);

// ===========================================================================
//	GsEnvGetLanguage
/*!
	言語取得

	@return 言語
	@note
	本体に設定されている言語を返します。\n
	ゲーム中で表示する言語は、全てこの関数の戻り値を元に決定して下さい。\n
*/
// ===========================================================================
extern GSE_LANGUAGE GsEnvGetLanguage(void);

// ===========================================================================
//	GeEnvGetDecideKey
/*!
	決定キー取得

	@return 決定キー
	@note
	本体設定にある決定キーを返します。\n
	■PS3\n
	GSD_DECIDE_KEY_O : ○キー\n
	GSD_DECIDE_KEY_X : ×キー\n
	■Xbox360
	GSD_DECIDE_KEY_O : Bキー\n
	GSD_DECIDE_KEY_X : Aキー\n
	■Wii
	GSD_DECIDE_KEY_O : \n
	GSD_DECIDE_KEY_X : \n
	amPadなどのキーIDとは互換がありませんので注意して下さい。\n
	メニューなどで、ヘルプ表示する画像の切り替えに使用して下さい。\n
*/
// ===========================================================================
extern GSE_DECIDE_KEY GeEnvGetDecideKey(void);


#if _PS3
// ***************************************************************************
// PS3
// ***************************************************************************
// ===========================================================================
//	GsEnvGetPs3TitleId
/*!
	タイトルID取得

	@return タイトルID
*/
// ===========================================================================
extern const char* GsEnvGetPs3TitleId(void);

// ===========================================================================
//	GsEnvGetPs3LicenseNpContentId
/*!
	購入ライセンスNPコンテンツID取得

	@return 購入ライセンスNPコンテンツID
*/
// ===========================================================================
extern const char* GsEnvGetPs3LicenseNpContentId(void);

// ===========================================================================
//	GsEnvGetPs3ComId
/*!
	NPコミュニケーションID取得

	@return NPコミュニケーションID
*/
// ===========================================================================
extern const SceNpCommunicationId* GsEnvGetPs3ComId(void);

// ===========================================================================
//	GsEnvGetPs3ComPassphrase
/*!
	NPコミュニケーションパスフレーズ取得

	@return NPコミュニケーションパスフレーズ
*/
// ===========================================================================
extern const SceNpCommunicationPassphrase* GsEnvGetPs3ComPassphrase(void);

// ===========================================================================
//	GsEnvGetPs3ComSignature
/*!
	NPコミュニケーションシグネチャ取得

	@return NPコミュニケーションシグネチャ
*/
// ===========================================================================
extern const SceNpCommunicationSignature* GsEnvGetPs3ComSignature(void);

// ===========================================================================
//	GsEnvGetPs3ParentalLockAge
/*!
	パレンタルロックを行う年齢取得

	@return パレンタルロックを行う年齢
	@note
	この関数の返す値よりもユーザの年齢が低かった場合（同じはOK）は
	パレンタルロックを行う必要があります。\n
*/
// ===========================================================================
extern int GsEnvGetPs3ParentalLockAge(void);
#endif // _PS3


#if _WII
// ***************************************************************************
// PS3
// ***************************************************************************
// ===========================================================================
//	GsEnvGetWiiSystemLanguage
/*!
	Wiiシステム言語取得

	@return Wiiシステム言語
	@note
	ストラップ画面の言語などは、GsEnvGetLanguage関数ではなく
	この関数の戻り値に従って切り替えてください。\n
*/
// ===========================================================================
extern GSE_WII_LANGUAGE GsEnvGetWiiSystemLanguage(void);
#endif // _WII


#if defined(MTD_DEBUG)
// ***************************************************************************
// デバッグ
// ***************************************************************************
// ===========================================================================
//	GsEnvDebugEventSetting
/*!
	設定変更イベント

	@note
	デバッグを目的として、
	本来は本体設定から取得する各種設定を任意に切り替える機能を提供します。\n
	このイベントを呼び出す前に、GsEnvInit関数を呼び出して有る必要があります。\n
*/
// ===========================================================================
extern void GsEnvDebugEventSetting(void* arg);

// ===========================================================================
//	GsEnvDebugGetDecideKeyChar
/*!
	デバッグ表示用の決定キー文字取得

	@return 決定キー文字
	@note
	デバッグ用途として、決定キーを識別するための文字列を返します。\n
	デバッグ文字で画面に操作説明を書く際の使用を想定してます。\n
	Xbox360では'A'、PS3では'X'など\n
*/
// ===========================================================================
extern char GsEnvDebugGetDecideKeyChar(void);

// ===========================================================================
//	GsEnvDebugGetCancelKeyChar
/*!
	デバッグ表示用のキャンセルキー文字取得

	@return キャンセルキー文字
*/
// ===========================================================================
extern char GsEnvDebugGetCancelKeyChar(void);

#endif // defined(MTD_DEBUG)

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
