// ============================================================================
/*!
	@file	gsEnvironment_i.h
	@brief	環境別システム設定モジュール宣言(iPhone)

	@author	Kouji Hokazono <kouji_hokazono@dimps.co.jp>
		Copyright(c) 2009 Dimps
	$Id: gsEnvironment_i.h 2 2011-04-11 05:21:26Z thamada $
 */
// ============================================================================
/*
 * $Log$
 */

#pragma once

//------ C Include Files -------------- インクルード ---------------------------******CIF*
#include "gsEnvironment.h"


	
//------ C Macro ---------------------- マクロ ---------------------------------******CMC*
//------ C External Definitions ------- グローバル変数及び関数の宣言 -----------******CED*
// ===========================================================================
//	GsEnvGetRegionIphone
/*!
	リージョン取得

	@return リージョン
	@note
	本体に設定されているリージョンを返します。\n
*/
// ===========================================================================
extern GSE_REGION GsEnvGetRegionIphone(void);

// ===========================================================================
//	GsEnvGetLanguageIphone
/*!
	言語取得

	@return 言語
	@note
	本体に設定されている言語を返します。\n
	ゲーム中で表示する言語は、全てこの関数の戻り値を元に決定して下さい。\n
*/
// ===========================================================================
extern GSE_LANGUAGE GsEnvGetLanguageIphone(void);





















//------ Include ---------------------- インクルード ---------------------------******_IC*
//------ Debug ------------------------ デバッグ -------------------------------******_DG*
#if defined(MTD_DEBUG)
#endif	//#if defined(MTD_DEBUG)
//------ Macro ------------------------ マクロ ---------------------------------******_MC*







// ============================================================================
// Function
/*!
	関数の説明
 
	@param	org1	[io]	引数１の説明
	@param	org2	[in]	引数２の説明
	@param	org3	[out]	引数３の説明
 
	@return	戻り値の説明
		or
	@retval	0	正常
	@retval	!0	異常
 
	@exception 例外

	@note
		補足説明
 */
// ============================================================================
