// ===========================================================================
/*!
	@file	gsFont.cpp
	@brief	フォントモジュール定義(Wii)

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================

// ----- Include Files ---------------------------------------（インクルード）
#include "pch.h"
#include "gsFont.h"

#if _WII

#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）

// ===========================================================================
//	struct GSS_FONT_WORK
// ---------------------------------------------------------------------------
//!	フォント構築タスクワーク
// ===========================================================================
typedef struct tag_GSS_FONT_WORK {
	AMS_FS*			fs;			//!< ファイル読み込み用
} GSS_FONT_WORK;

// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）

// タスクプロシージャ
static void gsFontTaskBuild0000(AMS_TCB* tcb);
static void gsFontTaskBuild0100(AMS_TCB* tcb);
static void gsFontTaskDestructor(AMS_TCB* tcb);

// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）

// ===========================================================================
//	AMS_TCB* g_gs_font_tcb
// ---------------------------------------------------------------------------
//!	構築タスクTCBポインタ
// ===========================================================================
static AMS_TCB* g_gs_font_tcb = NULL;

// ===========================================================================
//	char* g_gs_font_file_path
// ---------------------------------------------------------------------------
//!	フォントファイルパス
// ===========================================================================
static char* g_gs_font_file_path = "SYS_SHARED/wbf1.brfna";

// ----- Global Functions ----------------------（グローバル関数の定義：外部）

// ===========================================================================
//	GsFontBuild
/*!
	構築開始

	@param use_mem2	[in] 真：MEM2を使用　偽：MEM1を使用
	@note
	既に構築済み、あるいは構築中の場合は何も行ないません。\n
*/
// ===========================================================================
void GsFontBuild(BOOL use_mem2)
{
	// 構築中か構築済みなら何もしない
	if (GsFontIsBuilding() || GsFontIsBuilded()) {
		return;
	}
	amAssert(g_gs_font_tcb == NULL);

	// 構築タスク作成
	g_gs_font_tcb = amTaskMake(
		gsFontTaskBuild0000, gsFontTaskDestructor, 0, 0, 0, "gsFont::Build");

	// 構築タスクワーク初期化
	GSS_FONT_WORK* work = (GSS_FONT_WORK*)amTaskGetWork(g_gs_font_tcb);
	work->fs = NULL;

	// CNT対応後、変更する必要あり ////////////////////////////////////////////////////////////////////////////////
	// フォントファイル読み込みリクエスト発行
	Sint32 mode;
	if (use_mem2) {
		mode = AMD_FS_MALLOC_TEMP | AMD_FS_MALLOC_MEM2;
	}
	else {
		mode = AMD_FS_MALLOC_TEMP | AMD_FS_MALLOC_MEM1;
	}
	amFsSetMallocMode(mode, 1);
	work->fs = amFsReadBackground(g_gs_font_file_path);
	amFsSetMallocMode(AMD_FS_MALLOC_NORMAL, 0);

	// 構築タスク開始
	amTaskStart(g_gs_font_tcb);
}

// ===========================================================================
//	GsFontIsBuilding
/*!
	構築中判定

	@return 真：構築中　偽：それ以外
	@note
	GsFontBuild関数で開始した構築処理が
	行なわれている最中かどうかを判定します。\n
	構築が完了した時点でFALSEを返すようになります。\n
	GsFontIsBuilded関数がTRUEを返す状態で
	この関数がTRUEを返すことはありません。\n
*/
// ===========================================================================
BOOL GsFontIsBuilding(void)
{
	if (g_gs_font_tcb) {
		return TRUE;
	}
	return FALSE;
}

// ===========================================================================
//	GsFontIsBuilded
/*!
	構築済み判定

	@return 真：構築済み　偽：それ以外
	@note
	GsFontBuild関数で開始した構築処理が完了したかどうかを返します。\n
	この関数がTRUEを返す状態はAoFontIsBuilded関数が
	TRUEを返す状態と"ほぼ"一致しています。\n
*/
// ===========================================================================
BOOL GsFontIsBuilded(void)
{
	if ((g_gs_font_tcb == NULL) && AoFontIsBuilded()) {
		return TRUE;
	}
	return FALSE;
}

// ===========================================================================
//	GsFontRelease
/*!
	解放

	@note
	aoFontモジュールの解放を行います。\n
*/
// ===========================================================================
void GsFontRelease(void)
{
	if (g_gs_font_tcb) {
		amTaskDelete(g_gs_font_tcb);
		amAssert(g_gs_font_tcb == NULL);
		g_gs_font_tcb = NULL; // 念のため
	}
	AoFontRelease();
}

// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ***************************************************************************
// タスクプロシージャ
// ***************************************************************************
// ===========================================================================
//! 構築処理0000(ファイル読み込み待ち)
// ===========================================================================
void gsFontTaskBuild0000(AMS_TCB* tcb)
{
	// ワーク取得
	GSS_FONT_WORK* work = (GSS_FONT_WORK*)amTaskGetWork(tcb);

	// ファイル読み込み判定
	if (amFsIsComplete(work->fs)) {

		// ファイル取得
		void* file = work->fs->buf;
		work->fs->buf = NULL;

		// リクエストクリア
		amFsClearRequest(work->fs);
		work->fs = NULL;

		// フォント構築開始
		AoFontBuildStart(file, TRUE, FALSE, TRUE);

		// 構築街へ遷移
		amTaskSetProcedure(tcb, gsFontTaskBuild0100);
	}
}

// ===========================================================================
//! 構築処理0100(構築待ち)
// ===========================================================================
void gsFontTaskBuild0100(AMS_TCB* tcb)
{
	// 構築判定
	if (AoFontIsBuilded()) {
		// 構築完了
		amTaskDelete(tcb);
	}
}

// ===========================================================================
//! デストラクタ
// ===========================================================================
void gsFontTaskDestructor(AMS_TCB* tcb)
{
	// ワーク取得
	GSS_FONT_WORK* work = (GSS_FONT_WORK*)amTaskGetWork(tcb);

	// ファイル読み込み中ならリクエストクリア
	if (work->fs) {
		amFsClearRequest(work->fs);
		work->fs = NULL;
	}

	// TCBポインタクリア
	g_gs_font_tcb = NULL;
}

#endif // _WII

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
