// ===========================================================================
/*!
	@file	gsFont.h
	@brief	フォントモジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

/*
	aoFontの管理を行なうモジュールです。
	aoFontの構築や解放を行なう場合は、
	必ずこのモジュールを介して行なうようにして下さい。
	aoFontはWii版でのみ有効なモジュールとなりますので、
	Wii版以外では、このモジュールは何も行ないません。
	ただし、正当な結果が返るように処理をします。
	(GsFontBuildとGsFontReleaseの間でのみGsFontIsBuildedがTRUEを返すなど)
*/

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	GsFontInit
/*!
	初期化開始

	@note
	アプリケーション起動時に一度だけ呼び出して下さい。\n
*/
// ===========================================================================
extern void GsFontInit(void);

// ===========================================================================
//	GsFontExit
/*!
	終了

	@note
	アプリケーション終了時に一度だけ呼び出して下さい。\n
*/
// ===========================================================================
extern void GsFontExit(void);

// ===========================================================================
//	GsFontBuild
/*!
	構築開始

	@param use_mem2	[in] 真：MEM2を使用　偽：MEM1を使用
	@note
	既に構築済み、あるいは構築中の場合は何も行ないません。\n
*/
// ===========================================================================
extern void GsFontBuild(BOOL use_mem2 = TRUE);

// ===========================================================================
//	GsFontIsBuilding
/*!
	構築中判定

	@return 真：構築中　偽：それ以外
	@note
	GsFontBuild関数で開始した構築処理が
	行なわれている最中かどうかを判定します。\n
	構築が完了した時点でFALSEを返すようになります。\n
	GsFontIsBuilded関数がTRUEを返す状態で
	この関数がTRUEを返すことはありません。\n
*/
// ===========================================================================
extern BOOL GsFontIsBuilding(void);

// ===========================================================================
//	GsFontIsBuilded
/*!
	構築済み判定

	@return 真：構築済み　偽：それ以外
	@note
	GsFontBuild関数で開始した構築処理が完了したかどうかを返します。\n
	この関数がTRUEを返す状態はAoFontIsBuilded関数が
	TRUEを返す状態と"ほぼ"一致しています。\n
*/
// ===========================================================================
extern BOOL GsFontIsBuilded(void);

// ===========================================================================
//	GsFontRelease
/*!
	解放

	@note
	aoFontモジュールの解放を行います。\n
*/
// ===========================================================================
extern void GsFontRelease(void);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
