// ===========================================================================
/*!
	@file	gsFont.cpp
	@brief	フォントモジュール定義(Wii以外)

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================

// ----- Include Files ---------------------------------------（インクルード）
#include "pch.h"
#include "gsFont.h"

#if !_WII

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）

// ===========================================================================
//	BOOL g_gs_font_builded
// ---------------------------------------------------------------------------
//!	構築済みフラグ
// ===========================================================================
static BOOL g_gs_font_builded = FALSE;

// ----- Global Functions ----------------------（グローバル関数の定義：外部）

// ===========================================================================
//	GsFontInit
/*!
	初期化開始

	@note
	アプリケーション起動時に一度だけ呼び出して下さい。\n
*/
// ===========================================================================
void GsFontInit(void)
{
	// empty
}

// ===========================================================================
//	GsFontExit
/*!
	終了

	@note
	アプリケーション終了時に一度だけ呼び出して下さい。\n
*/
// ===========================================================================
void GsFontExit(void)
{
	// empty
}

// ===========================================================================
//	GsFontBuild
/*!
	構築開始

	@param use_mem2	[in] 真：MEM2を使用　偽：MEM1を使用
	@note
	既に構築済み、あるいは構築中の場合は何も行ないません。\n
*/
// ===========================================================================
void GsFontBuild(BOOL use_mem2)
{
	UNREFERENCED_PARAMETER(use_mem2);
	g_gs_font_builded = TRUE;
}

// ===========================================================================
//	GsFontIsBuilding
/*!
	構築中判定

	@return 真：構築中　偽：それ以外
	@note
	GsFontBuild関数で開始した構築処理が
	行なわれている最中かどうかを判定します。\n
	構築が完了した時点でFALSEを返すようになります。\n
	GsFontIsBuilded関数がTRUEを返す状態で
	この関数がTRUEを返すことはありません。\n
*/
// ===========================================================================
BOOL GsFontIsBuilding(void)
{
	return FALSE;
}

// ===========================================================================
//	GsFontIsBuilded
/*!
	構築済み判定

	@return 真：構築済み　偽：それ以外
	@note
	GsFontBuild関数で開始した構築処理が完了したかどうかを返します。\n
	この関数がTRUEを返す状態はAoFontIsBuilded関数が
	TRUEを返す状態と"ほぼ"一致しています。\n
*/
// ===========================================================================
BOOL GsFontIsBuilded(void)
{
	return g_gs_font_builded;
}

// ===========================================================================
//	GsFontRelease
/*!
	解放

	@note
	aoFontモジュールの解放を行います。\n
*/
// ===========================================================================
void GsFontRelease(void)
{
	g_gs_font_builded = FALSE;
}

// ----- Static Functions --------------------（スタティック関数の定義：局所）

#endif // !_WII

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
