// ===========================================================================
/*!
	@file	gsInit.h
	@brief	システム初期化モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	GsInitOtherStart
/*!
	初期化処理開始
*/
// ===========================================================================
extern void GsInitOtherStart(void);

// ===========================================================================
//	GsInitOtherIsInitialized
/*!
	初期化処理完了判定

	@return 真：完了　偽：処理中
	@note
	初期化処理が完了したかではなく、
	GsInitOtherStart関数で開始した処理が終了したかを判定します。\n
	そのため、GsInitOtherStart関数呼び出し前にも
	TRUEを返すので注意して下さい。\n
*/
// ===========================================================================
extern BOOL GsInitOtherIsInitialized(void);

// ===========================================================================
//	GsOtherExit
/*!
	終了処理
*/
// ===========================================================================
extern void GsOtherExit(void);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
