// ===========================================================================
/*!
	@file	gsMemFile.h
	@brief	メモリ常駐ファイル管理モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
#include "gsEnvironment.h"

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	GsMemFileInit
/*!
	メモリ常駐ファイル初期化処理
*/
// ===========================================================================
extern void GsMemFileInit(void);

// ===========================================================================
//	GsMemFileInit
/*!
	メモリ常駐ファイル終了処理
*/
// ===========================================================================
extern void GsMemFileExit(void);

// ===========================================================================
//	GsMemFileGetWindowTextureAtypeAmb
/*!
	ウインドウテクスチャAタイプAMB取得

	@return ウインドウテクスチャAタイプAMB
*/
// ===========================================================================
extern void* GsMemFileGetWindowTextureAtypeAmb(void);

#if _XBOX
// ===========================================================================
//	GsMemFileGetXbox360SaveThumbPng
/*!
	セーブサムネイルPNGファイル取得

	@return セーブサムネイルPNGファイル
*/
// ===========================================================================
extern void* GsMemFileGetXbox360SaveThumbPng(void);

// ===========================================================================
//	GsMemFileGetXbox360SaveThumbPngSize
/*!
	セーブサムネイルPNGファイルサイズ取得

	@return セーブサムネイルPNGファイルサイズ
*/
// ===========================================================================
extern u32 GsMemFileGetXbox360SaveThumbPngSize(void);
#endif // _XBOX

#if _WII
// ===========================================================================
//	GsMemFileGetWiiSaveBannerTpl
/*!
	Wii用セーブバナーTPLファイル取得

	@return Wii用セーブバナーTPLファイル
*/
// ===========================================================================
extern void* GsMemFileGetWiiSaveBannerTpl(void);

// ===========================================================================
//	GsMemFileGetWiiSaveBannerTplSize
/*!
	Wii用セーブバナーTPLファイルサイズ取得

	@return Wii用セーブバナーTPLファイルサイズ
*/
// ===========================================================================
extern u32 GsMemFileGetWiiSaveBannerTplSize(void);

// ===========================================================================
//	GsMemFileGetWiiFatalErrorMessageFile
/*!
	Wii用Fatalエラーメッセージファイル取得

	@return Wii用Fatalエラーメッセージファイル
	@note
	システム設定言語のファイルを返します。\n
*/
// ===========================================================================
extern const void* GsMemFileGetWiiFatalErrorMessageFile(void);

// ===========================================================================
//	GsMemFileGetWiiFatalErrorMessageFile
/*!
	Wii用Fatalエラーメッセージファイル取得

	@param lang	[in] 言語
	@return Wii用Fatalエラーメッセージファイル
*/
// ===========================================================================
extern const void* GsMemFileGetWiiFatalErrorMessageFile(GSE_LANGUAGE lang);

#endif // _WII

#if _PS3
// ===========================================================================
//	GsMemFileGetPS3SaveIcon0Png
/*!
	PS3用セーブアイコンIOCN0.PNG取得

	@return PS3用セーブアイコンIOCN0.PNG
*/
// ===========================================================================
extern void* GsMemFileGetPS3SaveIcon0Png(void);

// ===========================================================================
//	GsMemFileGetPS3SaveIcon0PngSize
/*!
	PS3用セーブアイコンIOCN0.PNGサイズ取得

	@return PS3用セーブアイコンIOCN0.PNGサイズ
*/
// ===========================================================================
extern u32 GsMemFileGetPS3SaveIcon0PngSize(void);

// ===========================================================================
//	GsMemFileGetPS3SavePic1Png
/*!
	PS3用セーブ背景PIC1.PNG取得

	@return PS3用セーブ背景PIC1.PNG
*/
// ===========================================================================
extern void* GsMemFileGetPS3SavePic1Png(void);

// ===========================================================================
//	GsMemFileGetPS3SavePic1PngSize
/*!
	PS3用セーブ背景PIC1.PNGサイズ取得

	@return PS3用セーブ背景PIC1.PNGサイズ
*/
// ===========================================================================
extern u32 GsMemFileGetPS3SavePic1PngSize(void);
#endif // _PS3

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
