// ===========================================================================
/*!
	@file	gsPresence.h
	@brief	プレゼンスシステム宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）

#if _XBOX || _PS3
//! プレゼンス監視有効(無効にする場合はコメントアウト)
#define GSD_PRESENCE_WATCH_ENABLE		(1)
#endif // _XBOX || _PS3

// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

#if defined(GSD_PRESENCE_WATCH_ENABLE)

// ===========================================================================
//	GsPresenceWatchStart
/*!
	プレゼンス監視開始
*/
// ===========================================================================
extern void GsPresenceWatchStart(void);

// ===========================================================================
//	GsPresenceWatchStart
/*!
	プレゼンス監視終了
*/
// ===========================================================================
extern void GsPresenceWatchEnd(void);

#else

// ===========================================================================
//! プレゼンス監視開始
// ===========================================================================
#define GsPresenceWatchStart()	((void)0)

// ===========================================================================
//! プレゼンス監視終了
// ===========================================================================
#define GsPresenceWatchEnd()	((void)0)

#endif // defined(GSD_PRESENCE_WATCH_ENABLE)

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
