// ===========================================================================
/*!
	@file	gsTrial.h
	@brief	体験版管理モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	GsTrialInitStart
/*!
	モジュール初期化開始

	@note
	アプリケーション起動時に一度だけ呼び出すようにして下さい。\n
*/
// ===========================================================================
extern void GsTrialInitStart(void);

// ===========================================================================
//	GsTrialInitIsFinished
/*!
	モジュール初期化終了判定

	@return 真：初期化終了　偽：初期化中
	@note
	GsTrialInitStart関数で開始した初期化処理が完了したか判定します。\n
	初期化処理が完了するまでは、
	このモジュールの機能を使用することはできません。\n
*/
// ===========================================================================
extern BOOL GsTrialInitIsFinished(void);

// ===========================================================================
//	GsTrialExit
/*!
	モジュール終了処理

	@note
	アプリケーション終了時に一度だけ呼び出すようにして下さい。\n
*/
// ===========================================================================
extern void GsTrialExit(void);

// ===========================================================================
//	GsTrialIsTrial
/*!
	体験版判定

	@return 真：体験版　偽：製品版
	@note
	現在の状態が、体験版かどうか判定します。\n
	PS3とXbox360そしてiPhone以外の場合は、必ずFALSEを返します。\n
	PS3とiPhoneは、初期化以降、この関数の返す値が変わることはありません。\n
	Xbox360の場合は、GsTrialCheckStart関数による状態チェックを行なうたびに
	返す値が変化する可能性がありますが、
	一度FALSEを返した場合は以降TRUEを返すことはなくなります。\n
*/
// ===========================================================================
extern BOOL GsTrialIsTrial(void);

// ===========================================================================
//	GsTrialCheckStart
/*!
	状態チェック開始

	@note
	Xbox360の場合は、体験版か製品版かの状態が動的に変化するので、
	体験版かどうかの判定を行う前に、
	この関数で現在の状態のチェックを行なうようにして下さい。\n
	この状態に変化がある場合は、
	この関数呼出し後GsTrialCheckIsFinished関数がTRUEを返した段階で
	GsTrialIsTrial関数の戻り値が変化します。\n
	既に製品版となっている場合と、Xbox360以外の場合は、
	この関数は何も行ないません。\n
*/
// ===========================================================================
extern void GsTrialCheckStart(void);

// ===========================================================================
//	GsTrialCheckIsFinished
/*!
	状態チェック完了判定

	@return 真：チェック完了　偽：チェック中
	@note
	GsTrialCheckStart関数で開始した状態チェックが完了したか判定します。\n
*/
// ===========================================================================
extern BOOL GsTrialCheckIsFinished(void);

// ===========================================================================
//	GsTrialStoreStart
/*!
	製品版の購入処理開始

	@note
	製品版の購入のためのインゲームストアの表示を開始します。\n
	既に製品版の状態で呼び出しても何も行ないません。\n
	Xbox360とPS3以外の場合は呼び出しても何も行ないません。\n
*/
// ===========================================================================
extern void GsTrialStoreStart(void);

// ===========================================================================
//	GsTrialStoreIsFinished
/*!
	製品版の購入処理完了判定

	@return 真：完了　偽：処理中
	@note
	GsTrialStoreStart関数で開始した購入処理が完了したか判定します。\n
*/
// ===========================================================================
extern BOOL GsTrialStoreIsFinished(void);

// ===========================================================================
//	GsTrialDebugSetTrial
/*!
	デバッグ用 体験版設定

	@param is_trial	[in] 真：体験版　偽：製品版
	@note
	デバッグを目的として、
	現在の体験版、製品版の状態を変更することができます。\n
	強制的に即時設定を行ないますので、
	初期化中や状態チェック中には呼び出さないことをお勧めします。\n
	Xbox360での「一度製品版になれば以降ずっと製品版」という制限に関わらず
	状態が変化します。\n
	MTD_DEBUGが定義されていない環境では何も行ないません。\n
*/
// ===========================================================================
extern void GsTrialDebugSetTrial(BOOL is_trial);

#if _XBOX
// ===========================================================================
//	GsTrialIsTrialDirect
/*!
	体験版判定(ダイレクト)

	@return 真：体験版　偽：製品版
	@note
	GsTrialIsTrial関数と同じく、体験版か製品版かを判定する関数になりますが、
	GsTrialIsTrial関数は、GsTrialCheckStart関数を呼び出さなければ
	戻り値が変化しないのに対して、
	この関数は、リアルタイムに変化します。\n
	(製品版ライセンスを持ったプロフィールがサインインしたら即時にFALSEを返す)\n
*/
// ===========================================================================
extern BOOL GsTrialIsTrialDirect(void);

// ===========================================================================
//	GsTrialApplyDirect
/*!
	製品版フラグ設定

	@note
	通常は、GsTrialCheckStart関数を呼び出すことで、
	GsTrialIsTrial関数の戻り値が変化しますが、
	GsTrialIsTrialDirect関数がFALSEを返し、
	GsTrialIsTrial関数がTRUEを返す状態でのみ、
	この関数を呼び出すことで、
	GsTrialIsTrial関数がFALSEを返すようになります。\n
	GsTrialCheckStart関数は即時にフラグが切り替わらない可能性があるのに対し、
	この関数は、正しく呼び出されたのであれば、
	即時にフラグが切り替わることが保証されます。\n
*/
// ===========================================================================
extern void GsTrialApplyDirect(void);
#endif // _XBOX

#if defined(MTD_DEBUG)
// ===========================================================================
//! デバッグ用イベント
// ===========================================================================
extern void GsTrialDebugEvent(void* arg);
#endif // defined(MTD_DEBUG)

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
