// =======================================================================
/*!
  @file	gsTrophy.h
  @brief 実績・トロフィーシステム

  @author Keisuke Tanaka
 				Copyright(c) 2009 Dimps
  $Id: gsTrophy.h 2 2011-04-11 05:21:26Z thamada $
 */
// =======================================================================
/*
 * $Log$
 */


/* 重複インクルード回避手法 */

#ifndef GS_TROPHY_H_
#define GS_TROPHY_H_

/*------ Include Files -------------------------------------------------*/

/*------ Macros --------------------------------------------------------*/
#define GSD_TROPHY_ITEM_NUM		(12)		//!< 獲得可能トロフィーの数

/*------ Macro Functions -----------------------------------------------*/

/*------ Definitions ---------------------------------------------------*/

/*------ External Declarations -----------------------------------------*/
// =======================================================================
// GsTrophyInit
/*!
  トロフィーシステム初期化
  
  @note
  獲得済み情報がクリアされます。
 */
// =======================================================================
extern void GsTrophyInit(void);

// =======================================================================
// GsTrophyExit
/*!
  トロフィーシステム終了
 */
// =======================================================================
extern void GsTrophyExit(void);

// =======================================================================
// GsTrophyResetForAccount
/*!
  アカウント毎リセット処理
  
  @note
  サインインしたアカウント毎に必要なリセット処理を行います。
  サインインしているアカウントが変わった際には必ず呼び出してください。
  （アカウントが変わっていない場合に呼んでも問題ありません）
 */
// =======================================================================
extern void GsTrophyResetForAccount(void);

// =======================================================================
// GsTrophyUpdateAcquisition
/*!
  トロフィー獲得更新
  
  @param trophy_id	[in]	トロフィー番号
  
  @note
  トロフィーの獲得処理を行います。
  GsTrophyInit()以降に同IDで本関数を呼び出し済みである場合は何もしません。
 */
// =======================================================================
extern void GsTrophyUpdateAcquisition(Uint32 trophy_id);

// =======================================================================
// GsTrophyIsAcquired
/*!
  獲得済み判定
  
  @param trophy_id	[in]	トロフィー番号
  
  @retval TRUE	獲得済み
  @retval FALSE	未獲得
  
  @note
  GsTrophyInit()呼び出し以降に獲得済みか判定します。
  基本的には、連続呼び出しを防ぐ等の目的のために使用するものであり、
  本関数が参照する獲得済み記録テーブルは任意のタイミングでクリアされている場合があります
  （サインインしているアカウントが変わった場合など）。
  そのため、ユーザに情報表示するためなどの目的で本関数を使用しないでください。
 */
// =======================================================================
extern BOOL GsTrophyIsAcquired(Uint32 trophy_id);

// =======================================================================
// GsTrophyAvatarUpdateAcquisition
/*!
  アバターアワード獲得更新
  
  @param trophy_id	[in]	アバターアワード番号
  
  @note
  アバターアワードの獲得処理を行います。
  GsTrophyInit()以降に同IDで本関数を呼び出し済みである場合は何もしません。
 */
// =======================================================================
extern void GsTrophyAvatarUpdateAcquisition(Uint32 avaw_id);

// =======================================================================
// GsTrophyAvatarIsAcquired
/*!
  アバターアワード獲得済み判定
  
  @param avaw_id	[in]	アバターアワード番号
  
  @retval TRUE	獲得済み
  @retval FALSE	未獲得
  
  @note
  GsTrophyInit()呼び出し以降に獲得済みか判定します。
  基本的には、連続呼び出しを防ぐ等の目的のために使用するものであり、
  本関数が参照する獲得済み記録テーブルは任意のタイミングでクリアされている場合があります
  （サインインしているアカウントが変わった場合など）。
  そのため、ユーザに情報表示するためなどの目的で本関数を使用しないでください。
 */
// =======================================================================
extern BOOL GsTrophyAvatarIsAcquired(Uint32 avaw_id);

// =======================================================================
// test_func
/*!
  関数機能
 
  @param param0 [in] 入力引数0説明
  @param param1 [out] 出力ポインタ引数1説明
  @param param2 [io] 入出力ポインタ引数2説明
 
  @return 返値説明
 
  @note
  補足説明
 */
// =======================================================================

#endif /* GS_TROPHY_H_ */
