// =======================================================================
/*!
  @file	hgSoundPlatform
  @brief HOGサウンド プラットフォーム専用処理

  @author Keisuke Tanaka
 				Copyright(c) 2009 Dimps
  $Id: hgSoundPlatform.cpp 2 2011-04-11 05:21:26Z thamada $
 */
// =======================================================================
/*
 * $Log$
 */

/*------ Include Files -------------------------------------------------*/
#include "pch.h"
#include "gsSound.h"

#include "hgSoundPlatform.h"

/*------ Macros --------------------------------------------------------*/

/*------ Macro Functions -----------------------------------------------*/

/*------ Definitions ---------------------------------------------------*/

/*------ External Declarations -----------------------------------------*/

/*------ Static Declarations -------------------------------------------*/

/*------ Global Variables ----------------------------------------------*/

/*------ Static Variables ----------------------------------------------*/

/*------ Global Functions ----------------------------------------------*/
#if _WII
// =======================================================================
// HgSoundPfWiiCallbackEnterHBM
/*!
  Wii HBMへ移行時サウンド操作 コールバック関数
  
  @param arg	[io]	引数
 */
// =======================================================================
void HgSoundPfWiiCallbackEnterHBM(void *arg)
{
	// HBM移行処理初期化
	GsSoundEnterHBM(arg);
}

// =======================================================================
// HgSoundPfWiiCallbackLeaveHBM
/*!
  Wii HBMから復帰時サウンド操作 コールバック関数
  
  @param arg	[io]	引数
 */
// =======================================================================
void HgSoundPfWiiCallbackLeaveHBM(void *arg)
{
	// HBMからの復帰処理初期化
	GsSoundLeaveHBM(arg);
}

// =======================================================================
// HgSoundPfWiiCallbackFadeHBM
/*!
  Wii HBMフェード処理中 サウンド操作 コールバック関数
  
  @param arg	[io]	引数
  
  @retval 1		フェード中
  @retval -1	フェード中ではない
 */
// =======================================================================
Sint32 HgSoundPfWiiCallbackFadeHBM(void *arg)
{
	return GsSoundFadeHBM(arg);
}
#endif /* _WII */

/*------ Static Functions ----------------------------------------------*/
// =======================================================================
// test_func
/*!
  関数機能
 
  @param param0 [in] 入力引数0説明
  @param param1 [out] 出力ポインタ引数1説明
  @param param2 [io] 入出力ポインタ引数2説明
 
  @return 返値説明
 
  @note
  補足説明
 */
// =======================================================================
