// ===========================================================================
/*!
	@file	map_file_format.h
	@brief	マップファイルフォーマット

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================
/*!
	@page map

	@section map_info 概要
	マップは、サイズ64x64のブロックにより構成されています。\n
	ブロックをマップ左上から右下へ向けて
	横方向優先で配置したものがマップ情報となります。\n

	ブロックには、当たり情報や角度情報などのデータと見た目のデータの2種類あり、
	それぞれの情報へのインデックス配列としてマップが構成されます。\n

	ブロックには、差分情報、属性情報、角度情報の3つの情報があり、
	それぞれ別ファイルで扱われます。
	(3つのファイルをセットで扱う必要があります。)\n
	各情報は、サイズ8x8の単位で扱われ、その単位の8x8配列として構成されます。\n

	マップ内のイベントデータは、サイズ256x256のブロックに分けて管理されます。\n
	イベント情報、リング情報、装飾情報の3種類あり、
	それぞれ別ファイルで扱われます。\n
	イベントデータの座標は、ブロック内の座標として扱われます。\n


	@section map_df 差分情報ファイル
	マップの当たり情報を格納したファイルです。\n
	1つのブロックは、8x8の単位のデータを、64個保持しており、
	縦方向と横方向の、当たりピクセルと非当たりピクセルの情報が
	格納されています。\n
	ファイル先頭にブロック数が格納されており、
	その後ろに、ブロック単位の差分情報がブロック数分格納されています。\n


	@section map_at 属性情報ファイル
	マップの属性情報を格納したファイルです。\n
	1つのブロックは、8x8の単位のデータを、64個保持しています。\n
	ファイル先頭にブロック数が格納されており、
	その後ろに、ブロック単位の属性情報がブロック数分格納されています。\n


	@section map_di 角度情報ファイル
	マップの角度情報を格納したファイルです。\n
	1つのブロックは、8x8の単位のデータを、64個保持しています。\n
	ファイル先頭にブロック数が格納されており、
	その後ろに、ブロック単位の角度情報がブロック数分格納されています。\n


	@section map_mp マップ情報ファイル
	マップのブロック配置を格納したファイルです。\n
	保持するデータは、ブロックIDと、ブロックの反転＆回転情報となります。\n
	このファイルは、差分情報や属性情報のインデックスとして使用する場合や
	表示モデルのインデックスで使用する場合など、
	複数の目的で使用されます。\n
	ファイル先頭に縦横のブロック数が格納されており、
	その後ろに、ブロック情報がブロック数分格納されています。\n
	現状のブロック情報の構造上、あつかえる最大ブロック数は2048となります。\n


	@section map_md マップ描画情報ファイル
	マップの描画用情報を格納したファイルです。\n
	マップ描画の際に、あるブロックのモデルが複数ブロックにまたがる形で
	配置されている場合に、そのブロックが画面外に出て描画されなくなると
	不都合がある場合があります。\n
	この問題を解決するために、
	「このブロックの表示はどのブロックに依存しているか」
	という情報がブロック単位で格納されています。\n


	@section map_ev イベント情報ファイル
	マップ上に配置されたイベントの情報を格納したファイルです。\n
	マップ情報とは異なり、サイズ256x256のブロック単位での構成となります。\n
	イベント自体は別で管理されており、イベントのIDが格納されています。\n
	ファイル先頭に縦横のブロック数が格納されており、
	その後ろに、ブロック情報へのオフセットの配列が格納されています。\n
	1つのブロック情報は、先頭にイベント数が格納され、
	その後ろに、イベント数分のイベント情報が格納されています。\n


	@section map_rg リング情報ファイル
	マップ上に配置されたリングの情報を格納したファイルです。\n
	マップ情報とは異なり、サイズ256x256のブロック単位での構成となります。\n
	ファイル先頭に縦横のブロック数が格納されており、
	その後ろに、ブロック情報へのオフセットの配列が格納されています。\n
	1つのブロック情報は、先頭にリング数が格納され、
	その後ろに、リング数分のリング情報が格納されています。\n


	@section map_dc 装飾情報ファイル
	マップ上に配置された装飾の情報を格納したファイルです。\n
	マップ情報とは異なり、サイズ256x256のブロック単位での構成となります。\n
	装飾情報自体は別で管理され、装飾のIDが格納されています。\n
	ファイル先頭に縦横のブロック数が格納されており、
	その後ろに、ブロック情報へのオフセットの配列が格納されています。\n
	1つのブロック情報は、先頭に装飾数が格納され、
	その後ろに、装飾数分の装飾情報が格納されています。\n


	@sa map.h
*/
#pragma once

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）

// ***************************************************************************
// 差分情報ファイル(*.df)
// ***************************************************************************
// ===========================================================================
//	struct DF_HEADER
// ---------------------------------------------------------------------------
//!	差分情報ファイルヘッダ
// ===========================================================================
typedef struct tag_DF_HEADER {
	Uint32			block_num;			//!< ブロック数(0 - 2047)
} DF_HEADER; // 4byte

// ===========================================================================
//	struct DF_BLOCK
// ---------------------------------------------------------------------------
//!	差分情報ブロック
// ===========================================================================
typedef struct tag_DF_BLOCK {
	Uint8			df[8][8][8];		//!< 差分情報
} DF_BLOCK; // 512byte


// ***************************************************************************
// 属性情報ファイル(*.at)
// ***************************************************************************
// ===========================================================================
//	struct AT_HEADER
// ---------------------------------------------------------------------------
//!	属性情報ファイルヘッダ
// ===========================================================================
typedef struct tag_AT_HEADER {
	Uint32			block_num;			//!< ブロック数(0 - 2047)
} AT_HEADER; // 4byte

// ===========================================================================
//	struct AT_BLOCK
// ---------------------------------------------------------------------------
//!	属性情報ブロック
// ===========================================================================
typedef struct tag_AT_BLOCK {
	Uint8			at[8][8];			//!< 属性情報
} AT_BLOCK; // 64byte


// ***************************************************************************
// 角度情報ファイル(*.di)
// ***************************************************************************
// ===========================================================================
//	struct DI_HEADER
// ---------------------------------------------------------------------------
//!	角度情報ファイルヘッダ
// ===========================================================================
typedef struct tag_DI_HEADER {
	Uint32			block_num;			//!< ブロック数(0 - 2047)
} DI_HEADER; // 4byte

// ===========================================================================
//	struct DI_BLOCK
// ---------------------------------------------------------------------------
//!	角度情報ブロック
// ===========================================================================
typedef struct tag_DI_BLOCK {
	Uint8			di[8][8];			//!< 角度情報
} DI_BLOCK; // 64byte


// ***************************************************************************
// マップ情報ファイル(*.mp)
// ***************************************************************************
// ===========================================================================
//	struct MP_HEADER
// ---------------------------------------------------------------------------
//!	マップ情報ファイルヘッダ
// ===========================================================================
typedef struct tag_MP_HEADER {
	Uint16			map_w;				//!< ブロック単位でのマップ横サイズ
	Uint16			map_h;				//!< ブロック単位でのマップ縦サイズ
} MP_HEADER; // 4byte

// ===========================================================================
//	struct MP_BLOCK
// ---------------------------------------------------------------------------
//!	マップ情報ブロック
// ===========================================================================
typedef struct tag_MP_BLOCK {
#if _PS3 | _XBOX | _WII
	Uint16	flip_v	: 1;				//!< 縦フリップ
	Uint16	flip_h	: 1;				//!< 横フリップ
	Uint16	rot		: 2;				//!< 90度単位の回転量
	Uint16	id		: 12;				//!< ID
#else
	Uint16	id		: 12;				//!< ID
	Uint16	rot		: 2;				//!< 90度単位の回転量
	Uint16	flip_h	: 1;				//!< 横フリップ
	Uint16	flip_v	: 1;				//!< 縦フリップ
#endif
} MP_BLOCK; // 2byte


// ***************************************************************************
// マップ描画情報ファイル(*.md)
// ***************************************************************************
// ===========================================================================
//	struct MD_HEADER
// ---------------------------------------------------------------------------
//!	マップ描画情報ファイルヘッダ
// ===========================================================================
typedef struct tag_MD_HEADER {
	Uint16			map_w;				//!< ブロック単位でのマップ横サイズ
	Uint16			map_h;				//!< ブロック単位でのマップ縦サイズ
} MD_HEADER; // 4byte

// ===========================================================================
//	struct MD_BLOCK
// ---------------------------------------------------------------------------
//!	マップ描画情報ブロック
// ===========================================================================
typedef struct tag_MD_BLOCK {
#if _PS3 | _XBOX | _WII
	Sint8			ofst_y	: 4;		//!< 描画ブロック縦オフセット(-8 - 7)
	Sint8			ofst_x	: 4;		//!< 描画ブロック横オフセット(-8 - 7)
#else
	Sint8			ofst_x	: 4;		//!< 描画ブロック横オフセット(-8 - 7)
	Sint8			ofst_y	: 4;		//!< 描画ブロック縦オフセット(-8 - 7)
#endif
} MD_BLOCK; // 1byte


// ***************************************************************************
// イベント情報ファイル(*.ev)
// ***************************************************************************
// ===========================================================================
//	struct EV_HEADER
// ---------------------------------------------------------------------------
//!	イベント情報ファイルヘッダ
// ===========================================================================
typedef struct tag_EV_HEADER {
	Uint16			map_w;				//!< ブロック単位でのマップ横サイズ
	Uint16			map_h;				//!< ブロック単位でのマップ縦サイズ
} EV_HEADER; // 4byte

// ===========================================================================
//	struct EV_OFFSET
// ---------------------------------------------------------------------------
//!	イベント情報ブロックオフセット
// ===========================================================================
typedef struct tag_EV_OFFSET {
	Uint32			ofst;				//!< ブロック情報へのオフセット
} EV_OFFSET; // 4byte

// ===========================================================================
//	struct EV_BLOCK
// ---------------------------------------------------------------------------
//!	イベント情報ブロック
// ===========================================================================
typedef struct tag_EV_BLOCK {
	Uint16			ev_num;				//!< イベント数
} EV_BLOCK; // 2byte

// ===========================================================================
//	struct EV_INFO
// ---------------------------------------------------------------------------
//!	イベント情報
// ===========================================================================
typedef struct tag_EV_INFO {
	Uint8			x;					//!< X座標
	Uint8			y;					//!< Y座標
	Uint16			id;					//!< ID
	Uint16			flag;				//!< フラグ
	Sint8			rect_x;				//!< 矩形左上X座標
	Sint8			rect_y;				//!< 矩形左上Y座標
	Uint8			rect_w;				//!< 矩形横サイズ
	Uint8			rect_h;				//!< 矩形縦サイズ
	Uint16			user;				//!< ユーザパラメータ
} EV_INFO; // 12byte


// ***************************************************************************
// リング情報ファイル(*.rg)
// ***************************************************************************
// ===========================================================================
//	struct RG_HEADER
// ---------------------------------------------------------------------------
//!	リング情報ファイルヘッダ
// ===========================================================================
typedef struct tag_RG_HEADER {
	Uint16			map_w;				//!< ブロック単位でのマップ横サイズ
	Uint16			map_h;				//!< ブロック単位でのマップ縦サイズ
} RG_HEADER; // 4byte

// ===========================================================================
//	struct RG_OFFSET
// ---------------------------------------------------------------------------
//!	リング情報ブロックオフセット
// ===========================================================================
typedef struct tag_RG_OFFSET {
	Uint32			ofst;				//!< ブロック情報へのオフセット
} RG_OFFSET; // 4byte

// ===========================================================================
//	struct RG_BLOCK
// ---------------------------------------------------------------------------
//!	リング情報ブロック
// ===========================================================================
typedef struct tag_RG_BLOCK {
	Uint16			rg_num;				//!< リング数
} RG_BLOCK; // 2byte

// ===========================================================================
//	struct RG_INFO
// ---------------------------------------------------------------------------
//!	リング情報
// ===========================================================================
typedef struct tag_RG_INFO {
	Uint8			x;					//!< X座標
	Uint8			y;					//!< Y座標
} RG_INFO; // 2byte


// ***************************************************************************
// 装飾情報ファイル(*.dc)
// ***************************************************************************
// ===========================================================================
//	struct DC_HEADER
// ---------------------------------------------------------------------------
//!	装飾情報ファイルヘッダ
// ===========================================================================
typedef struct tag_DC_HEADER {
	Uint16			map_w;				//!< ブロック単位でのマップ横サイズ
	Uint16			map_h;				//!< ブロック単位でのマップ縦サイズ
} DC_HEADER; // 4byte

// ===========================================================================
//	struct DC_OFFSET
// ---------------------------------------------------------------------------
//!	装飾情報ブロックオフセット
// ===========================================================================
typedef struct tag_DC_OFFSET {
	Uint32			ofst;				//!< ブロック情報へのオフセット
} DC_OFFSET; // 4byte

// ===========================================================================
//	struct DC_BLOCK
// ---------------------------------------------------------------------------
//!	装飾情報ブロック
// ===========================================================================
typedef struct tag_DC_BLOCK {
	Uint16			dc_num;				//!< 装飾数
} DC_BLOCK; // 2byte

// ===========================================================================
//	struct DC_INFO
// ---------------------------------------------------------------------------
//!	装飾情報
// ===========================================================================
typedef struct tag_DC_INFO {
	Uint8			x;					//!< X座標
	Uint8			y;					//!< Y座標
	Uint16			id;					//!< ID
} DC_INFO; // 4byte

// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
