// ==========================================================================
/*!
  @file mtMath.h
  @brief MT仕様算術演算

  @author Ishizaki
				Copyright(c) 2009 Dimps

  $Id: mtMath.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ==========================================================================
/*
 * Memo
 *
 */

#ifndef MT_MATH_
#define MT_MATH_


//----- Include Files -------------------------------------------------------
#include "mt.h"
#include "fx.h"

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------

//----- Macros --------------------------------------------------------------
//! ２πラジアンの角度
#define MTD_MATH_MAX_ANGLE		((Uint32)0x00010000)
//! ２πラジアンの角度のマスク
#define MTD_MATH_ANGLE_MASK		((Uint32)MTD_MATH_MAX_ANGLE-1)

//----- Macros Functions ----------------------------------------------------

// ================================================================
// MTM_MATH_SWAP
/*!
  値を入れ替える
  
  @param    a   [io] 値
  @param    b   [io] 値
 */
// ================================================================
#define MTM_MATH_SWAP( a, b )   {(a)^=(b);(b)^=(a);(a)^=(b);}

// ================================================================
// MTM_MATH_MAX
/*!
  入力された値の大きい方を取得する
  
  @param    a   [in] 値
  @param    b   [in] 値
  
  @return   大きい方の値 a or b
 */
// ================================================================
#define MTM_MATH_MAX( a, b ) (((a)>(b))?(a):(b))

// ================================================================
// MTM_MATH_MIN
/*!
  入力された値の小さい方を取得する
  
  @param    a   [in] 値
  @param    b   [in] 値
  
  @return   小さい方の値 a or b
 */
// ================================================================
#define MTM_MATH_MIN( a, b )    (((a)<(b))?(a):(b))

// ================================================================
// MTM_MATH_CLIP
/*!
  入力された値を指定範囲に収めた値を取得する
  
  @param    a       [in] 値
  @param    low     [in] 最小値
  @param    high    [in] 最大値
  
  @return   クリッピング値
 */
// ================================================================
#define MTM_MATH_CLIP( a, low, high )   ((a)<(low)?(low):(((a) > (high))?(high):(a)))

// ================================================================
// MTM_MATH_ABS
/*!
  絶対値を求める
  
  @param    a   [in] 値
  
  @return   絶対値
 */
// ================================================================
#define MTM_MATH_ABS(a) (((a)<0)?(-(a)):(a))

// ==========================================================================
// mtMathSin
/*!
	Sin

	@param	angle	[in]	角度

	@return	余弦の近似値
 */
// ==========================================================================
#define mtMathSin(angle)	FX_Sin(angle)

// ==========================================================================
// mtMathCos
/*!
	Cos

	@param	angle	[in]	角度

	@return	余弦の近似値
 */
// ==========================================================================
#define mtMathCos(angle)	FX_Cos(angle)


//----- External Variables --------------------------------------------------
extern u32  _mt_math_rand;      ///< ランダム

//----- External Declarations ---------------------------------------------
// ==========================================================================
// mtMathSRand
/*!
	ランダムシードを設定する

	@param	seed	[in]	ランダムシード
 */
// ==========================================================================
inline void mtMathSRand( u32 seed )
{
    _mt_math_rand   = seed;
}

// ==========================================================================
// mtMathRand
/*!
	ランダム値を取得する

	@return	ランダム値
 */
// ==========================================================================
inline u16 mtMathRand( void )
{
    _mt_math_rand   = 1663525L * _mt_math_rand + 1013904223L;
    return (u16)( _mt_math_rand >> 16 );
}



#if	defined(__cplusplus)
} /* extern "C" */
#endif


#endif // MT_MATH_

//----- Include Files -------------------------------------------------------
