// ================================================================
/*!
  @file syEvtSys.h
  @brief イベントシステム

  @author Ishizaki
                Copyright(c) 2009 Dimps

  $Id: syEvtSys.h 2 2011-04-11 05:21:26Z thamada $
  $Date:: 2011-04-11 14:21:26 +0900#$
 */
// ================================================================
/*
 * Memo
 *
 *
 */

#ifndef _SY_EVTSYS_H_
#define _SY_EVTSYS_H_


//----- Include Files -------------------------------------------------------
#include "mt.h"

#if	defined(__cplusplus)
extern "C" {
#endif

//----- Definitions ---------------------------------------------------------
/***************************************************************************/
// ユーザー書き換え設定
/***************************************************************************/
/*** イベントデータ ***/
#define	SYD_NEXT_EVT_MAX				(8)			//!< 次へのイベント遷移最大数

/*** イベント切り替え時 引数 ***/
#define SYD_EVT_ARG_SIZE				(8)			//!< イベント切り替え時 引数サイズ

/*** オーバーレイ ***/
#define SYD_OVL_CONTROL_NUM				(1)			//!< オーバーレイ設定管理数

/***************************************************************************/
// 以下システム
/***************************************************************************/
/*** イベント管理 ***/
/* イベントフラグ */
#define	SYD_EVT_FLAG_NOP		(0)			//!< リクエストなし
#define	SYD_EVT_FLAG_REQ		(1)			//!< 次イベントリクエスト
#if defined _DS
#define	SYD_EVT_FLAG_OVL_WAIT	(2)			//!< オーバーレイ切り換え待ち
#endif // #if defined _DS


#if defined _DS
/***************************************************************************/
// オーバーレイ管理用
/***************************************************************************/
typedef struct _sys_ovl_context {
	FSOverlayID	ovl_id;							//!< 管理中オーバーレイID
	void		*addr;							//!< オーバーレイ転送先アドレス
	u32			size;							//!< オーバーレイサイズ
} SYS_OVL_CONTEXT;
#endif // #if defined _DS

/***************************************************************************/
// イベント管理用
/***************************************************************************/
typedef struct tag_sys_evt_data {
	void		(*init_func)(void*);				//!< イベント初期化関数
	void		(*exit_func)(void);					//!< イベント終了関数
	void		(*reset_func)(void);				//!< ソフトリセット時実行関数

	void		(*init_sys_func)(void);				//!< システム側イベント初期化関数
	void		(*exit_sys_func)(void);				//!< システム側イベント終了関数

	s16			next_evt_id[SYD_NEXT_EVT_MAX];		//!< 次シーンID
	u32			attr;								//!< 属性
#if defined _DS
	FSOverlayID	ovl_id[SYD_OVL_CONTROL_NUM];		//!< オーバーレイID
#endif // #if defined _DS
} SYS_EVT_DATA;

/* イベント管理 */
typedef struct tag_sys_evt_info {
	/* イベントデータ保存 */
	const SYS_EVT_DATA	*evt_data;					//!< イベントデータ
	s32					evt_data_num;				//!< イベントデータ数

	/* 現在イベント管理用 */
	const SYS_EVT_DATA	*cur_evt_data;				//!< 現在イベントデータ
	s16					cur_evt_id;					//!< 現在イベントID
	s16					old_evt_id;					//!< 前イベントID

	/* 次イベント管理用 */
	const SYS_EVT_DATA	*next_evt_data;				//!< 次イベントデータ
													//!< 未確定時 NULL
	/* イベントチェンジ用 */
	s16					req_evt_id;					//!< イベントリクエストID
	s16					req_evt_case;				//!< イベントリクエストケース番号
	u32					flag;						//!< フラグ

	/* イベント切り替え時 引数 */
	u32					arg_size;					//!< 引数サイズ
	u8					arg[SYD_EVT_ARG_SIZE];		//!< 引数バッファ

#if defined _DS
	/* オーバーレイ管理 */
	SYS_OVL_CONTEXT		ovl_context[SYD_OVL_CONTROL_NUM];	//!< オーバーレイコンテキスト
#endif // #if defined _DS

} SYS_EVT_INFO;

//----- Macros --------------------------------------------------------------

//----- Macros Functions ----------------------------------------------------

//----- External Declarations -----------------------------------------------
// ==========================================================================
// SyInitEvtSys
/*!
 *	イベント管理システム初期化
 *
 *	@param	evt_data		[in]	イベントデータ
 *	@param	evt_data_num	[in]	イベントデータ数
 *	@param	start_evt_id	[in]	開始時イベントID
 *	@param	tcb_use			[in]	タスクシステムの使用設定
 *	@param	pri				[in]	タスクシステム使用時のタスク優先
 *	@param	group			[in]	タスクシステム使用時のタスクグループ
 *
 *	@note
 *		tcb_use の設定により、イベントシステムを自動実行させるか、\n
 *		任意に実行させるかを決めます。\n
 *		FALSEに設定した場合は、初期化後にメインループ等で syEvtSys を呼び出して下さい。
 */
// ==========================================================================
extern void SyInitEvtSys(const SYS_EVT_DATA *evt_data, s32 evt_data_num, s16 start_evt_id, BOOL tcb_use, u16 pri, u8 group);

// ==========================================================================
// SyExitEvtSys
/*!
 *	イベント管理システムの終了
 */
// ==========================================================================
extern void SyExitEvtSys(void);

// ==========================================================================
// syEvtSys
/*!
 *	メインシステム
 */
// ==========================================================================
//extern void syEvtSys(void);

/****************************************************************************/
// オーバーレイ切り替え用コールバック
/****************************************************************************/
#if defined _DS
// ==========================================================================
// syEvtSysOvlCallBack
/*!
 *	メインシステム オーバーレイ切り換え時コールバック
 */
// ==========================================================================
//extern void syEvtSysOvlCallBack(void);
#endif // #if defined _DS

/****************************************************************************/
// イベント情報インターフェース
/****************************************************************************/
// ==========================================================================
// SyGetEvtInfo
/*!
 *	イベント情報のポインタを取得する
 *
 *	@return	イベント情報ポインタ
 */
// ==========================================================================
extern SYS_EVT_INFO* SyGetEvtInfo(void);

/****************************************************************************/
// 次イベント確定
/****************************************************************************/
// ==========================================================================
// SyDecideEvtCase
/*!
 *	現在のイベントデータのevt_case番目に設定されているイベントに移行確定時呼び出し
 *
 *	@param	evt_case	[in]	次イベントのケース番号
 */
// ==========================================================================
extern void SyDecideEvtCase(s16 evt_case);

// ==========================================================================
// SyDecideEvtIdCase
/*!
 *	リクエストIDをイベント遷移リストに登録されているかチェックして遷移
 *
 *	@param	req_id	[in]	次イベントのケース番号
 */
// ==========================================================================
extern void SyDecideEvtIdCase(s16 req_id);

// ==========================================================================
// SyDecideEvt
/*!
 *	req_id で示される イベントIDを持つイベントに移行確定時呼び出し
 *
 *	@param	req_id	[in]	次イベントのID
 *
 *	@note
 *	こちらはシステム等による強制イベント移行処理時に使用する\n
 *	通常のイベント移行はSyDecideEvtCaseで行う
 */
// ==========================================================================
extern void SyDecideEvt(s16 req_id);

/****************************************************************************/
// イベント切り換え
/****************************************************************************/
// ==========================================================================
// SyChangeNextEvt
/*!
 *
 *	次のイベントに切り替える
 *
 *	@note
 *	イベント終了時に呼び出す
 */
// ==========================================================================
extern void SyChangeNextEvt(void);

// ==========================================================================
// SyChangeNextEvtArg
/*!
 *	次のイベントに切り替える(引数付き)
 *
 *	@param	arg_size	[in]	引数サイズ
 *	@param	arg_buf		[in]	引数バッファ
 *
 *	@note
 *	イベント終了時に呼び出す \n
 *	SYD_EVT_ARG_SIZE バイトまでのデータを次の初期化に引き渡します \n
 *	引き渡された値は、次のイベントの初期化関数内のみで有効になります
 */
// ==========================================================================
extern void SyChangeNextEvtArg(u32 arg_size, void *arg_buf);


//----- External Variables --------------------------------------------------

#if	defined(__cplusplus)
} /* extern "C" */
#endif

#endif // _SY_EVTSYS_H_

//----- Include Files -------------------------------------------------------
