/*****************************************************************************/
/*      amDebug.h                   Author : Takashi Nakano                  */
/*            Copyright(c) 2009 Dimps CORP. All Rights Reserved.             */
/*---------------------------------------------------------------------------*/
/* デバッグ・システムライブラリヘッダ                                        */
/*---------------------------------------------------------------------------*/
/* Date          Ver    Comment                                              */
/* 090327-       0.01   first version                                        */
/*****************************************************************************/

#ifndef _AM_DEBUG_H
#define _AM_DEBUG_H

/*--- Include Files (Pre Definitions) ---------------------------------------*/

/*--- Definitions -----------------------------------------------------------*/

// フレームレートの確認
#define AMD_DEBUG_FRAME_RATE	(0)

#define AMD_TEXT_WIDTH			(1280 / 16)
#define AMD_TEXT_HEIGHT			(720 / 16)

/*--- Macros ----------------------------------------------------------------*/

/*--- Include Files (Post Definitions) --------------------------------------*/

/*--- External Valiables ----------------------------------------------------*/

/*--- External Functions ----------------------------------------------------*/

/*****************************************************************************/
/* void amSystemExitEnable(Sint32 flag)                                      */
/*---------------------------------------------------------------------------*/
/* [INPUT]  ゲームの終了を許可するかどうか                                   */
/* [FUNCTION]  ゲームの終了許可の設定                                        */
/*****************************************************************************/
void amSystemExitEnable(Sint32 flag);

/*****************************************************************************/
/* void amSystemSetFrameRateMain(float rate)                                 */
/*---------------------------------------------------------------------------*/
/* [INPUT]  メインスレッドのフレームレート(1/60秒基準での倍率)               */
/* [FUNCTION]  メインスレッドのフレームレートの設定                          */
/*****************************************************************************/
void amSystemSetFrameRateMain(float rate);

/*****************************************************************************/
/* void amSystemSetFrameRateDraw(float rate)                                 */
/*---------------------------------------------------------------------------*/
/* [INPUT]  描画スレッドのフレームレート(1/60秒基準での倍率)                 */
/* [FUNCTION]  描画スレッドのフレームレートの設定                            */
/*****************************************************************************/
void amSystemSetFrameRateDraw(float rate);

/*****************************************************************************/
/* float amSystemGetFrameRateMain(void)                                      */
/*---------------------------------------------------------------------------*/
/* [RETURN]  メインスレッドのフレームレート(1/60秒基準での倍率)              */
/* [FUNCTION]  メインスレッドのフレームレートの取得                          */
/*****************************************************************************/
float amSystemGetFrameRateMain(void);

/*****************************************************************************/
/* float amSystemGetFrameRateDraw(void)                                      */
/*---------------------------------------------------------------------------*/
/* [RETURN]  描画スレッドのフレームレート(1/60秒基準での倍率)                */
/* [FUNCTION]  描画スレッドのフレームレートの取得                            */
/*****************************************************************************/
float amSystemGetFrameRateDraw(void);

/*****************************************************************************/
/* float amDebugGetPerformanceMain(void)                                     */
/*---------------------------------------------------------------------------*/
/* [RETURN]  メインスレッドのCPU処理時間率(フレーム基準での%)                */
/* [FUNCTION]  メインスレッドのCPU処理時間率の取得                           */
/*****************************************************************************/
float amDebugGetPerformanceMain(void);

/*****************************************************************************/
/* float amDebugGetPerformanceDraw(void)                                     */
/*---------------------------------------------------------------------------*/
/* [RETURN]  描画スレッドのCPU処理時間率(フレーム基準での%)                  */
/* [FUNCTION]  描画スレッドのCPU処理時間率の取得                             */
/*****************************************************************************/
float amDebugGetPerformanceDraw(void);

/*****************************************************************************/
/* float amDebugGetPerformanceGPU(void)                                      */
/*---------------------------------------------------------------------------*/
/* [RETURN]  GPU処理時間率(1/60秒基準での%)                                  */
/* [FUNCTION]  GPU処理時間率の取得                                           */
/*****************************************************************************/
float amDebugGetPerformanceGPU(void);

/*****************************************************************************/
/* void amDebugSetPerformanceMain(float frame)                               */
/*---------------------------------------------------------------------------*/
/* [INPUT]  frame : メインスレッドのCPU処理時間率(1/60秒基準での%)           */
/* [FUNCTION]  メインスレッドのCPU処理時間率の設定                           */
/*****************************************************************************/
void amDebugSetPerformanceMain(float frame);

/*****************************************************************************/
/* void amDebugSetPerformanceDraw(float frame)                               */
/*---------------------------------------------------------------------------*/
/* [INPUT]  frame : 描画スレッドのCPU処理時間率(1/60秒基準での%)             */
/* [FUNCTION]  描画スレッドのCPU処理時間率の設定                             */
/*****************************************************************************/
void amDebugSetPerformanceDraw(float frame);

/*****************************************************************************/
/* void amDebugSetPerformanceGPU(void)                                       */
/*---------------------------------------------------------------------------*/
/* [FUNCTION]  GPU処理時間率の設定                                           */
/*****************************************************************************/
void amDebugSetPerformanceGPU(void);

/*****************************************************************************/
/* void amDebugDisplayPerformance(Sint32 pos_x, Sint32 pos_y)                */
/*---------------------------------------------------------------------------*/
/* [INPUT]  pos_x, pos_y : 表示位置                                          */
/* [FUNCTION]  CPU処理時間率の表示                                           */
/*****************************************************************************/
void amDebugDisplayPerformance(Sint32 pos_x = AMD_TEXT_WIDTH - 22, Sint32 pos_y = 0);


#endif
