/*****************************************************************************/
/*      amTimer.h                   Author : Takashi Nakano                  */
/*            Copyright(c) 2009 Dimps CORP. All Rights Reserved.             */
/*---------------------------------------------------------------------------*/
/* タイマーライブラリヘッダ                                                  */
/*---------------------------------------------------------------------------*/
/* Date          Ver    Comment                                              */
/* 090318-       0.01   first version                                        */
/*****************************************************************************/

#ifndef _AM_TIMER_H
#define _AM_TIMER_H

/*--- Include Files (Pre Definitions) ---------------------------------------*/

#if _PS3
#include <sys/event.h>
#include <sys/sys_time.h>
#elif _WII
#include <revolution/os.h>
#elif _IPHONE
#include <sys/time.h>
#include <signal.h>
#include <time.h>
#include <semaphore.h>
#endif

#include "amThread.h"


/*--- Definitions -----------------------------------------------------------*/

#define AMD_USE_PERFORMANCE_COUNTER			(_PC | _XBOX | _IPHONE)

// 計測タイマー
typedef struct {
	Uint64		count_start;		// スタートカウンタ
	Uint64		count_end;			// エンドカウンタ
	Sint32		delete_flag;		// メモリ解放フラグ
	float		count_freq;			// カウンタ精度(秒)
	float		frame;				// フレーム(1/60秒)
	float		msec;				// ミリ秒(1/1000秒)
	float		usec;				// マイクロ秒(1/1000000秒)
} AMS_TIMER;


// 周期タイマー
typedef struct {
	Sint32		delete_flag;		// メモリ解放フラグ
	Uint32		alarm_id;			// アラーム識別ID
#if _PC | _XBOX
#if AMD_USE_PERFORMANCE_COUNTER
	HANDLE		handle;
	float		count_freq;			// カウンタ精度(秒)
	Uint64		count_start;		// スタートカウンタ
	Uint64		count_end;			// エンドカウンタ
	Uint64		count_interval;		// カウンタインターバル
	AMS_MUTEX	mutex;
#else
	HANDLE		handle;
	HANDLE		handle_vsync;
#endif
#elif _PS3
	sys_timer_t	timer;
	sys_event_port_t	port;
	sys_event_queue_t	event;
#elif _WII
	OSAlarm		alarm;				// アラーム
	OSSemaphore	sema;				// セマフォ
#elif _IPHONE
	Uint32		timer_id;
	struct sigaction	action;
	struct sigevent		event;
	struct itimerval	tspec;
	sem_t		sema;
#if AMD_USE_PERFORMANCE_COUNTER
	AMS_TIMER	timer;
	Uint64		count_end;
	Uint64		count_interval;
#endif
#endif
} AMS_ALARM;


/*--- Macros ----------------------------------------------------------------*/

/*--- Include Files (Post Definitions) --------------------------------------*/

/*--- External Valiables ----------------------------------------------------*/

/*--- External Functions ----------------------------------------------------*/

/*****************************************************************************/
/* AMS_TIMER *amTimerCreate(AMS_TIMER *timer)                                */
/*---------------------------------------------------------------------------*/
/* [INPUT]  timer : 確保済みのタイマー構造体                                 */
/* [RETURN]  タイマー構造体                                                  */
/* [FUNCTION]  タイマーの作成                                                */
/*****************************************************************************/
AMS_TIMER *amTimerCreate(AMS_TIMER *timer = NULL);

/*****************************************************************************/
/* void amTimerDelete(AMS_TIMER *timer)                                      */
/*---------------------------------------------------------------------------*/
/* [RETURN]  タイマー構造体                                                  */
/* [FUNCTION]  タイマーの削除                                                */
/*****************************************************************************/
void amTimerDelete(AMS_TIMER *timer);

/*****************************************************************************/
/* void amTimerStart(AMS_TIMER *timer)                                       */
/*---------------------------------------------------------------------------*/
/* [INPUT]  timer : タイマー構造体                                           */
/* [FUNCTION]  タイマー計測の開始                                            */
/*****************************************************************************/
void amTimerStart(AMS_TIMER *timer);

/*****************************************************************************/
/* void amTimerEnd(AMS_TIMER *timer, Sint32 reset)                           */
/*---------------------------------------------------------------------------*/
/* [INPUT]  timer : タイマー構造体                                           */
/*          reset : タイマーをリセットするかどうか                           */
/* [FUNCTION]  タイマー計測の開始                                            */
/*****************************************************************************/
void amTimerEnd(AMS_TIMER *timer, Sint32 reset = 1);

/*****************************************************************************/
/* float amTimerGetFrame(AMS_TIMER *timer)                                   */
/*---------------------------------------------------------------------------*/
/* [INPUT]  timer : タイマー構造体                                           */
/* [RETURN] 経過時間(1/60秒単位)                                             */
/* [FUNCTION]  タイマー計測の結果                                            */
/*****************************************************************************/
inline float amTimerGetFrame(AMS_TIMER *timer)
{
	return	timer->frame;
}

/*****************************************************************************/
/* float amTimerGetmSec(AMS_TIMER *timer)                                    */
/*---------------------------------------------------------------------------*/
/* [INPUT]  timer : タイマー構造体                                           */
/* [RETURN] 経過時間(ミリ秒単位)                                             */
/* [FUNCTION]  タイマー計測の結果                                            */
/*****************************************************************************/
inline float amTimerGetMSec(AMS_TIMER *timer)
{
	return	timer->msec;
}

/*****************************************************************************/
/* float amTimerGetuSec(AMS_TIMER *timer)                                    */
/*---------------------------------------------------------------------------*/
/* [INPUT]  timer : タイマー構造体                                           */
/* [RETURN] 経過時間(マイクロ秒単位)                                         */
/* [FUNCTION]  タイマー計測の結果                                            */
/*****************************************************************************/
inline float amTimerGetuSec(AMS_TIMER *timer)
{
	return	timer->usec;
}

float amTimerCalcFrame(Uint64 count_start, Uint64 count_end, AMS_TIMER *timer);

/*****************************************************************************/
/* AMS_ALARM *amAlarmCreateTimer(AMS_ALARM *alarm)                           */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm : 確保済みの周期タイマー構造体                             */
/* [RETURN]  周期タイマー構造体                                              */
/* [FUNCTION]  周期タイマーの作成                                            */
/*****************************************************************************/
AMS_ALARM *amAlarmCreateTimer(AMS_ALARM *alarm);

/*****************************************************************************/
/* AMS_ALARM *amAlarmCreate(AMS_ALARM *alarm)                                */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm : 確保済みの周期タイマー構造体                             */
/* [RETURN]  周期タイマー構造体                                              */
/* [FUNCTION]  周期タイマーの作成                                            */
/*****************************************************************************/
AMS_ALARM *amAlarmCreate(AMS_ALARM *alarm);

/*****************************************************************************/
/* void amAlarmDelete(AMS_ALARM *alarm)                                      */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm    : 周期タイマー構造体                                    */
/* [FUNCTION]  周期タイマーの削除                                            */
/*****************************************************************************/
void amAlarmDelete(AMS_ALARM *alarm);

/*****************************************************************************/
/* void amAlarmSetTimerVSync(AMS_ALARM *alarm)                               */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm    : 周期タイマー構造体                                    */
/* [FUNCTION]  周期タイマーの設定(VSync周期)                                 */
/*****************************************************************************/
void amAlarmSetTimerVSync(AMS_ALARM *alarm);

/*****************************************************************************/
/* void amAlarmSetTimer(AMS_ALARM *alarm, Uint32 interval)                   */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm    : 周期タイマー構造体                                    */
/*          interval : 周期(マイクロ秒単位)                                  */
/* [FUNCTION]  周期タイマーの設定                                            */
/*****************************************************************************/
void amAlarmSetTimer(AMS_ALARM *alarm, Uint32 interval);

/*****************************************************************************/
/* void amAlarmSet(AMS_ALARM *alarm)                                         */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm    : 周期タイマー構造体                                    */
/* [FUNCTION]  周期タイマーのシグナル設定                                    */
/*****************************************************************************/
void amAlarmSet(AMS_ALARM *alarm);

/*****************************************************************************/
/* void amAlarmClear(AMS_ALARM *alarm)                                       */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm    : 周期タイマー構造体                                    */
/* [FUNCTION]  周期タイマーのシグナル解除                                    */
/*****************************************************************************/
void amAlarmClear(AMS_ALARM *alarm);

/*****************************************************************************/
/* void amAlarmWaitTimer(AMS_ALARM *alarm)                                   */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm    : 周期タイマー構造体                                    */
/* [FUNCTION]  周期タイマーの待機                                            */
/*****************************************************************************/
void amAlarmWaitTimer(AMS_ALARM *alarm);

/*****************************************************************************/
/* void amAlarmWaitVSync(AMS_ALARM *alarm)                                   */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm    : 周期タイマー構造体                                    */
/* [FUNCTION]  周期タイマーの待機(VSync同期)                                 */
/*****************************************************************************/
void amAlarmWaitVSync(AMS_ALARM *alarm);

/*****************************************************************************/
/* void amAlarmWait(AMS_ALARM *alarm)                                        */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm    : 周期タイマー構造体                                    */
/* [FUNCTION]  周期タイマーのシグナル待機                                    */
/*****************************************************************************/
void amAlarmWait(AMS_ALARM *alarm);

/*****************************************************************************/
/* void amAlarmUpdateTimer(AMS_ALARM *alarm)                                 */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm    : 周期タイマー構造体                                    */
/* [FUNCTION]  周期タイマーのアップデート                                    */
/*****************************************************************************/
void amAlarmUpdateTimer(AMS_ALARM *alarm);

/*****************************************************************************/
/* Sint32 amAlarmCheckTimer(AMS_ALARM *alarm)                                */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm    : 周期タイマー構造体                                    */
/* [FUNCTION]  周期タイマーのチェック                                        */
/*****************************************************************************/
Sint32 amAlarmCheckTimer(AMS_ALARM *alarm);

/*****************************************************************************/
/* Sint32 amAlarmCheck(AMS_ALARM *alarm)                                     */
/*---------------------------------------------------------------------------*/
/* [INPUT]  alarm    : 周期タイマー構造体                                    */
/* [RETURN]  指定時間経過しているかどうか                                    */
/* [FUNCTION]  周期タイマーのチェック                                        */
/*****************************************************************************/
Sint32 amAlarmCheck(AMS_ALARM *alarm);

#endif
