// ===========================================================================
/*!
	@file	amTxb.h
	@brief	TXBファイル操作モジュール宣言

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================

#if !defined(_AM_TXB_H)
#define _AM_TXB_H

// ----- Include Files ---------------------------------------（インクルード）
// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）

// ===========================================================================
//	amTxbConv
/*!
	TXBファイルのアドレス&エンディアン変換

	@param txb		[io] TXBファイルバッファへのポインタ
	@return 1:成功 0:失敗(TXBファイル以外)
	@note
	引数にNULLが指定された場合はアサートし何も行いません。\n
*/
// ===========================================================================
extern Sint32 amTxbConv(Uint8* txb);

// ===========================================================================
//	amTxbGetTexFileList
/*!
	テクスチャファイルリスト取得

	@param txb		[in] TXBファイルバッファへのポインタ
	@return テクスチャファイルリスト
*/
// ===========================================================================
extern NNS_TEXFILELIST* amTxbGetTexFileList(void* txb);

// ===========================================================================
//	amTxbGetCount
/*!
	テクスチャ数取得

	@param txb		[in] TXBファイルバッファへのポインタ
	@return テクスチャ数
	@note
	引数にNULLが指定された場合はアサートし0を返します。\n
*/
// ===========================================================================
extern Uint32 amTxbGetCount(const void* txb);

// ===========================================================================
//	amTxbGetMagFilter
/*!
	拡大フィルタ取得

	@param txb		[in] TXBファイルバッファへのポインタ
	@param tex_no	[in] テクスチャ番号
	@return 拡大フィルタ
	@note
	テクスチャ番号にamTxbGetCount関数の戻り値以上の値を指定した場合は
	アサートします。\n
*/
// ===========================================================================
extern NNF_TEXFILE_MAGFILTER amTxbGetMagFilter(const void* txb, Uint32 tex_no);

// ===========================================================================
//	amTxbGetMinFilter
/*!
	縮小フィルタ取得

	@param txb		[in] TXBファイルバッファへのポインタ
	@param tex_no	[in] テクスチャ番号
	@return 縮小フィルタ
	@note
	テクスチャ番号にamTxbGetCount関数の戻り値以上の値を指定した場合は
	アサートします。\n
*/
// ===========================================================================
extern NNF_TEXFILE_MINFILTER amTxbGetMinFilter(const void* txb, Uint32 tex_no);

// ===========================================================================
//	amTxbGetName
/*!
	テクスチャ名取得

	@param txb		[in] TXBファイルバッファへのポインタ
	@param tex_no	[in] テクスチャ番号
	@return テクスチャ名
	@note
	テクスチャ番号にamTxbGetCount関数の戻り値以上の値を指定した場合は
	アサートし0番目のテクスチャ名を返します。\n
	いかなる場合でも、戻り値は非NULLであることが保障されます。\n
*/
// ===========================================================================
extern const char* amTxbGetName(const void* txb, Uint32 tex_no);

// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）
// ----- Static Functions --------------------（スタティック関数の定義：局所）

#endif // !defined(_AM_TXB_H)

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
