/****************************************************************************
 *
 * CRI Middleware SDK
 *
 * Copyright (c) 2008 CRI Middleware Co.,Ltd.
 *
 * Library  : Sample Library
 * Module   : Sample I/O interface
 * File     : CriSmpCustomIo.h
 *
 ****************************************************************************/

/* 多重定義防止					*/
/* Prevention of redefinition	*/
#ifndef	_CRISMPFSCUSTOMIO_H_INCLUDED
#define	_CRISMPFSCUSTOMIO_H_INCLUDED

/***************************************************************************
 *      インクルードファイル
 *      Include files
 ***************************************************************************/
#include "cri_xpt.h"
#include "cri_file_system.h"

/***************************************************************************
 *      定数マクロ
 *      Macro Constants
 ***************************************************************************/

/***************************************************************************
 *      処理マクロ
 *      Macro Functions
 ***************************************************************************/

/***************************************************************************
 *      データ型宣言
 *      Data Type Declarations
 ***************************************************************************/

/***************************************************************************
 *      変数宣言
 *      Prototype Variables
 ***************************************************************************/

/***************************************************************************
 *      関数宣言
 *      Prototype Functions
 ***************************************************************************/
/* I/Oインターフェース選択関数 */
#ifdef __cplusplus
extern "C" {
#endif
CriError CriSmpFsSelectIoFunc(const CriChar8 *path,
	CriFsDeviceId *device_id, CriFsIoInterfacePtr *ioif);
#ifdef __cplusplus
}
#endif

/***************************************************************************
 *      クラス宣言
 *      Prototype Classes
 ***************************************************************************/

#endif	/* _CRISMPFSCUSTOMIO_H_INCLUDED */

/* --- end of file --- */
