// ===========================================================================
/*!
	@file	aoAccount.cpp
	@brief	AoLibrary アカウント管理モジュール定義

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================

// ----- Include Files ---------------------------------------（インクルード）
#include "pch.h"
#include "ao.h"

#if !defined(AOD_PLATFORM_XBOX360)

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）

// ===========================================================================
//	s32 g_ao_account_current_id
// ---------------------------------------------------------------------------
//!	カレントアカウントID
// ===========================================================================
static s32 g_ao_account_current_id = -1;

// ----- Global Functions ----------------------（グローバル関数の定義：外部）

// ===========================================================================
//	AoAccountInit
/*!
	アカウント管理モジュール初期化処理

	@note
	アプリケーション起動時に1度だけ呼び出して下さい。\n
*/
// ===========================================================================
void AoAccountInit(void)
{
	g_ao_account_current_id = -1;

#if defined(AOD_DEBUG)
	AoAccountDebugInit();
#endif // defined(AOD_DEBUG);
}

// ===========================================================================
//	AoAccountDebugInit
/*!
	デバッグ用初期化処理

	@note
	デバッグ用にカレントアカウントID自動設定します。\n
	設定されるIDは、接続されている最も若い番号のパッドのIDとなります。\n
	パッドが接続されていない場合は0番が設定されます。\n
	デバッグ環境外の場合は何も行いません。\n
	デバッグ環境では、AoAccountInit関数内で呼び出されています。\n
*/
// ===========================================================================
void AoAccountDebugInit(void)
{
#if defined(AOD_DEBUG)
	g_ao_account_current_id = 0;
//	for (u32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
//		if (AoPadIsConnected(i)) {
//			g_ao_account_current_id = (s32)i;
//			break;
//		}
//	}
#endif // defined(AOD_DEBUG)
}

// ===========================================================================
//	AoAccountExit
/*!
	アカウント管理モジュール終了処理

	@note
	アプリケーション終了時に1度だけ呼び出して下さい。\n
	AoAccountInit関数が呼び出されていない状態では、
	この関数を呼び出さないようにして下さい。\n
	この関数を呼出し後、再度AoAccountInit関数を呼び出すことはできません。\n
*/
// ===========================================================================
void AoAccountExit(void)
{
	// empty
}

// ===========================================================================
//	AoAccountClearCurrentId
/*!
	カレントアカウントIDをクリア(初期状態)

	@note
	カレントのアカウントを未定の状態にし、
	AoAccountInit関数呼び出し直後の状態にします。\n
*/
// ===========================================================================
void AoAccountClearCurrentId(void)
{
	g_ao_account_current_id = -1;
}

// ===========================================================================
//	AoAccountSetCurrentIdStart
/*!
	カレントアカウントIDの設定開始

	@param id		[in] 設定するカレントアカウントID
	@note
	カレントのアカウントID(有効なパッドID)の設定を行います。\n
	この関数が呼び出されると、
	必要に応じてアカウントの選択処理やログイン処理が行われるため、
	カレントアカウントの設定が完了するまでに時間が掛かる場合があります。\n
	カレントアカウントの設定が完了したかどうかは、
	AoAccountSetCurrentIdIsFinished関数で判定して下さい。\n
	また、設定がキャンセルされる場合もありますので、設定完了後
	AoAccountGetCurrentIdで有効なアカウントIDが取得できるかを
	判定するようにして下さい。\n
	カレントアカウントが設定されていない状態で呼び出して下さい。\n
*/
// ===========================================================================
void AoAccountSetCurrentIdStart(u32 id)
{
	amAssert(id < AOD_ACCOUNT_MAX);
	g_ao_account_current_id = (s32)id;
}

// ===========================================================================
//	AoAccountSetCurrentIdIsFinished
/*!
	カレントアカウントIDの設定完了判定

	@return 真：設定完了　偽：設定中
	@note
	AoAccountSetCurrentIdStart関数で開始した、
	カレントアカウントの設定処理が完了したかどうかを判定します。\n
*/
// ===========================================================================
BOOL AoAccountSetCurrentIdIsFinished(void)
{
	return TRUE;
}

// ===========================================================================
//	AoAccountGetCurrentId
/*!
	カレントアカウントIDの取得

	@return カレントアカウントID(負数：カレントなし)
	@note
	現在のカレントアカウントIDを返します。\n
	カレントアカウントIDが無効な場合は負数を返します。\n
	AoAccountSetCurrentIdStart関数を呼び出し、
	AoAccountSetCurrentIdIsFinished関数がTRUEを返した後に、
	この関数が負数を返すか正数を返すかで、
	カレントアカウントが設定されたか、キャンセルされたかを判定して下さい。\n
	一度、正常なアカウントIDを返すようになると、
	AoAccountClearCurrentId関数を呼び出すまで、
	返す値が変わることはありません。\n
*/
// ===========================================================================
s32 AoAccountGetCurrentId(void)
{
	return g_ao_account_current_id;
}

// ===========================================================================
//	AoAccountIsCurrentSignin
/*!
	カレントアカウントIDのサインイン済み判定

	@return 真：サインイン済み　偽：サインインしていない
	@note
	カレントアカウントIDが設定されている場合に、
	カレントアカウントがサインインしてるかどうかを判定します。\n
*/
// ===========================================================================
BOOL AoAccountIsCurrentSignin(void)
{
	if (AoAccountGetCurrentId() >= 0) {
		return TRUE;
	}
	return FALSE;
}

// ===========================================================================
//	AoAccountIsCurrentOnline
/*!
	カレントアカウントIDのオンライン対応判定

	@return 真：オンライン対応　偽：非対応
	@note
	カレントアカウントIDが設定されている場合に、
	カレントアカウントがオンライン対応してるかどうかを判定します。\n
*/
// ===========================================================================
BOOL AoAccountIsCurrentOnline(void)
{
	return TRUE;
}

// ===========================================================================
//	AoAccountIsCurrentEnable
/*!
	カレントアカウント有効判定

	@return 真：有効　偽：無効
	@note
	現在、カレントアカウントが有効であるかどうかを判定します。\n
	AoAccountSetCurrentIdStart関数でカレントアカウントを設定した後、
	この関数がFALSEを返す場合は、
	ユーザ操作によりアカウントが無効にされたことになるので、
	以降、アカウントを使用した各種処理は行えなくなります。\n
	タイトル画面へ戻るなどの対処を行うようにして下さい。\n
*/
// ===========================================================================
BOOL AoAccountIsCurrentEnable(void)
{
	if ((u32)g_ao_account_current_id < AOD_ACCOUNT_MAX) {
		return TRUE;
	}
	return FALSE;
}

// ----- Static Functions --------------------（スタティック関数の定義：局所）

#endif // !defined(AOD_PLATFORM_XBOX360)

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
