// ===========================================================================
/*!
	@file	aoPad.cpp
	@brief	AoLibrary パッドシステム定義

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================

// ----- Include Files ---------------------------------------（インクルード）
#include "pch.h"
#include "ao.h"

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）

// ***************************************************************************
// カレントユーザのパッド取得
// カレントユーザがいない状況で呼び出した場合はアサートします
// ***************************************************************************
// ===========================================================================
//! デジタル 直値(押している間ON)								PAD_DIRECT
// ===========================================================================
u16 AoPadDirect(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_DIRECT(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! デジタル スタンド(押した瞬間のみON)							PAD_STAND
// ===========================================================================
u16 AoPadStand(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_STAND(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! デジタル リピート(押し続けていると一定周期でON)				PAD_REPEAT
// ===========================================================================
u16 AoPadRepeat(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_REPEAT(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! デジタル リリース(離した瞬間のみON)							PAD_RELEASE
// ===========================================================================
u16 AoPadRelease(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_RELEASE(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! アナログ 直値(押している間ON)								PAD_ADIRECT
// ===========================================================================
u16 AoPadADirect(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_ADIRECT(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! アナログ スタンド(押した瞬間のみON)							PAD_ASTAND
// ===========================================================================
u16 AoPadAStand(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_ASTAND(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! アナログ リピート(押し続けていると一定周期でON)				PAD_AREPEAT
// ===========================================================================
u16 AoPadARepeat(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_AREPEAT(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! アナログ リリース(離した瞬間のみON)							PAD_ARELEASE
// ===========================================================================
u16 AoPadARelease(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_ARELEASE(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! アナログ+デジタル 直値(押している間ON)						PAD_MDIRECT
// ===========================================================================
u16 AoPadMDirect(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return (u16)PAD_MDIRECT(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! アナログ+デジタル スタンド(押した瞬間のみON)				PAD_MSTAND
// ===========================================================================
u16 AoPadMStand(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return (u16)PAD_MSTAND(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! アナログ+デジタル リピート(押し続けていると一定周期でON)	PAD_MREPEAT
// ===========================================================================
u16 AoPadMRepeat(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return (u16)PAD_MREPEAT(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! アナログ+デジタル リリース(離した瞬間のみON)				PAD_MRELEASE
// ===========================================================================
u16 AoPadMRelease(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return (u16)PAD_MRELEASE(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! 左アナログスティックX値										PAD_A_LX
// ===========================================================================
s16 AoPadAnalogLX(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_A_LX(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! 左アナログスティックY値										PAD_A_LY
// ===========================================================================
s16 AoPadAnalogLY(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_A_LY(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! 右アナログスティックX値										PAD_A_RX
// ===========================================================================
s16 AoPadAnalogRX(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_A_RX(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! 右アナログスティックY値										PAD_A_RY
// ===========================================================================
s16 AoPadAnalogRY(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_A_RY(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! 左トリガー値												PAD_A_L2
// ===========================================================================
s16 AoPadTriggerL(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_A_L2(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! 右トリガー値												PAD_A_R2
// ===========================================================================
s16 AoPadTriggerR(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_A_R2(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! 傾きセンサーX値(Wii/PS3のみ)								PAD_AXIS_X
// ===========================================================================
AOT_AXIS AoPadAxisX(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_AXIS_X(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! 傾きセンサーY値(Wii/PS3のみ)								PAD_AXIS_Y
// ===========================================================================
AOT_AXIS AoPadAxisY(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_AXIS_Y(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! 傾きセンサーZ値(Wii/PS3のみ)								PAD_AXIS_Z
// ===========================================================================
AOT_AXIS AoPadAxisZ(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_AXIS_Z(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! 傾きセンサーG値(PS3のみ)									PAD_AXIS_G
// ===========================================================================
s16 AoPadAxisG(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_AXIS_G(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! X軸回転角(Wii/PS3のみ)										PAD_ROT_X
// ===========================================================================
Angle32 AoPadRotX(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_ROT_X(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! Y軸回転角(Wii/PS3のみ)※計測不可							PAD_ROT_Y
// ===========================================================================
Angle32 AoPadRotY(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_ROT_Y(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! Z軸回転角(Wii/PS3のみ)										PAD_ROT_Z
// ===========================================================================
Angle32 AoPadRotZ(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_ROT_Z(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! ポインター有効判定(Wii/PCのみ)								PAD_POS_ENABLE
// ===========================================================================
BOOL AoPadPointEnable(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_POS_ENABLE(AoAccountGetCurrentId());
	}
	amAssert(0);
	return FALSE;
}

// ===========================================================================
//! ポインターX値取得(Wii/PCのみ)								PAD_POS_X
// ===========================================================================
s16 AoPadPointX(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_POS_X(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! ポインターY値取得(Wii/PCのみ)								PAD_POS_Y
// ===========================================================================
s16 AoPadPointY(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_POS_Y(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}

// ===========================================================================
//! ポインターZ値取得(Wiiのみ)※センサーバーからの距離(m)		PAD_POS_Z
// ===========================================================================
f32 AoPadPointZ(void)
{
	if((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		return PAD_POS_Z(AoAccountGetCurrentId());
	}
	amAssert(0);
	return 0;
}


// ***************************************************************************
// 誰か一人でも入力があるか判定
// 引数に任意のボタン定義の組み合わせを指定 -> 押しているパッドIDが帰る
// 該当なしの場合は-1を返す
// 複数パッドで入力がある場合は若い番号を優先する
// ***************************************************************************
// ===========================================================================
//! デジタル 直値(押している間ON)								PAD_DIRECT
// ===========================================================================
s32 AoPadSomeoneDirect(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_DIRECT(i) & key) {
			return i;
		}
	}
	return -1;
}

// ===========================================================================
//! デジタル スタンド(押した瞬間のみON)							PAD_STAND
// ===========================================================================
s32 AoPadSomeoneStand(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_STAND(i) & key) {
			return i;
		}
	}
	return -1;
}

// ===========================================================================
//! デジタル リピート(押し続けていると一定周期でON)				PAD_REPEAT
// ===========================================================================
s32 AoPadSomeoneRepeat(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_REPEAT(i) & key) {
			return i;
		}
	}
	return -1;
}

// ===========================================================================
//! デジタル リリース(離した瞬間のみON)							PAD_RELEASE
// ===========================================================================
s32 AoPadSomeoneRelease(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_RELEASE(i) & key) {
			return i;
		}
	}
	return -1;
}

// ===========================================================================
//! アナログ 直値(押している間ON)								PAD_ADIRECT
// ===========================================================================
s32 AoPadSomeoneADirect(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_ADIRECT(i) & key) {
			return i;
		}
	}
	return -1;
}

// ===========================================================================
//! アナログ スタンド(押した瞬間のみON)							PAD_ASTAND
// ===========================================================================
s32 AoPadSomeoneAStand(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_ASTAND(i) & key) {
			return i;
		}
	}
	return -1;
}

// ===========================================================================
//! アナログ リピート(押し続けていると一定周期でON)				PAD_AREPEAT
// ===========================================================================
s32 AoPadSomeoneARepeat(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_AREPEAT(i) & key) {
			return i;
		}
	}
	return -1;
}

// ===========================================================================
//! アナログ リリース(離した瞬間のみON)							PAD_ARELEASE
// ===========================================================================
s32 AoPadSomeoneARelease(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_ARELEASE(i) & key) {
			return i;
		}
	}
	return -1;
}

// ===========================================================================
//! アナログ+デジタル 直値(押している間ON)						PAD_MDIRECT
// ===========================================================================
s32 AoPadSomeoneMDirect(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_MDIRECT(i) & key) {
			return i;
		}
	}
	return -1;
}

// ===========================================================================
//! アナログ+デジタル スタンド(押した瞬間のみON)				PAD_MSTAND
// ===========================================================================
s32 AoPadSomeoneMStand(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_MSTAND(i) & key) {
			return i;
		}
	}
	return -1;
}

// ===========================================================================
//! アナログ+デジタル リピート(押し続けていると一定周期でON)	PAD_MREPEAT
// ===========================================================================
s32 AoPadSomeoneMRepeat(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_MREPEAT(i) & key) {
			return i;
		}
	}
	return -1;
}

// ===========================================================================
//! アナログ+デジタル リリース(離した瞬間のみON)				PAD_MRELEASE
// ===========================================================================
s32 AoPadSomeoneMRelease(u16 key)
{
	for (s32 i = 0; i < AOD_PAD_PORT_MAX; ++i) {
		if (PAD_MRELEASE(i) & key) {
			return i;
		}
	}
	return -1;
}


// ***************************************************************************
// ユーザごとのパッド取得(AliceNNのPAD_***と同等)
// ***************************************************************************
// ===========================================================================
//! デジタル 直値(押している間ON)								PAD_DIRECT
// ===========================================================================
u16 AoPadPortDirect(u32 port)
{
	return PAD_DIRECT(port);
}

// ===========================================================================
//! デジタル スタンド(押した瞬間のみON)							PAD_STAND
// ===========================================================================
u16 AoPadPortStand(u32 port)
{
	return PAD_STAND(port);
}

// ===========================================================================
//! デジタル リピート(押し続けていると一定周期でON)				PAD_REPEAT
// ===========================================================================
u16 AoPadPortRepeat(u32 port)
{
	return PAD_REPEAT(port);
}

// ===========================================================================
//! デジタル リリース(離した瞬間のみON)							PAD_RELEASE
// ===========================================================================
u16 AoPadPortRelease(u32 port)
{
	return PAD_RELEASE(port);
}

// ===========================================================================
//! アナログ 直値(押している間ON)								PAD_ADIRECT
// ===========================================================================
u16 AoPadPortADirect(u32 port)
{
	return PAD_ADIRECT(port);
}

// ===========================================================================
//! アナログ スタンド(押した瞬間のみON)							PAD_ASTAND
// ===========================================================================
u16 AoPadPortAStand(u32 port)
{
	return PAD_ASTAND(port);
}

// ===========================================================================
//! アナログ リピート(押し続けていると一定周期でON)				PAD_AREPEAT
// ===========================================================================
u16 AoPadPortARepeat(u32 port)
{
	return PAD_AREPEAT(port);
}

// ===========================================================================
//! アナログ リリース(離した瞬間のみON)							PAD_ARELEASE
// ===========================================================================
u16 AoPadPortARelease(u32 port)
{
	return PAD_ARELEASE(port);
}

// ===========================================================================
//! アナログ+デジタル 直値(押している間ON)						PAD_MDIRECT
// ===========================================================================
u16 AoPadPortMDirect(u32 port)
{
	return (u16)PAD_MDIRECT(port);
}

// ===========================================================================
//! アナログ+デジタル スタンド(押した瞬間のみON)				PAD_MSTAND
// ===========================================================================
u16 AoPadPortMStand(u32 port)
{
	return (u16)PAD_MSTAND(port);
}

// ===========================================================================
//! アナログ+デジタル リピート(押し続けていると一定周期でON)	PAD_MREPEAT
// ===========================================================================
u16 AoPadPortMRepeat(u32 port)
{
	return (u16)PAD_MREPEAT(port);
}

// ===========================================================================
//! アナログ+デジタル リリース(離した瞬間のみON)				PAD_MRELEASE
// ===========================================================================
u16 AoPadPortMRelease(u32 port)
{
	return (u16)PAD_MRELEASE(port);
}

// ===========================================================================
//! 左アナログスティックX値										PAD_A_LX
// ===========================================================================
s16 AoPadPortAnalogLX(u32 port)
{
	return PAD_A_LX(port);
}

// ===========================================================================
//! 左アナログスティックY値										PAD_A_LY
// ===========================================================================
s16 AoPadPortAnalogLY(u32 port)
{
	return PAD_A_LY(port);
}

// ===========================================================================
//! 右アナログスティックX値										PAD_A_RX
// ===========================================================================
s16 AoPadPortAnalogRX(u32 port)
{
	return PAD_A_RX(port);
}

// ===========================================================================
//! 右アナログスティックY値										PAD_A_RY
// ===========================================================================
s16 AoPadPortAnalogRY(u32 port)
{
	return PAD_A_RY(port);
}

// ===========================================================================
//! 左トリガー値												PAD_A_L2
// ===========================================================================
s16 AoPadPortTriggerL(u32 port)
{
	return PAD_A_L2(port);
}

// ===========================================================================
//! 右トリガー値												PAD_A_R2
// ===========================================================================
s16 AoPadPortTriggerR(u32 port)
{
	return PAD_A_R2(port);
}

// ===========================================================================
//! 傾きセンサーX値(Wii/PS3のみ)								PAD_AXIS_X
// ===========================================================================
AOT_AXIS AoPadPortAxisX(u32 port)
{
	return PAD_AXIS_X(port);
}

// ===========================================================================
//! 傾きセンサーY値(Wii/PS3のみ)								PAD_AXIS_Y
// ===========================================================================
AOT_AXIS AoPadPortAxisY(u32 port)
{
	return PAD_AXIS_Y(port);
}

// ===========================================================================
//! 傾きセンサーZ値(Wii/PS3のみ)								PAD_AXIS_Z
// ===========================================================================
AOT_AXIS AoPadPortAxisZ(u32 port)
{
	return PAD_AXIS_Z(port);
}

// ===========================================================================
//! 傾きセンサーG値(PS3のみ)									PAD_AXIS_G
// ===========================================================================
s16 AoPadPortAxisG(u32 port)
{
	return PAD_AXIS_G(port);
}

// ===========================================================================
//! X軸回転角(Wii/PS3のみ)										PAD_ROT_X
// ===========================================================================
Angle32 AoPadPortRotX(u32 port)
{
	return PAD_ROT_X(port);
}

// ===========================================================================
//! Y軸回転角(Wii/PS3のみ)※計測不可							PAD_ROT_Y
// ===========================================================================
Angle32 AoPadPortRotY(u32 port)
{
	return PAD_ROT_Y(port);
}

// ===========================================================================
//! Z軸回転角(Wii/PS3のみ)										PAD_ROT_Z
// ===========================================================================
Angle32 AoPadPortRotZ(u32 port)
{
	return PAD_ROT_Z(port);
}

// ===========================================================================
//! ポインター有効判定(Wii/PCのみ)								PAD_POS_ENABLE
// ===========================================================================
BOOL AoPadPortPointEnable(u32 port)
{
	return PAD_POS_ENABLE(port);
}

// ===========================================================================
//! ポインターX値取得(Wii/PCのみ)								PAD_POS_X
// ===========================================================================
s16 AoPadPortPointX(u32 port)
{
	return PAD_POS_X(port);
}

// ===========================================================================
//! ポインターY値取得(Wii/PCのみ)								PAD_POS_Y
// ===========================================================================
s16 AoPadPortPointY(u32 port)
{
	return PAD_POS_Y(port);
}

// ===========================================================================
//! ポインターZ値取得(Wiiのみ)※センサーバーからの距離(m)		PAD_POS_Z
// ===========================================================================
f32 AoPadPortPointZ(u32 port)
{
	return PAD_POS_Z(port);
}


// ***************************************************************************
// パッド状態
// ***************************************************************************
// ===========================================================================
//! 指定ポートにパッドが接続されているか判定
// ===========================================================================
BOOL AoPadIsConnected(u32 port)
{
	if (PAD_CONNECT(port)) {
		return TRUE;
	}
	return FALSE;
}

// ===========================================================================
//! カレントユーザのパッドが接続されているか判定
// ===========================================================================
BOOL AoPadIsConnected(void)
{
	s32 id = AoAccountGetCurrentId();
	if (id < 0) {
		return FALSE;
	}
	return AoPadIsConnected((u32)id);
}


// ***************************************************************************
// バイブレーション
// ***************************************************************************
// ===========================================================================
//! バイブレーションの有効/無効設定						amPadEnableVibration
// ===========================================================================
void AoPadEnableVibration(BOOL flag)
{
	if ((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		amPadEnableVibration((s32)AoAccountGetCurrentId(), (s32)flag);
	}
	else {
		amAssert(0);
	}
}

// ===========================================================================
//! バイブレーションの設定									amPadSetVibration
// ===========================================================================
void AoPadSetVibration(u16 left, u16 right)
{
#if defined(AOD_PLATFORM_WII)
	// HBM表示時は振動を無効にする
	if (amWiiIsDrawHBM()) {
		left = 0;
		right = 0;
	}
#endif // defined(AOD_PLATFORM_WII)

	if ((u32)AoAccountGetCurrentId() < AOD_PAD_PORT_MAX) {
		amPadSetVibration((s32)AoAccountGetCurrentId(), left, right);
	}
	else {
		amAssert(0);
	}
}

// ----- Static Functions --------------------（スタティック関数の定義：局所）

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
