// ===========================================================================
/*!
	@file	aoSysMsg.cpp
	@brief	AoLibrary システムメッセージモジュール定義

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================

// ----- Include Files ---------------------------------------（インクルード）
#include "pch.h"
#include "ao.h"

#if defined(AOD_PLATFORM_IPHONE)

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）

// ===========================================================================
//	AoSysMsgSetBaseMsgFile
/*!
	メッセージファイル設定

	@param file		[in] メッセージファイル
	@note
	AOE_SYS_MSG_IDのメッセージ内容やAOE_SYS_MSG_SELECTの選択内容を記述した
	メッセージファイルを設定します。\n
	このモジュールを使用するためには、
	この関数で適切なメッセージファイルが設定されている必要があります。\n
	アプリケーション開始時に設定し、以降解放はしない使い方を想定しています。\n
*/
// ===========================================================================
void AoSysMsgSetBaseMsgFile(const void* file)
{
	// 未作成
	UNREFERENCED_PARAMETER(file);
}

// ===========================================================================
//	AoSysMsgGetBaseMsgFile
/*!
	メッセージファイル取得

	@return メッセージファイル
*/
// ===========================================================================
const void* AoSysMsgGetBaseMsgFile(void)
{
	// 未作成
	return NULL;
}

// ===========================================================================
//	AoSysMsgStart
/*!
	システムメッセージ開始

	@param id		[in] メッセージID
	@param select	[in] 選択項目
	@note
	指定IDのメッセージと選択項目を表示する
	システムメッセージの表示を開始します。\n
	すでにシステムメッセージの表示を行っている場合
	(AoSysMsgIsFinished関数がFALSEを返す場合)は
	アサートし何も行いません。\n
*/
// ===========================================================================
void AoSysMsgStart(AOE_SYS_MSG_ID id, AOE_SYS_MSG_SELECT select)
{
	// 未作成
	UNREFERENCED_PARAMETER(id);
	UNREFERENCED_PARAMETER(select);
}

// ===========================================================================
//	AoSysMsgStart
/*!
	システムメッセージ開始

	@param file		[in] メッセージファイル
	@param id		[in] メッセージID
	@param select	[in] 選択項目
	@note
	指定のメッセージファイル内の指定のIDのメッセージと
	選択項目を表示するシステムメッセージの表示を開始します。\n
	すでにシステムメッセージの表示を行っている場合
	(AoSysMsgIsFinished関数がFALSEを返す場合)は
	アサートし何も行いません。\n
	メッセージファイルは、
	メッセージの表示が終了するまで解放しないようにしてください。\n
*/
// ===========================================================================
void AoSysMsgStart(const void* file, u32 id, AOE_SYS_MSG_SELECT select)
{
	// 未作成
	UNREFERENCED_PARAMETER(file);
	UNREFERENCED_PARAMETER(id);
	UNREFERENCED_PARAMETER(select);
}

// ===========================================================================
//	AoSysMsgCancel
/*!
	システムメッセージキャンセル

	@note
	現在表示しているシステムメッセージを
	ユーザの決定を待たずにキャンセルします。\n
	キャンセルした場合は、結果として
	必ずAOD_SYS_MSG_RESULT_SYS_CANCELを返します。\n
	この関数を呼び出しても、すぐには完了しないので、
	必ずAoSysMsgIsFinished関数で完了を判定するようにして下さい。\n
	AoSysMsgIsFinished関数がTRUEを返す状態で呼び出した場合は
	アサートし何も行いません。\n
*/
// ===========================================================================
void AoSysMsgCancel(void)
{
	// 未作成
}

// ===========================================================================
//	AoSysMsgIsFinished
/*!
	システムメッセージ表示完了判定

	@return 真：完了　偽：表示中
	@note
	AoSysMsgStart関数で開始したメッセージ表示が完了したかどうかを判定します。\n
*/
// ===========================================================================
BOOL AoSysMsgIsFinished(void)
{
	return TRUE;
}

// ===========================================================================
//	AoSysMsgGetResult
/*!
	システムメッセージ結果取得

	@return 結果
	@note
	直前に表示したメッセージの結果を返します。\n
	AoSysMsgIsFinished関数がFALSEを返す状態で呼び出した場合は、
	アサートしAOD_SYS_MSG_RESULT_NONEを返します。\n
	AoSysMsgStart関数を呼び出した段階で
	以前の結果はクリアされるので注意して下さい。\n
*/
// ===========================================================================
AOE_SYS_MSG_RESULT AoSysMsgGetResult(void)
{
	// 未作成
	return AOD_SYS_MSG_RESULT_NONE;
}

// ===========================================================================
//	AoSysMsgIsShow
/*!
	システムメッセージ表示中判定

	@return 真：完了　偽：表示中
	@note
	システムメッセージが現在表示されているかどうかを判定します。\n
	通常、AoSysMsgStart関数呼び出しにより即時にメッセージ表示されますが、
	既存のUI表示がされている場合などは、
	終了を待ってからメッセージの表示を行ないます。\n
	既存のUI表示の終了待ち中はFALSEを返し、実際に表示されている場合のみ
	TRUEを返します。\n
*/
// ===========================================================================
BOOL AoSysMsgIsShow(void)
{
	return AoSysMsgIsShowReal();
}

// ===========================================================================
//	AoSysMsgIsShowReal
/*!
	システムメッセージ表示中判定

	@return 真：完了　偽：表示中
	@note
	AoSysMsgIsShow関数とほぼ同じ関数になりますが、
	AoSysMsgIsShow関数は、
	実際に非表示になった数フレーム後に非表示を返すのに対し、
	この関数は、非表示になった瞬間に非表示を返します。\n
*/
// ===========================================================================
BOOL AoSysMsgIsShowReal(void)
{
	// 未作成
	return FALSE;
}

// ----- Static Functions --------------------（スタティック関数の定義：局所）

#endif // defined(AOD_PLATFORM_IPHONE)

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
