// ===========================================================================
/*!
	@file	aoTrophyWin32.h
	@brief	AoLibrary トロフィー管理モジュール定義(Win32)

	@author	K.OKUGAWA Copyright (C) 2009 Dimps.
 */
// ===========================================================================

// ----- Include Files ---------------------------------------（インクルード）
#include "pch.h"
#include "ao.h"

#if !defined(AOD_PLATFORM_PS3) && !defined(AOD_PLATFORM_XBOX360)

// ----- Macros ------------------------------------------------（マクロ定義）
// ----- Macro Functions -----------------------------------（処理マクロ定義）
// ----- Definitions -------------------------------------------（定数の宣言）
// ----- Struct Definitions --------------------------------------（型の宣言）
// ----- Class Definitions -------------------------------------（クラス宣言）
// ----- External Declarations -----------------（グローバル変数及び関数宣言）
// ----- Static Declarations -----------------（スタティック変数及び関数宣言）
// ----- Global Variables ----------------------（グローバル変数の定義：外部）
// ----- Static Variables --------------------（スタティック変数の定義：局所）
// ----- Global Functions ----------------------（グローバル関数の定義：外部）

// ***************************************************************************
// 初期化&終了処理
// ***************************************************************************
// ===========================================================================
//	AoTrophyInit
/*!
	トロフィー管理モジュール初期化処理

	@param is_trial	[in] 真：体験版　偽：製品版
	@note
	アプリケーション起動時に1度だけ呼び出して下さい。\n
	あらかじめ、AoAccountInit関数が呼ばれている必要があります。\n
*/
// ===========================================================================
void AoTrophyInit(BOOL is_trial)
{
	UNREFERENCED_PARAMETER(is_trial);
	// empty
}

// ===========================================================================
//	AoTrophyExit
/*!
	トロフィー管理モジュール終了処理

	@note
	アプリケーション終了時に1度だけ呼び出して下さい。\n
	AoTrophyInit関数が呼び出されていない状態では、
	この関数を呼び出さないようにして下さい。\n
	この関数を呼出し後、再度AoTrophyInit関数を呼び出すことはできません。\n
*/
// ===========================================================================
void AoTrophyExit(void)
{
	// empty
}


// ***************************************************************************
// エラー
// ***************************************************************************
// ===========================================================================
//	AoTrophyIsError
/*!
	エラー判定

	@return 真：エラーあり　偽：エラーなし
	@note
	このモジュール内でエラーが発生したかどうかを判定します。\n
	AoTrophyClearError関数を呼び出すと、エラーなしの状態となり、
	その後エラーが発生するとTRUEを返すようになります。\n
*/
// ===========================================================================
BOOL AoTrophyIsError(void)
{
	// empty
	return FALSE;
}

// ===========================================================================
//	AoTrophyGetError
/*!
	エラー取得

	@return 真：エラー
	@note
	最後に発生したエラー情報を返します。\n
	AoTrophyIsError関数がFALSEを返す状態で呼び出すと
	AOD_TROPHY_ERROR_NONEを返します。\n
*/
// ===========================================================================
AOE_TROPHY_ERROR AoTrophyGetError(void)
{
	// empty
	return AOD_TROPHY_ERROR_NONE;
}

// ===========================================================================
//	AoTrophyClearError
/*!
	エラークリア
*/
// ===========================================================================
void AoTrophyClearError(void)
{
	// empty
}


// ***************************************************************************
// インストール
// ***************************************************************************
// ===========================================================================
//	AoTrophyInstallStart
/*!
	トロフィーのインストール開始

	@note
	アプリケーションでトロフィー関連の処理を行うために、
	(必要なプラットフォームのみ)
	トロフィーファイルのインストールを行います。\n
*/
// ===========================================================================
void AoTrophyInstallStart(void)
{
	// empty
}

// ===========================================================================
//	AoTrophyInstallIsFinished
/*!
	トロフィーのインストール完了判定

	@return 真：完了済み　偽：インストール中
	@note
	AoTrophyInstallStart関数で開始したインストール処理が
	完了したかどうかを判定します。\n
	AoTrophyInstallStart関数を呼び出していない場合はTRUEを返します。\n
*/
// ===========================================================================
BOOL AoTrophyInstallIsFinished(void)
{
	// empty
	return TRUE;
}

// ===========================================================================
//	AoTrophyInstallIsSuccess
/*!
	トロフィーのインストール成功判定

	@return 真：成功　偽：失敗
	@note
	AoTrophyInstallStart関数で開始したインストール処理が
	成功したかどうかを判定します。\n
	この関数はAoTrophyInstallIsFinished関数が
	TRUEを返す状態でのみ呼び出し可能です。\n
	インストールが失敗した場合の詳細は、
	AoTrophyGetError関数で取得して下さい。\n
	AoTrophyInstallStart関数を呼び出していない場合はFALSEを返します。\n
*/
// ===========================================================================
BOOL AoTrophyInstallIsSuccess(void)
{
	// empty
	return TRUE;
}


// ***************************************************************************
// 獲得
// ***************************************************************************
// ===========================================================================
//	AoTrophyAcquisitionTaskStart
/*!
	トロフィー獲得監視タスク開始

	@note
	AoTrophyAcquisition関数によるトロフィーの獲得を監視し、
	必要な獲得処理を行うタスクを生成します。\n
	この関数でタスクの生成を行わないとトロフィーの獲得処理が行われません。\n
	すでに生成済みの場合は何も行いません。\n
*/
// ===========================================================================
void AoTrophyAcquisitionTaskStart(void)
{
	// empty
}

// ===========================================================================
//	AoTrophyAcquisitionTaskEnd
/*!
	トロフィー獲得監視タスク終了

	@note
	AoTrophyAcquisitionTaskStart関数で開始した監視タスクを終了させます。\n
	以降、AoTrophyAcquisition関数でトロフィー獲得を指示しても、
	再度監視タスクを生成するまで獲得処理は行われません。\n
	すでに終了済みの場合は何も行いません。\n
*/
// ===========================================================================
void AoTrophyAcquisitionTaskEnd(void)
{
	// empty
}

// ===========================================================================
//	AoTrophyAcquisition
/*!
	トロフィー獲得

	@param no	[in] トロフィー番号
*/
// ===========================================================================
void AoTrophyAcquisition(u32 no)
{
	UNREFERENCED_PARAMETER(no);
	// empty
}

// ----- Static Functions --------------------（スタティック関数の定義：局所）

#endif // !defined(AOD_PLATFORM_PS3) && !defined(AOD_PLATFORM_XBOX360)

// ===========================================================================
//	function
/*!
	説明

	@param param0	[in] 入力引数0説明
	@param param1	[out] 出力ポインタ引数1説明
	@param param2	[io] 入出力ポインタ引数2説明
	@return 返値説明
	@note 補足説明
*/
// ===========================================================================

// ===========================================================================
//	int variable
// ---------------------------------------------------------------------------
//!	変数説明
// ===========================================================================

	// =======================================================================
	//	function
	/*!
		説明

		@param param0	[in] 入力引数0説明
		@param param1	[out] 出力ポインタ引数1説明
		@param param2	[io] 入出力ポインタ引数2説明
		@return 返値説明
		@note 補足説明
	*/
	// =======================================================================

// ***************************************************************************
// ラベル
// ***************************************************************************
